Repository: a94827/FreeLibSet
Catalog: ExtDB/Res.*.resx
Languages: ru

# Common_Err_ColumnIsNotRef
source: Column '{0}' of table '{1}' is not a reference column
ru: Поле '{0}' таблицы '{1}' не является ссылочным

# DBxCacheLoadException_Error_Nessage
source: {0}. DBxCache query: {1}
ru: {0}. Запрос DBxCache: {1}

# DBxCache_Arg_RefColumnHasNoDot
source: Column '{0}' is not a reference column because doesn't contain a dot
ru: Поле '{0}' не является ссылочным, так как не содержит точки

# DBxCache_Arg_UnknownColumn
source: There is no column '{0}' in table '{1}' structure
ru: Поля '{0}' нет в описании структуры таблицы '{1}'

# DBxCache_ErrTitle_Load
source: Error occurred when DBxCache page loaded
ru: Ошибка получения страницы DBxCache

# DBxCache_Err_IndividualValueNotReturned
source: Individual value for the key '{0}' has not been returned
ru: Не получено индивидуальное значение для ключа '{0}'

# DBxCache_Err_Load
source: Cannot get data from the source
ru: Не удалось получить данные из источника

# DBxCache_Err_TablePageNotReturned
source: Table page for the key '{0}' has not been returned
ru: Не получена страница для ключа '{0}'

# DBxCache_TraceSwitch_Default
source: Database cache tracing (DBxCache)
ru: Трассировка кэша базы данных DBxCache

# DBxClearCacheBuffer_Arg_VersionTooBig
source: Give original Version={0} is greater than last existed buffer version {1}
ru: Переданное исходное значение Version={0} превышает последнюю существующую версию буфера {1}

# DBxCon_Arg_DataRowNullInPKColumn
source: Data row contains DBNull value in primary key column '{0}'
ru: Строка данных имеет значение DBNull в поле первичного ключа '{0}'

# DBxCon_Arg_DataTableHasNoPKColumn
source: DataTable does not have the primary key column '{0}' as defined for the table '{1}' of database '{2}'
ru: Таблица DataTable не содержит поля первичного ключа '{0}', объявленного в таблице '{1}' базы данных '{2}'

# DBxCon_Arg_DataTableMustHaveSingleColumn
source: DataTable must have only one column
ru: Таблица должна иметь только один столбец

# DBxCon_Arg_DataTableWithPKColumn
source: DataTable with rows to find cannot have primary key column '{0}' of table '{1}'
ru: Таблица DataTable со строками для поиска не может содержать столбца '{0}' первичного ключа таблицы '{1}'

# DBxCon_Arg_DBCommandDiffConnection
source: Command belongs to another connection
ru: Команда относится к другому соединению

# DBxCon_Arg_NoId
source: Record identifier is not given
ru: Не задан идентификатор записи

# DBxCon_Arg_UpdateDataTableWithPKOnly
source: DataTable has only primary key columns ({0}). There is no more column for update
ru: Таблица DataTable имеет только столбцы первичного ключа ({0}) и ни одного дополнительного столбца для обновления

# DBxCon_Arg_UseDeleteAll
source: Deleting all rows without a filter is not supported. Use method DeleteAll()
ru: Удаление всех строк таблицы без фильтра не поддерживается. Используйте метод DeleteAll()

# DBxCon_ErrTitle_Rollback
source: Transaction rollback error in database '{0}'
ru: Ошибка отката транзакции в БД '{0}'

# DBxCon_ErrTitle_Sql
source: Error occurred when SQL query executed
ru: Ошибка выполнения запроса

# DBxCon_Err_EndUpdateForTable
source: BeginUpdate() for the table '{0}' has not been called
ru: Не было вызова BeginUpdate() для таблицы '{0}'

# DBxCon_Err_NoTransaction
source: Transaction has not been started
ru: Транзакция не была начата

# DBxCon_Err_PrevTransaction
source: Previous transaction has not been finished yet
ru: Предыдущая транзакция не была завершена

# DBxCon_Err_UpdateNoPK
source: Table '{0}' in the database '{1}' has no primary key. Rows cannnot be updated.
ru: Таблица '{0}' в базе данных '{1}' не имеет первичного ключа. Для нее нельзя использовать операцию обновления строк

# DBxFSqlFormatter_Arg_RefTypeEmulation
source: Should not call in Emulation mode
ru: Не должно вызываться в режиме Emulation

# DBxTransactionArray_ErrTitle_Roolback
source: Error occurred when transaction rolled back
ru: Ошибка отката транзакции

# DBxUserPermission_Msg_AccessModeFull
source: Full
ru: Полный

# DBxUserPermission_Msg_AccessModeNone
source: None
ru: Запрет

# DBxUserPermission_Msg_AccessModeReadOnly
source: Read only
ru: Чтение

# DBx_Err_AlreadyConnected
source: Database '{0}' has already had a connection
ru: С базой данных '{0}' уже было установлено соединение

# DBx_Err_DotColumnNamePart
source: Invalid part #{0} of dotted column name. {1}
ru: Неправильная составная часть №{0} имени поля с точками. {1}

# DBx_Err_HasConnection
source: There is a connection to database '{0}'
ru: Для базы данных '{0}' есть открытые соединения

# DBx_Err_NameStartsWithDigit
source: Name cannot start with a digit
ru: Имя не может начинаться с цифры

# DBx_Err_NoColumnName
source: Column name is empty
ru: Имя поля не задано

# DBx_Err_NoTableName
source: Table name is empty
ru: Имя таблицы не задано

# TablePermission_Name_ObjectText0
source: No tables
ru: Таблицы не заданы

# TablePermission_Name_ObjectText1
source: Table '{0}'
ru: Таблица '{0}'

# TablePermission_Name_ObjectTextN
source: Tables {0}
ru: Таблицы {0}

# WholeDBPermission_Name_ObjectText
source: Database access
ru: Доступ к базе данных

# DBxDataWriter_Arg_ColumnType
source: Column '{0}' of table '{1}' has type {2} and cannot take values of type {3}
ru: Столбец '{0}' таблицы '{1}' имеет тип {2} и не может принимать значения типа {3}

# DBxDataWriter_Arg_OtherColumnRequired
source: For the mode '{0}' column list must contain at least one column not used for the search in the table '{1}'
ru: В режиме '{0}' список столбцов должен включать в себя хотя бы один столбец, не являющийся столбцом для поиска в таблице '{1}'

# DBxDataWriter_Arg_PartialSearchColumns
source: Whole column list cannot contains partial set of search columns ({0}) for the table '{1}'
ru: Список всех столбцов не может содержать только часть столбцов составного ключа для поиска ({0}) в таблице '{1}'

# DBxDataWriter_Arg_SearchColumnRequired
source: For the mode '{0}' there must be seaarch column(s) in the table
ru: В режиме '{0}' должен быть задан список столбцов для поиска

# DBxDataWriter_Err_NoPK
source: Table '{0}' does not contain a primary key. Primary key is required for the mode {1}
ru: Таблица '{0}' не содержит первичного ключа. Первичный ключ требуется для режима '{1}'

# DBxManager_Arg_FileNameBadChars
source: File name '{0}' contains invalid chars
ru: Имя файла '{0}' содержит недопустимые символы

# DBxManager_Err_NoConnectionString
source: There is no connection string with name '{0}' in the settings file. Available connection strings are: {1}
ru: В конфигурационном файле не задана строка подключения с именем '{0}'. Существующие строки подключения: {1}

# DBxManager_Err_ReplaceDBItem
source: Database name '{0}' does not contain a text fragment '{1}' to replace
ru: Имя базы данных '{0}' не содержит в себе фрагмента '{1}', который требуется заменить

# DBxManager_Err_UnknownProviderForSettings
source: Unknown database provider '{0}' for stored connection string '{1}'
ru: Неизвестный провайдер базы данных '{0}' для сохраненной строки подключения '{1}'

# DBxNameValidator_Arg_ColumnListIsEmpty
source: Empty column list
ru: Пустой список имен полей

# DBxNameValidator_Arg_ColumnNotRef
source: Column '{0}' of table '{1}' in database '{2}' is not a refernce column
ru: Столбец '{0}' таблицы '{1}' БД '{2}' не является ссылочным

# DBxNameValidator_Arg_InvalidColumnName
source: Invalid column name '{0}'. {1}
ru: Недопустимое имя столбца '{0}'. {1}

# DBxNameValidator_Arg_InvalidTableName
source: Invalid table name '{0}'. {1}
ru: Недопустимое имя таблицы '{0}'. {1}

# DBxNameValidator_Arg_UnknownColumnName
source: There is no declaration for column '{0}' of table '{1}' in database '{2}'
ru: Определения для столбца '{0}' нет в определении таблицы '{1}' БД '{2}'

# DBxNameValidator_Arg_UnknownTableName
source: There is no declaration for table '{0}' in database '{1}'
ru: Определения для таблицы '{0}' не существует для БД '{1}'

# DBxNameValidator_Err_ColumnRead
source: There is no access permission for column '{0}' of table '{1}'
ru: Запрещен доступ к полю '{0}' таблицы '{1}'

# DBxNameValidator_Err_ColumnWrite
source: There is no writing permission for column '{0}' of table '{1}'. There is only a reading access permission
ru: Запрещено изменение поля '{0}' таблицы '{1}'. Есть право только на просмотр поля

# DBxNameValidator_Err_TableRead
source: There is no access permission for table '{0}'
ru: Нет разрешения на доступ к таблице '{0}'

# DBxNameValidator_Err_TableWrite
source: There is no writing permission for table'{0}'
ru: Нет разрешения на запись в таблицу '{0}'

# DBxRecordNotFoundException_Err_Message
source: Record in table '{0}' with identifier {1} not found
ru: Не найдена запись в таблице '{0}' с идентификатором {1}

# DBxAccessException_Err_Message
source: You have no rights to perform the action
ru: У Вас нет прав для выполнения действия

# DBxNameExpression_Arg_AliasRequired
source: Alias must be given to use expression of type {0}
ru: Для использования выражения типа {0} требуется задавать альяс в явном виде

# DBxSelectFormat_Arg_WrongColumnCount
source: Wrong column count in the table: {0}. Expected: {1}
ru: Неправильное количество столбцов в таблице: {0}. Ожидалось: {1}

# DBxSelectFormat_Err_FormatAlreadyCalled
source: Repeated call of method Format() is not allowed. Instance of FillSelectFormatter can be used only once
ru: Повторный вызов метода Format() не допускается. Объект FillSelectFormatter является одноразовым

# DBxSelectFormat_Err_GroupByWithoutExpr
source: GROUP BY list presented without the expression list (SELECT *)
ru: Задан список GROUP BY без задания списка выражений (SELECT *)

# DBxSelectFormat_Err_HavingWithoutGroupBy
source: HAVING clause presented without GROUP BY
ru: Задано предложение HAVING без GROUP BY

# DBxSelectFormat_Err_NoAliasForColumn
source: Table '{0}' contains column '{1}', but there is no alias for it in the DBxFillSelectInfo.Expressions list
ru: Таблица '{0}' содержит поле '{1}', для которого не найден альяс в списке DBxFillSelectInfo.Expressions

# DBxSelectFormat_Err_NoColumnInDBxSqlBuffer
source: There is no definition for column '{0}' in the DBxSqlBuffer.ColumnStructs list
ru: Для столбца '{0}' не найдено описание поля в списке DBxSqlBuffer.ColumnStructs

# DBxSelectFormat_Err_NoColumnsAccessable
source: For sql expression 'SELECT * FROM {0}' is not possible to get a column list since user has no rights to access to any of table columns
ru: Для выражения 'SELECT * FROM {0}' невозможно получить список полей, так как у пользователя нет прав на просмотр каких-либо столбцов таблицы

# DBxSelectInfo_Err_ColumnAndAggMixed
source: Expressions[{0}] '{1}' contains both an aggregate function and a column reference
ru: Выражение Expressions[{0}] '{1}' содержит одновременно и агрегатную функцию и ссылку на поле таблицы

# DBxSelectInfo_Err_GroupByWithoutExpression
source: Expression list not presented. For operator 'SELECT * FROM xxx' with an asterisk, clause GROUP BY cannot be used
ru: Не задан список выражений. Для оператора 'SELECT * FROM xxx' не может использоваться выражение GROUP BY

# DBxSelectInfo_Err_InitGroupByAlreadyCalled
source: GroupBy list is already filled. Repeated method call is not allowed.
ru: Список GroupBy уже заполнен. Повторный вызов метода не допускается

# DBxSelectInfo_Err_NoExpressions
source: Expression list is empty
ru: Список выражений Expressions не заполнен

# DBxStructChecker_Err_ComplexPK
source: Table '{0}' has a multi-column primary key. Primary key on the single column of type {1} required.
ru: Таблица '{0}' имеет составной первичный ключ. Требуется первичный ключ по единственному полю типа {1}.

# DBxStructChecker_Err_InvNumRange
source: For the numeric column '{0}' defined invalid value range: '{1} : {2}'
ru: Для числового столбца '{0}' задан неправильный диапазон значений: '{1} : {2}'

# DBxStructChecker_Err_NoPK
source: Table '{0}' has no primary key. Primary key on column of type {1} required.
ru: Таблица '{0}' не имеет первичного ключа. Требуется первичный ключ по полю типа {1}.

# DBxStructChecker_Err_PKWrongType
source: Table '{0}' has the primary key on column '{1}' of type {2}. Type {3} required
ru: Таблица '{0}' имеет первичный ключа по полю '{1}', которое имеет тип {2}, отличный от {3}

# DBxStructChecker_Err_RefColumnTypeMismatch
source: In the table '{0}' reference column '{1}' of type {2} to table '{3}', but its primary key column '{4}' is of type {5}
ru: В таблице '{0}' ссылочное поле '{1}' типа {2} ссылается на таблицу '{3}', которая имеет первичный ключ по полю '{4}' типа {5}

# DBxStructChecker_Err_RefToTableComplexPK
source: In the table '{0}' reference column '{1}' to table '{2}', with multi-column primary key
ru: В таблице '{0}' ссылочное поле '{1}' ссылается на таблицу '{2}', которая имеет составной первичный ключ

# DBxStructChecker_Err_RefToTableNoPK
source: In the table '{0}' reference column '{1}' to table '{2}' without primary key
ru: В таблице '{0}' ссылочное поле '{1}' ссылается на таблицу '{2}', которая не имеет первичного ключа

# DBxStructChecker_Err_RefToUnknownTable
source: In the table '{0}' reference column '{1}' to unknown table '{2}'
ru: В таблице '{0}' ссылочное поле '{1}' ссылается на несуществующую таблицу '{2}'

# DBxStructChecker_Err_StringColumnWithoutLen
source: For the string column '{0}' there is no length givem
ru: Для текстового столбца '{0}' не задана длина строки

# DBxStructChecker_Err_TableWithoutColumns
source: Table '{0}' has no columns
ru: Таблица '{0}' не содержит ни одного столбца

# DBxStructChecker_Err_UnknownColumnType
source: There is no type defined for the column '{0}'
ru: Для столбца '{0}' не задан тип данных

# DBx_Msg_ColumnLonger
source: Column '{0}' of table '{1}' should have length of {2} char(s) while real column length is greater: {3} char(s)
ru: Поле '{0}' таблицы '{1}' должно иметь длину {2} символа(ов), в то время, как реальное поле длиннее: {3} символа(ов)

# DBx_Err_ColumnTypeDiff
source: Column '{0}' of table '{1}' has a wrong type. Declaration of type {2} requires column type {3}, while real type is {4}
ru: Несоответствие типа поля '{0}' таблицы '{1}'. Объявление поля типа {2} предполагает тип {3}, в то время как реальный тип поля: {4}

# DBx_Msg_DelAllIndexesByColumnLength
source: All indexes for table '{0}' will be removed because the column '{1}' length changed
ru: Все существующие индексы таблицы '{0}' будут удалены из-за изменения размера поля '{1}'

# DBx_Err_GetConnectionString
source: Error when getting connection string. {0}
ru: Ошибка получения строки подключения. {0}

# DBx_Err_NoMainEntry
source: Main connection entry has not been initialized yet
ru: Основная точка подключения еще не была инициализирована

# DBx_Msg_ColumnCreated
source: Column '{0}' created in table '{1}'
ru: Создано поле '{0}' в таблице '{1}'

# DBx_Msg_ColumnLengthChanged
source: Length of column '{0}' of table '{1}' has been changed from {2} to {3} chars
ru: Длина поля '{0}' в таблице '{1}' изменена с {2} до {3} символов

# DBx_Msg_TableCreated
source: Table '{0}' created
ru: Создана таблица '{0}'

# DBx_Phase_ColumnCreation
source: Creating column '{0}' in table '{1}'
ru: Добавление поля '{0}' в таблицу '{1}'

# DBx_Phase_ColumnSetLength
source: Column '{0}' of table '{1}' length changing
ru: Изменение длины поля '{0}' в таблице '{1}'

# DBx_Phase_TableCreation
source: Creating table '{0}'
ru: Создается таблица '{0}'

# SqlDBx_Arg_FileExtension
source: Invalid value SqlConnectionStringBuilder.AttachDBFilename='{0}'. File must have the extension '.mdf', else work with database is unpossible
ru: Неправильное значение SqlConnectionStringBuilder.AttachDBFilename='{0}'. У файла должно быть расширение '.mdf', иначе работа с базой данных невозможна

# SqlDBx_Arg_NoDBName
source: Connection string does not have parameters InitialCatalog nor AttachDBFilename, that define database name
ru: В строке подключения не заданы параметры InitialCatalog или AttachDBFilename, определяющие базу данных

# UnknownUserPermission_Name_Default
source: Uknown permission '{0}'
ru: Неизвестное разрешение '{0}'

# UserPermission_Err_NotCreated
source: Permission for ClassCode='{0}' has not been created
ru: Не создано разрешение для ClassCode='{0}'

# DBx_Msg_DefaultReset
source: For column '{0}' of table '{1}' the DEFAULT value has been reset
ru: Для поля '{0}' в таблице '{1}' очищен признак DEFAULT

# DBx_Msg_DefaultSet
source: For column '{0}' of table '{1}' the DEFAULT value has been set '{2}'
ru: Для поля '{0}' в таблице '{1}' установлен признак DEFAULT '{2}'

# DBx_Msg_FKCreated
source: Foreign key '{0}' created for the table '{1}' with column(s) '{2}'
ru: Создан внешний ключ '{0}' в таблице '{1}' для поля '{2}'

# DBx_Msg_IndexCreated
source: Index '{0}' for table '{1}' with columns {2}
ru: Создан индекс '{0}' в таблице '{1}' с полями {2}

# DBx_Msg_IndexRemovedExcess
source: Excess index '{0}' removed from table '{1}'
ru: Удален лишний индекс '{0}' в таблице '{1}'

# DBx_Msg_IndexRemovedWrong
source: Index '{0}' removed from table '{1}' because it's mismatch the table structure
ru: Удален индекс '{0}' в таблице '{1}', т.к. он не соответствует объявленному в структуре данных

# DBx_Msg_NullChanged
source: For column '{0}' of table '{1}' the '{2}' attribute has been set
ru: Для поля '{0}' в таблице '{1}' установлен признак '{2}'

# DBx_Msg_NullToDefaultValue
source: For column '{0}' of table '{1}' the NULL values have been replaced to DEFAULT value
ru: Для поля '{0}' в таблице '{1}' значения NULL заменены на значение по умолчанию

# DBx_Msg_PKAdded
source: Primary key '{0}' for table '{1}' has been added
ru: Добавлено ограничение первичного ключа '{0}' в таблице '{2}'

# DBx_Msg_PKRemovedNoPK
source: Primary key '{0}' for table '{1}' has been removed because table does not use a primary key
ru: Удалено ограничение первичного ключа '{0}', так как таблица '{1}' не содержит первичного ключа

# DBx_Msg_PKRemovedWrong
source: Primary key '{0}' for table '{1}' has been removed bacause it was wrong
ru: Удалено неправильное ограничение первичного ключа '{0}' в таблице '{1}'

# DBx_Phase_FKCreation
source: Foreign key '{0}' creation
ru: Создание внешнего ключа '{0}'

# DBx_Phase_IndexCreation
source: Index creation for table '{0}' and columns {1}
ru: Создание индекса таблицы '{0}' для полей {1}

# DBx_Phase_IndexRemoving
source: Index '{0}' removing
ru: Удаление индекса '{0}'

# DBxCon_Err_SchemaColumnListIsEmpty
source: Column list is empty for table '{0}' when database schema loading
ru: Не найден список столбцов для таблицы '{0}' при загрузке схемы базы данныъ

# DBx_Msg_ColumnCommentChanged
source: Comment has been changed for column '{0}' in table '{1}'
ru: Для поля '{0}' в таблице '{1}' изменен комментарий

# DBx_Msg_TableCommentChanged
source: Comment has been changed for table '{0}'
ru: Для таблицы '{0}' изменен комментарий

# NpgsqlDBx_Arg_NoDatabase
source: Connection string does not have parameter 'Database'
ru: В строке подключения не задан параметр Database, определяющий базу данных

# NpgsqlDBx_Msg_ConstraintColumnNotFound
source: In the system table 'pg_constraint' there is a foreign key constraint for the table '{0}' and column with index {1}. For the pair table+column there is no record in column table. Current constraint will not be analyzed but an error is possible when the constraint will be added again.
ru: В системной таблице 'pg_constraint' задано ограничение внешнего ключа для таблицы '{0}' и столбца с индексом {1}. Для этой пары таблица+поле не найдено записи в таблице столбцов. Существующее ограничение не рассматривается, но возможна ошибка повторного добавления ограничения.

# NpgsqlDBx_Msg_ConstraintWrongConkey
source: In the system table 'pg_constraint' there is a foreign key constraint with wrong field 'conkey'
ru: В системной таблице 'pg_constraint' задано ограничение внешнего ключа с неправильным полем 'conkey'

# NpgsqlDBx_Msg_IndexColumnNotFound
source: For the index '{0}' there is column with a number {1}, which is not found in table '{2}'
ru: Для индекса '{0}' задан столбец с номером {1}, которого нет в таблице '{2}'

# Npgsql_Msg_UnreadableMessage
source: If localized error message is not readable (some characters instead of letters), configure Postgresql server to use english language for message output. In the file postgresql.conf set a line <lc_messages = 'en_EN.UTF-8'>
ru: Если сообщение об ошибке не читается (сердечки вместо букв), настройте сервер на выдачу сообщений на английском языке в файле postgresql.conf. Задайте строку <lc_messages = 'en_EN.UTF-8'>

# OleDbDBx_Arg_FileExtension
source: Connection string has invalid value 'DataSource': '{0}'. FIle must have extension '.mdb'
ru: Путь к базе данных '{0}' должен иметь расширение '.mdb'

# OleDbDBx_Arg_InvalidDataSource
source: Connection string has invalid value 'DataSource': '{0}'. Parameter must contain a path to the database file.
ru: Задан неправильный элемент DataSource '{0}' строки подключения. Элемент должен указывать на путь к файлу базы данных

# OleDbDBx_Arg_NoDataSource
source: Connection string does not have parameter 'DataSource'
ru: В строке подключения не указан параметр 'DataSource'

# OracleDBx_Err_OwnerPrefix
source: OWNER prefix. {0}
ru: Префикс OWNER. {0}

# SQLiteDBx_Arg_NoDataSource
source: Connection string does not have parameter 'DataSource'
ru: В строке подключения не задан параметр 'DataSource'

# SQLiteDBx_Arg_YearOutOfRange
source: Columns of type date' and 'datetime' cannot accept year less than {0}. SQLite then cannot read such a value
ru: В полях типа 'дата' и 'дата-время' нельзя задавать год меньше {0}. База данных SQLite не может потом прочитать такие значения

# SQLiteDBx_Err_SplitColumnType
source: Error occurred when type description '{0}' parsed. {1}
ru: Ошибка разбора описания типа '{0}'. {1}

# SQLiteDBx_Msg_TableRecreatedByColumnFormat
source: Table '{0}' has been recreated since column format changed
ru: Таблица '{0}' пересоздана из-за изменения формата столбцов

# SQLiteDBx_Phase_TableStructChanging
source: Table '{0}' struct changing
ru: Изменение структуры таблицы '{0}'
