Repository: a94827/FreeLibSet
Catalog: ExtTools/Res.*.resx
Languages: ru

# Cache_ErrTitle_ClearByTimer
source: Clear cache by timer error
ru: Ошибка очистки кэша по таймеру

# Cache_SwitchDescr_TraceSwitch
source: Trace the creation and removing cache items and saving / loading disk operations
ru: Трассировка создания / удаления элементов кэша и сброса/загрузки с диска

# CfgPart_Err_NameAnotherChar
source: Invalid char '{0}' at position {1}. Letters, digits, and chars '-', '_' , '.' are only allowed
ru: Недопустимый символ '{0}' в позиции {1}. Допускаются только буквы, цифры и символы '-', '_' и '.'

# CfgPart_Err_NameFirstChar
source: Name must start with a letter or the underscore char
ru: Имя должно начинаться с буквы или знака подчеркивания

# CfgPart_Err_NameIsEmpty
source: Name is empty
ru: Имя не задано

# Common_Arg_CollectionSameAsThis
source: Cannot add items to collection from itself
ru: Нельзя добавлять элементы в коллекцию из этой же коллекции

# Common_Arg_DataColumnInvalidType
source: Column '{1}' of table '{0}' has a wrong type {2}
ru: Столбец '{1}' таблицы '{0}' имеет недопустимый тип {2}

# Common_Arg_DataTableHasNoColumn
source: Table '{0}' does not have a column with name '{1}'
ru: Таблица '{0}' не содержит столбца с именем '{1}'

# Common_Arg_DataTableMustHaveSingleColumnPrimaryKey
source: Table '{0}' must have single primary key column, not{1}. Current columns are: {2}
ru: Таблица '{0}' должна иметь одно ключевое поле, а не {1}: {2}

# Common_Arg_DataTablesNotSameDataSet
source: Tables must belong to same DataSet
ru: Таблицы должны относится к одному DataSet'у

# Common_Arg_DataTableWithoutPrimaryKey
source: Table '{0}' doesn't have the primary key
ru: Таблица '{0}' не содержит первичного ключа

# Common_Arg_InvalidEnumerableType
source: Invalid object type {0} in enumeration
ru: Недопустимый тип объекта {0} в перечислении

# Common_Arg_IsEmpty
source: Value is empty
ru: Значение не задано

# Common_Arg_ObjectWithoutCode
source: Object {0} has no value of the property IObjectWithCode.Code
ru: У объекта {0} не задано значение свойства IObjectWithCode.Code

# Common_Arg_OutOfRange
source: Value is out of range
ru: Значение вне диапазона

# Common_Arg_OutOfRangeMax
source: Value can't be greater than {0}
ru: Значение должно быть не больше {0}

# Common_Arg_OutOfRangeMin
source: Value can't be less than {0}
ru: Значение должно быть не меньше {0}

# Common_Arg_OutOfRangeMinMax
source: Value must be in range from {0} to {1}
ru: Значение должно быть в диапазоне от {0} до {1}

# Common_Arg_RangeInverted
source: First range value '{0}'={1} is greater thal last value '{2}'={3}
ru: Начальное значение диапазона '{0}'={1} больше, чем конечное '{2}'={3}

# Common_Arg_UnknownValue
source: Unknown value {0}
ru: Неизвестное значение {0}

# Common_Arg_WrongCollectionCount
source: Wrong item count: {0}. Expected: {1}
ru: Неправильное количество элементов: {0}. Ожидалось: {1}

# Common_Err_Bug
source: Application internal error. Ask the developer
ru: Внутренняя ошибка в программе. Обратитесь к разработчику

# Common_Err_BugWithMessage
source: Application internal error. {0}. Ask the developer
ru: Внутренняя ошибка в программе. {0}. Обратитесь к разработчику

# Common_Err_Busy
source: Application is busy
ru: Приложение занято

# Common_Err_DataRowNotFound
source: For the table '{0}' there is no row with the primary key ({1})={2}
ru: Для таблицы '{0}' не удалось получить строку со значением первичного ключа ({1})={2}

# Common_Err_DifferentThread
source: Call from a different thread {0}
ru: Вызов из чужого потока {0}

# Common_Err_DifferentThreadWithWanted
source: Call from a different thread {0}. Wanted thread is {1}
ru: Вызов из чужого потока {0}. Ожидался вызов из потока {1}

# Common_Err_DirNotFound
source: Directory not found: '{0}'
ru: Каталог '{0}' не найден

# Common_Err_EmptyErrorMessageList
source: No errors
ru: Нет ошибок

# Common_Err_FileNotFound
source: File not found: '{0}'
ru: Файл '{0}' не найден

# Common_Err_Inconvertible
source: Value '{0}' of type {1} cannot be converted to the type {2}
ru: Значение '{0}' типа {1} нельзя преобразовать в тип {2}

# Common_Err_KeyAlreadyExists
source: Collection already contains an item with the key '{0}'
ru: Коллекция уже содержит элемент с ключом '{0}'

# Common_Err_KeyNotFound
source: Collection does not contain an item with the key '{0}'
ru: Коллекция не содержит элемента с ключом '{0}'

# Common_Err_ObjectReadOnly
source: Object can't be modified (IsReadOnly=true)
ru: Объект заблокирован от внесения изменений (IsReadOnly=true)

# Common_Err_Reentrance
source: Reentrant method call
ru: Вложенный вызов процедуры

# Common_Err_StructureNotInit
source: Structure {0} was not init
ru: Структура {0} не была заполнена

# Common_Err_Test
source: Test exception
ru: Тестовое исключение

# Common_Err_TypeNotCloneable
source: Type {0} doen't support object cloning with ICloneable interface
ru: Тип {0} не поддерживает клонирование объектов с помощью интерфейса ICloneable

# Common_Err_UnpairedCallOfEndMethod
source: Unpaired call the method {0} without previously called {1}
ru: Непарный вызов метода {0} без предшествующего вызова метода {1}

# Common_Err_UserCancel
source: Execution cancelled by user
ru: Выполнение прервано пользователем

# DataTable_Err_DataTableRefColumnArrayLengthMismatch
source: Master table '{0}' has the primary key column(s) '{1}' ({2}). Reference columnlist '{3}' ({4}) has a different length.
ru: В мастер-таблице '{0}' объявлены ключевые поля '{1}' ({2}). Нельзя использовать для связи поля '{3}' ({4}). Количество полей должно быть одинаковым

# DataTools_Arg_KeyValuesLengthDiffWithPrimaryKey
source: Key values array length ({0}) is not the same as primary key column count ({1}) in table '{2}'
ru: Число значений в массиве ({0}) не совпадает с числом ключевых полей ({1}) в таблице '{2}'

# DataTools_Err_DataTableHasNoKeyColumn
source: Table '{0}' doesn't have a column '{1}' supposed to be a key
ru: Таблица '{0}' не содержит столбца с именем '{1}', которое предполагалось сделать ключевым

# DataTools_Err_DataTableHasNoRefColumn
source: DataTable '{0}' doesn't have a column '{1}', supposed to link with master table
ru: Таблица '{0}' не имеет столбца '{1}', которое предполагалось использовать для связывания

# DataTools_Err_IncompatibleTypes
source: Incompatible data types
ru: Несовместимые типы данных

# DateRangeFormatter_Msg_RangeMax
source: till {1}
ru: по {0}

# DateRangeFormatter_Msg_RangeMin
source: since {0}
ru: с {0}

# DateRangeFormatter_Msg_RangeMinMax
source: from {0} till {1}
ru: с {0} по {1}

# DateRangeList_Arg_AppendCrossed
source: Range to add {0} is crossed with the last added range in the list {1}
ru: Добавляемый интервал {0} пересекается с последним добавленным {1}

# DateRange_Err_RangesNotCrossed
source: Date ranges are not crossed
ru: Интервалы {0} и {1} не пересекаются

# EnumDirectoryEventArgs_Err_IsReadOnly
source: Value can be changed in the BeforeDirectory event handler only
ru: Менять значения свойства можно только в обработчике события BeforeDirectory

# FileCompression_Phase_WithCancellingOnNextFile
source: {0}. Process will be cancelled on the next file
ru: {0}. Прерывание будет выполнено при обработке следующего файла

# FileCompressor_Action_Compress
source: Compressing
ru: Сжатие

# FileCompressor_Action_Decompress
source: Decompressing
ru: Распаковка

# FileCompressor_Action_Test
source: Archive testing
ru: Проверка архива

# FileCompressor_Err_7z_Fatal
source: Fatal error
ru: Фатальная ошибка

# FileCompressor_Err_7z_InsufficientMemory
source: Insuffitient memory
ru: Недостаточно памяти

# FileCompressor_Err_7z_InvalidCommandLine
source: Invalid command line
ru: Неправильная командная строка

# FileCompressor_Err_7z_Success
source: Success
ru: Успех

# FileCompressor_Err_7z_UserCancel
source: Execution was cancelled by user
ru: Выполнение прервано пользователем

# FileCompressor_Err_7z_Warning
source: Warning
ru: Предупреждение

# FileCompressor_Err_ArchiveAndVolume1NotFound
source: Archive file not found '{0}' neither the first part of multi-volume archive
ru: Не найден файл архива '{0}' или первый файл многотомного архива

# FileCompressor_Err_ArchiveFileNameIsEmpty
source: Archive file name missing
ru: Не задано имя файла архива

# FileCompressor_Err_ArchiveNotFound
source: Archive '{0}' not found
ru: Архив '{0}' не найден

# FileCompressor_Err_ArchiverNotFound
source: Archiver program '{0}' not found
ru: Не найден архиватор '{0}'

# FileCompressor_Err_CmdResult
source: Command {0} execution failed. Action {1}. Error code {2} ({3})
ru: Выполнение команды {0} завершилось неудачно. Действие: {1}. Код ошибки: {2} ({3})

# FileCompressor_Err_DstDirNameIsEmpty
source: Destination directory name missing
ru: Не задано имя каталога для распаковки

# FileCompressor_Err_PasswordWithQuoteChar
source: Password can't contain a double-quote (") char
ru: Пароль не может содержать символ кавычки

# FileCompressor_Err_SrcDirNameIsEmpty
source: Source directory name missing
ru: Не задано имя каталога сжимаемых файлов

# FileCompressor_Err_SrcDirNotFound
source: Source directory '{0}' not found
ru: Каталог сжимаемых файлов '{0}' не найден

# FileCompressor_Err_UnknownFileExtension
source: Can't define archive type with given file name
ru: Не удалось определить тип архива по имени файла

# FileCompressor_Phase_Cancelling
source: Archiving job will be cancelled
ru: Работа с архивом сейчас будет прервана

# FileCompressor_Phase_FileList
source: Creating file list
ru: Построение списка файлов

# FileContainer_Arg_FileInfoIsEmpty
source: File info must be supplied
ru: Информация о файле должна быть заполнена

# FileContainer_Arg_LengthMismatch
source: Content length={0} is not the same as in FileInfo.Length={1} for the file "{2}"
ru: Длина массива Length={0} не совпадает с заданной в FileInfo.Length={1} для файла "{2}"

# FileContainer_Arg_SubDirIsAbsolute
source: Directory can't be an absolute path
ru: Каталог не может содержать абсолютный путь

# FileContainer_Arg_SubDirStartsWithDirChar
source: Directory can't start with a directory separator char
ru: Каталог не может начинаться с символа каталога

# FileContainer_Arg_SubDirWithParent
source: Directory can't have a reference to the parent dir
ru: Каталог не может содержать символы '..'

# FileTemplateDir_Err_BaseDirNotFound
source: Base directory '{0}' not found
ru: Базовый каталог '{0}' не существует

# FileTools_Arg_FileNameWithWildcardsOrDirSep
source: File name can't contain wildcards chars '*' or '?' and directory separator char
ru: Имя файла не может содержать шаблонные символы '*' и '?' и символ разделителя каталога

# FileTools_Arg_TemplateWithDirSep
source: Template can't contain directory separaror char
ru: Шаблон не может содержать символ разделителя каталога

# FileTools_Msg_DirInsteadOfFile
source: '{0}' is a directory, not a file
ru: '{0}' является каталогом, а не файлом

# FileTools_Msg_DirNameMustEndWithDirSep
source: Directory name must end with '{0}'
ru: Имя каталога должно заканчиваться символом '{0}'

# FileTools_Msg_DirNotFound
source: Directory '{0}' not found
ru: Не найден каталог '{0}'

# FileTools_Msg_FileInsteadOfDir
source: '{0}' is a file, not a directory
ru: '{0}' является файлом, а не каталогом

# FileTools_Msg_FileNotFound
source: File not found: '{0}'
ru: Файл не найден: '{0}'

# FileTools_Msg_FilePathEndsWithDirSep
source: File name can't end with '{0}'
ru: Имя файла не должно заканчиваться символом '{0}'

# FileTools_Msg_InvalidChar
source: Invalid char '{0}' at position {1}
ru: Недопустимый символ '{0}' в позиции {1}

# FileTools_Msg_InvalidCharAltDirSep
source: Invalid char '{0}' at position {1}. Use '{2}' as a directory separator
ru: Недопустимый символ '{0}' в позиции {1}. Для разделения каталогов должен использоваться символ '{2}'

# FileTools_Msg_InvalidCharWildcards
source: Invalid char '{0}' at position {1}. Wildcards are not allowed
ru: Недопустимый символ '{0}' в позиции {1}. Шаблонные символы не допускаются

# FileTools_Msg_LinuxPathTwoDirSeps
source: Two directory separator chars '//'
ru: Не может быть два символа '//' подряд

# FileTools_Msg_PathDirSepAndSpace
source: Invalid char combination at position {0}. Space char is not allowed after the directory separator
ru: Недопустимое сочетание символов в позиции {0}. После разделителя каталога не может идти пробел

# FileTools_Msg_PathEndsWithSpace
source: Path can't end with space char
ru: Путь не должен заканчиваться пробелом

# FileTools_Msg_PathIsEmpty
source: Path is empty
ru: Путь не задан

# FileTools_Msg_PathSpaceAndDirSep
source: Invalid char combination at position {0}. Space char is not allowed before the directory separator
ru: Недопустимое сочетание символов в позиции {0}. Перед разделителем каталога не может идти пробел

# FileTools_Msg_PathStartsWithSpace
source: Path can't start with space char
ru: Путь не должен начинаться с пробела

# FileTools_Msg_RootDirNotFound
source: Root directory '{0}' not found
ru: Не найден корневой каталог '{0}'

# FileTools_Msg_WindowsFilePathEndsWithColon
source: File name can't end with':'
ru: Имя файла не должно заканчиваться символом ':'

# FileTools_Msg_WindowsNetFilePathFewSeparators
source: If path starts with '\\', there must be at least two more separators: '\\Server\Shared\File'
ru: Если имя начинается с '\\', то должно быть еще как минимум два разделителя: '\\Сервер\Ресурс\ИмяФайла'

# FileTools_Msg_WindowsPathDiskLetterRequired
source: There must be a disk letter 'A'-'Z' at the first position before the colon char
ru: Перед символом ':' должна идти буква диска

# FileTools_Msg_WindowsPathInvalidColonPosition
source: Colon char ':' must be the second char in the path
ru: Символ ':' может быть только вторым в строке

# FileTools_Msg_WindowsPathTwoBackslashInTheMiddle
source: Two directory separators '\\' in the middle. They allowed at the start only for the UNC names like '\\Server\Share...'
ru: Два символа '\\' подряд. Признак сетевого имени может быть только в начале имени

# FileTools_Phase_FileList
source: Creating file list
ru: Построение списка файлов

# FileTools_Phase_FileSize
source: Calculating file sizes
ru: Вычисление размера файлов

# IniCfgPart_Arg_InvalidSepInSectionName
source: Invalid config section name {0}. It can't start nor end with a separator char '\', neither contain two separators '\\' together
ru: Недопустимое имя секции конфигурации {0}, Имя не может начинаться или заканчиваться символом-разделителем '\', или содержать два разделителя '\\' подряд

# IniFile_Arg_KeyName
source: Invalid key name '{0}'. {1}.
ru: Неправильное имя ключа '{0}'. {1}.

# IniFile_Arg_SectionName
source: Invalid section name '{0}'. {1}.
ru: Неправильное имя секции '{0}'. {1}.

# IniFile_Err_KeyNameInvalidChar
source: Invalid char '{0}' at position {1}
ru: Недопустимый символ '{0}' в позиции {1}

# IniFile_Err_KeyNameIsEmpty
source: Key name cannot be empty
ru: Имя ключа должно быть задано

# IniFile_Err_KeyNameStartsOrEndsWithSpace
source: Key name cannot start or end with the space char
ru: Имя ключа не должно начинаться или заканчиваться пробелом

# IniFile_Err_SectionNameInvalidChar
source: Invalid char '{0}' at position {1}
ru: Недопустимый символ '{0}' в позиции {1}

# IniFile_Err_SectionNameIsEmpty
source: Section name cannot be empty
ru: Имя секции конфигурации должно быть задано

# IniFile_Err_SectionNameStartsOrEndsWithSpace
source: Section name cannot start or end with the space char
ru: Имя секции конфигурации не должно начинаться или заканчиваться пробелом

# MonthDay_Arg_DayOfYearOutOfRange
source: Value must be zero or in range beetween 1 to 365
ru: Значение должно быть равно 0 или лежать в диапазоне от 1 до 365

# SettingsDataList_Arg_ItemTypeAlreadyExists
source: Settings data list already contains the data item of type {0}
ru: В списке уже есть данные типа {0}

# StoredFileInfo_Arg_FileNameWithPath
source: File name can't contain the path
ru: Имя файла не может содержать путь

# StoredFileInfo_Arg_NegativeFileLength
source: File length must be greater or equal than 0 bytes
ru: Длина файла не может быть отрицательной

# YearMonthDayAge_Arg_MixedSigns
source: Mixed positive and negative values are not allowed
ru: Не допускается смешение отрицательных и положительных компонентов

# YearMonthDayAge_Arg_Year9999
source: Year 9999 is acceptable only when months=0 and days==0
ru: Значение 9999 допускается, только если months=0 и days==0

# YearMonthRange_Err_NotCrossed
source: Ranges {0} and {1} are not crossed
ru: Интервалы {0} и {1} не пересекаются

# Common_Arg_AreSame
source: Arguments '{0}' and '{1}' are same
ru: Аргументы '{0}' и '{1}' не могут совпадать

# UITools_Err_InvalidChar
source: String '{0}' contains invalid char '{1}' at position {2}
ru: Строка '{0}' содержит недопустимый символ '{1}' в позиции {2}

# Common_Arg_DataTablePrimaryKeyWrongType
source: Table '{0}' has a primary key '{1}' fo the column of type {2}. Column of type {3} expected.
ru: Таблица '{0}' имеет первичный ключ '{1}' по полю типа {2}. Требуется ключ полю типа {3}.

# Common_Arg_IncompatibleTypes
source: Arguments '{0}' of type {1} and '{2}' of type {3} have incompatible types
ru: Аргументы '{0}' типа {1} и '{2}' типа {3} несовместимы

# Common_Arg_InvalidListItem
source: There is an invalid item '{0}' at the index {1} in the list
ru: В списке присутствует элемент с недопустимым значением '{0}' по индексу {1}

# Common_Arg_StringsWithDifferentLength
source: Strings {0} ({1}) and {2} ({3}) must have the same length
ru: Длина строк {0} ({1}) и {2} ({3}) должна быть одинаковой

# Common_Arg_UnknownType
source: Аргумент has an unknown type {0}
ru: Аргумент имеет неизвестный тип {0}

# DataTools_Arg_HexToBytesOddStringLength
source: String contains odd number of chars ({0})
ru: Строка содержит нечетное количество символов ({0})

# Common_Arg_DataRowNotInSameTable
source: Row belongs another table
ru: Строка относится к другой таблице данных

# EnumerableWrapper_Err_SecondHand
source: Second call of the GetEnumerator() is not allowed
ru: Повторный вызов перечислителя не допускается

# ErrorMessageItem_Msg_ToStringWithCode
source: {0} (code {2}). {1}
ru: {0} (код {2}). {1}

# ErrorMessageKind_Msg_Error
source: Error
ru: Ошибка

# ErrorMessageKind_Msg_Info
source: Information
ru: Сообщение

# ErrorMessageKind_Msg_Warning
source: Warning
ru: Предупреждение

# Common_Err_CannotAddItemAgain
source: Cannot add the item '{0}' again
ru: Повторное добавление элемента '{0}' не допускается

# Common_Err_ObjectProperty
source: Property {0} of object {1} has invalid value {2}
ru: Свойство {0} объекта {1} имеет недопустимое значение {2}

# CoreDBxSqlFormatter_Arg_CompareKingMustBeEQorNE
source: Filter uses comparison to NULL with mode {0}. Equal and NotEqual modes only are acceptable.
ru: В фильтре задано сравнение значения с NULL в режиме {0}. Допускается только сравнение на равенство и неравенство

# CoreDBxSqlFormatter_Err_CoalesceForUnknownColumnType
source: Column '{0}' requires NULL handling. There is no column definition, nor column type given as argument
ru: Для столбца '{0}' требуется обработка значения NULL. Не найдено описание структуры столбца и не передан требуемый тип данных

# CoreDBxSqlFormatter_Err_NoTableAliasForColumn
source: There is no table alias for the reference column '{0}'
ru: Для ссылочного столбца '{0}' не найден альяс таблицы

# DataTableRepeater_Arg_MasterTableSetToSlaveTable
source: Reference to SlaveTable cannot be used as the MasterTable
ru: Нельзя присваивать ссылку на SlaveTable

# DataTableRepeater_Err_DiffPrimaryKey
source: SlaveTable has a primary key '{0}'. Connected MasterTable must have the same primary key, not the '{1}'
ru: Таблица SlaveTable имеет первичный ключ '{0}'. Подключаемая таблица MasterTable должна иметь такой же ключ, а не '{1}'

# DataTableRepeater_Err_MasterRowNotFound
source: Row in master table not found
ru: Не найдена строка master-таблицы

# DataTableRepeater_Err_SlaveTableStructNotDefined
source: SlaveTable structure must be deined
ru: Структура таблицы SlaveTable должна быть заполнена

# DataViewSortBuilder_Arg_NameStartsOrEndsWithDot
source: Name cannot start nor end with the dot char
ru: Имя не может начинаться или заканчиваться точкой

# DataViewSortBuilder_Arg_NameWithTwoDots
source: Name cannot have two dot chars together
ru: Имя не может содержать 2 точки подряд

# DataViewSortBuilder_Err_AddCallRequired
source: There must be call of Add() or AddSubName() just before this call
ru: Перед этим вызовом непосредственно должен быть вызов метода Add() или AddSubName()

# DateRangeCrossCommonFilter_Msg_DefaultDisplayName
source: Period
ru: Период

# DateRangeInclusionCommonFilter_Msg_DefaultDisplayName
source: Period
ru: Период

# DBxColumns_Err_BadColumnName
source: Invalid column name '{0}' at position with index {1}. {2}
ru: Неправильное имя поля '{0}' в позиции с индексом {1}. {2}

# DBxColumns_Err_SourceColumnNotFound
source: Template table does not contain a column '{0}'
ru: Таблица-шаблон не содержит столбца '{0}'

# DBxCommonFilters_Err_NoSqlFilter
source: For the filter '{0}' the property UseSqlFilter=false
ru: Для фильтра '{0}' свойство UseSqlFilter=false

# DBxCommonFilters_Err_UseSqlFilterMismatch
source: For the filter '{0}' the property DBxCommonFilter.UseSqlFilter=false while DBxCommnonFilters.SqlFilterRequired=true"
ru: Для фильтра '{0}' свойство DBxCommonFilter.UseSqlFilter=false, в то время как свойство DBxCommnonFilters.SqlFilterRequired=true"

# DBxCommonFilter_Err_CodeMustBeSet
source: Code property must be set before the Owner
ru: Свойство Code должно быть установлено до свойства Owner

# DBxCommonFilter_Err_OwnerAlreadyExists
source: Owner property has already been set
ru: Повторная установка свойства Owner не допускается

# DBxCommonFilter_Err_OwnerHasBeenSet
source: Action allowed only before the filler object is added to a collection
ru: Выполнение действия допускается только до присоединения фильтра к коллекции

# DBxCommonFilter_Err_SetAsCurrRow
source: Filter '{0}' does not support set with current row
ru: Фильтр '{0}' не поддерживает установку значения по текущей строке

# DBxCommonFilter_Msg_DefaultDisplayName
source: [Without name and code]
ru: [Без имени и кода]

# RangeCrossCommonFilterBase_Msg_DefaultDisplayName
source: Range
ru: Диапазон

# RangeInclusionCommonFilterBase_Msg_DefaultDisplayName
source: Range
ru: Диапазон

# Splash_Err_ExtraCompleteOrSkip
source: Extra call for Complete()/Skip()
ru: Лишний вызов Complete()/Skip()

# Splash_Phase_Complete
source: Ready
ru: Готово

# Splash_Phase_Default
source: Wait...
ru: Ждите...

# AndOrFilter_Arg_TwoItemsRequired
source: Array length cannot be less than 2. Use static method FromArray()
ru: Длина массива не может быть меньше 2. Используйте статический метод FromArray()

# Common_Arg_StringIsNullOrEmpty
source: String argument is null or an empty string
ru: Аргумент задан как пустая строка или null

# Common_Err_ObjectReadOnlyWithStringAndType
source: Object '{0}' of type {1} can't be modified (IsReadOnly=true)
ru: Объект '{0}' типа {1} заблокирован от внесения изменений (IsReadOnly=true)

# Common_Err_ObjectReadOnlyWithType
source: Object of type {0} can't be modified (IsReadOnly=true)
ru: Объект типа {0} заблокирован от внесения изменений (IsReadOnly=true)

# CompareFilter_Arg_InvalidCompareKindWithNull
source: Cannot use comparison kind={0} because one of expression is a NULL const. Acceptable kinds are Equal and NotEqual
ru: Так как одно из выражений является константой NULL, нельзя задавать режим сравнения Kind={0}. Допускается только сравнение на равенство или неравенство

# CompareFilter_Arg_NullAsDefaultValueWithNull
source: Mode NullAsDefaultValue cannot be used because one of expression is a NULL const
ru: Так как одно из выражений является константой NULL, нельзя задавать режим NullAsDefaultValue
