Repository: a94827/FreeLibSet
Catalog: ExtTools/Res.*.resx
Languages: ru

# DbfStr_Arg_InvalidFieldLengthD
source: For the field type 'D' the length must be set to 8
ru: Для типа 'D' длина должна быть равна 8

# DbfStr_Arg_InvalidFieldLengthL
source: For the field type 'L' the length must be set to 1
ru: Для типа 'L' длина должна быть равна 1

# DbfStr_Arg_InvalidFieldLengthM
source: For the field type 'M' the length must be set to 10
ru: Для типа 'M' длина должна быть равна 10

# DbfStr_Arg_InvalidFieldLengthN
source: For the field type 'N' the length must be less or equal 255
ru: Для типа 'N' длина должна быть не больше 255

# DbfStr_Arg_InvalidFieldName
source: Invalid field name '{0}'. The name length must be from 1 ti 10 chars. It must contains uppercased latin letters,. digits and underscore char. Name cannot start with a digit.
ru: Неправильное имя поля '{0}'. Имя должно иметь длину от 1 до 10 символов, содержать заглавные латинские буквы, цифры и знак подчеркивания. Имя не может начинаться с цифры

# DbfStr_Arg_InvalidFieldType
source: Invalid field type: '{0}'. Allowed chars are: 'C', 'N', 'D', 'L', 'M', 'F'
ru: Неправильный тип поля: '{0}'. Допускаются символы 'C', 'N', 'D', 'L', 'M', 'F'

# DbfStr_Arg_PrecisionForLength
source: Precsion cannot have the value {0} when the length is {1}
ru: Точность не может иметь значение {0} если длина поля равна {1}

# DbfStr_Arg_PrecisionForType
source: Precision can't be set for the field type '{0}'
ru: Точность не задается для типа данных '{0}'

# DbfStr_Arg_UnknownFieldName
source: DBF file doesn't contain a column '{0}'
ru: DBF-файл не содержит поля '{0}'

# DbfStr_Msg_DBase2InvalidFieldLengthC
source: dBase II does not support field length greater than 255 chararcters. For the field '{0}' it is given as {1}
ru: dBase II не поддерживает поля длиннее 255 символов. Для поля '{0}'задана длина {1}

# DbfStr_Msg_DBase2TooManyFields
source: dBase II supports only 32 fields in the DBF-file
ru: dBase II поддерживает максимально 32 поля в таблице

# DbfStr_Msg_InvalidFieldTypeForDbFormat
source: Unsupported type '{0}' for the field '{1}'. For the database format {2} only those field types allowed: {3}
ru: Неподдерживаемый тип '{0}' поля '{1}'. Поддерживаемые типы для формата базы данных {2}: {3}

# DBxAggregateFunction_Arg_NoArg
source: An argument, usually column name, must be given for any aggregate function except COUNT(*)
ru: Аргумент (обычно, имя поля) должен быть задан для всех агрегатных функций, кроме COUNT(*)

# DBxAggregateFunction_Err_GetValueNotSupported
source: An aggregate function cannot be calculated on a data row
ru: Для агрегатных функций вычисление на основании строки данных невозможно

# DBxConst_Arg_UseDBxColumnType
source: Use constructor with two args taken DBxColumnType
ru: Используйте конструктор, принимающий 2 аргумента, и задавайте DBxColumnType

# DBxDataRowExtValues_Arg_TableDiff
source: Column list in new table '{0}' must be same as in the current table '{1}'
ru: Список полей в новой таблице '{0}' должен совпадать с существующей таблицей '{1}'

# DBxExtValue_Err_BinDataNotSupported
source: Binary data and files can't be stored in data collection {0}
ru: Хранение двоичных данных и файлов не предусмотрено набором данных {0}

# DBxFilter_Arg_IsDBxConst
source: Argument cannot be DBxConst
ru: Константа не может быть аргументом

# DBxFunction_Arg_WrongArgCount
source: Wrong number of arguments: {0}. Function '{1}' requires argument count from {2} to {3}
ru: Неправильное количество аргументов: {0}. Для функции '{1}' требуются аргументы в количестве от {2} до {3}

# DBxStruct_Arg_ColumnNotFound
source: Structure for the table '{0}' does not contain a definition for the column '{1}'
ru: Для таблицы '{0}' не определен столбец '{1}'

# DBxStruct_Err_GetTableStructTableMissed
source: GetTableStruct() returned null even though the table '{0}' exists in the AllTableNames list
ru: Метод GetTableStruct() вернул null, хотя таблица '{0}' есть в списке всех таблиц AllTableNames

# DBxStruct_Err_TableNotFound
source: There is not structure definition for the table '{0}'
ru: Нет описания структуры таблицы '{0}'

# DBxTableStruct_Arg_RefTypeClearForNotNull
source: Reference type cannot be DBxRefType.Clear if nullable=false
ru: Тип ссылки не может быть DBxRefType.Clear, если nullable=false

# DBxTableStruct_Err_PrimaryKeyColumnMustBeFirst
source: Key column '{0}' must be the first in the column list
ru: Ключевое поле '{0}' должно быть первым в списке столбцов

# DBxTools_Arg_ValueToColumnTypeRequired
source: Cannot define column type from the argument of type {0}
ru: Не удалось определить тип столбца из аргумента типа {0}

# ValuesFilter_Arg_DiffTypeValues
source: Array must contain values of single type. The first item is {0}, but there is an item of type {1}
ru: Массив должен содержать однотипные значения. Первый элемент массива имеет тип {0}, но есть значение типа {1}

# DbfFieldTypeException_Err_Message
source: Field '{0}' has an improper type '{1}'
ru: Поле '{0}' имеет неподходящий тип '{1}'

# DbfValueFormatException_Err_Message
source: Record {0}, field '{1}' contains an invalid value for converting to type '{2}'
ru: Строка {0}, поле '{1}' содержит недопустимое значение для типа '{2}'

# DbfFile_Err_DataStartPositionOverTheHeader
source: Invalid data start poistion ({0}) in DBF-file. Field description overlaps the data area
ru: Неправильная позиция начала данных ({0}) в файле DBF. Описания полей перекрывают область данных

# DbfFile_Err_DBase4MemoNotImplement
source: MEMO-file format for dBase IV is not implemented
ru: Формат MEMO-файла dBase IV не реализован

# DBfMemoFile_Err_FileIsTooShort
source: МЕМО-file is too short
ru: МЕМО-файл имеет недопустимо малую длину

# DbfMemoFile_Err_FileSizeLessThanHeader
source: МЕМО-file real size ({0}) is less than minimal size based on the header ({1})
ru: Реальный размер МЕМО-файла ({0}) меньше, чем вычисленный минимально возможный размер, исходя из заголовка ({1})

# DbfFile_Err_HeaderRecSizeMismatch
source: Record size in DBF file header is not the total field sizes ({1})
ru: Размер записи, заданный в заголовке DBF-файла ({0}) не совпадает с суммарным размером всех полей ({1})

# DbfFile_Err_RecSizeIsZero
source: Record size in DBF-file header cannot be 0 bytes
ru: Размер записи в заголовке DBF-файла не может быть равен 0

# DbfFile_Err_UnknownSignature
source: Not a DBF-file Unknown signature '{0}'
ru: Не DBF-файл. Неизвестная сигнатура '{0}'

# DbfMemoFile_Err_WrongBlockCount
source: In МЕМО-file header points a wrong number of 512-byte blocks: {0}
ru: В заголовке МЕМО-файла указано недопустимое число 512-байтных блоков: {0}

# DbfFile_Err_ZeroLength
source: DBF-file '{0}' has the zero length
ru: DBF-файл '{0}' имеет нулевую длину

# DbfFile_Err_FileTooShort
source: DBF file length ({0}) does not match the record size and count from file header. Length must be at least {1}
ru: Длина DBF-файла ({0}) не соответствует размеру и числу записей, заданных в заголовке. Длина файла должна быть не меньше, чем {1}

# AlreadyExecutingException_Err_DefaultMessage
source: Nested procedure execution start
ru: Вложенный запуск процедуры на выполнение

# Common_Err_ObjectPropertyWithRequires
source: Property {0} of object {1} has invalid value {2}. Requires: {3}
ru: Свойство {0} объекта {1} имеет недопустимое значение {2}. Допустимые значения: {3}

# Common_Err_RepeatedCallOfMethod
source: Repeated call of method {0}
ru: Повторный вызов метода {0}

# DataTableTreeModel_Arg_DiffColumnTypes
source: Column '{0}' has a data type {1} but '{2}' has {3}
ru: Столбец '{0}' имеет тип данных {1}, а '{2}' - {3}

# DataTableTreeModel_Arg_IsNullDefaultValueType
source: Value must have type {0}, but was {1}
ru: Значение должно иметь тип {0}, a не {1}

# DataTableTreeModel_Arg_ParentNotNull
source: Column '{0}' has invalid property value: AllowDBNull=false
ru: Столбец '{0}' имеет свойство AllowDBNull=false

# DataTableTreeModel_Arg_TagAnotherTable
source: Data row belongs another table
ru: Строка относится к другой таблице

# DataTableTreeModel_Arg_TagType
source: Tag must be a DataRow
ru: Аргумент не является DataRow

# DataTableTreeModel_Err_Loop
source: The tree is looped for the identifier {0}
ru: Дерево зациклено для строки с идентификатором {0}

# DbfFileCopier_Err_FieldRuleExists
source: Copying rule for the destination column '{0}' already exists
ru: Для конечного поля '{0}' уже задано правило копирования

# DbfFile_Arg_RecNoOutOfRange
source: Cannot go to the record with RecNo={0}. The record count in the DBF-file is {1}
ru: Нельзя перейти к записи {0}", т.к. количество записей в таблице равно {1}

# DbfFile_Arg_StringIsTooLong
source: String has length {0} and cannot be written in field '{1}' with field size {2}
ru: Строка имеет длину {0} и не может быть записана в поле '{1}' длиной {2}

# DbfFile_Err_CellErrorMessage
source: Record no {0}, field '{1}'. Error occurred {2}
ru: Строка {0}, поле '{1}'. Произошла ошибка. {2}

# DbfFile_Err_CheckActiveRecord
source: There is no selected record. Set the RecNo property before.
ru: Нет выбранной записи

# DbfFile_Err_FieldListEmptyName
source: Invalid field list in the DBF-file header. For the field {0} there is a zero-length name
ru: В списке полей DBF-файоа для поля {0} не задано имя поля

# DbfFile_Err_FieldListNoEndOfName
source: Invalid field list in the DBF-file header. For the field {0} there is no end-of-name byte 0
ru: В списке полей DBF-файла для поля {0} не найден нулевой байт окончания имени поля

# DbfFile_Err_FieldListUnexpectedEOF
source: Unexpected end of DBF-file. Field list in header has not been finished yet
ru: Неожиданный конец DBF-файла. Список полей не закончен

# DbfFile_Err_MemoBlockCountLimitExceeded
source: Cannot add a MEMO-value. Block count limit ({0}) will be exceeded
ru: Нельзя добавить MEMO-значение, т.к. будет превышено максимально допустимое число блоков {0}

# DbfFile_Err_MemoBlockNumberOutOfFile
source: Record no {0}, МЕМО-field '{1}'. Block number {2} is out of the МЕМО-file
ru: Строка {0}, МЕМО-поле '{1}'. Задан недопустимый номер блока {2}, который выходит за пределы МЕМО-файла

# DbfFile_Err_MemoFileNotAttached
source: Access to memo field '{0}' failed bacause there is no memo-file attached
ru: Запрошен доступ к значению memo-поля '{0}', но memo-файл недоступен

# DbfFile_Err_MemoInvalidBlockNumber
source: Record no {0}, МЕМО-field '{1}'. Invalid block number: {2}
ru: Строка {0}, МЕМО-поле '{1}'. Задан недопустимый номер блока {2}

# DbfFile_Err_MemoNoEndOfBlock
source: Record no {0}, МЕМО-field '{1}'. For the block number {2} in the МЕМО-file there is no end-of-block mark within 64KB
ru: Строка {0}, МЕМО-поле '{1}'. В МЕМО-файле для блока {2} не найден маркер конца блока на протяжении 64Кб

# DbfFile_Err_MemoReadError
source: Record no {0}, МЕМО-field '{1}'. Read from memo file error
ru: Строка {0}, МЕМО-поле '{1}'. Не удалось прочитать значение из MEMO-файла

# DbfFile_Err_MemoUnexpectedEOF
source: Record no {0}, МЕМО-field '{1}'. Unexpected end of МЕМО-file for the block number {2}
ru: Строка {0}, МЕМО-поле '{1}'. Обнаружен неожиданный конец МЕМО-файла для блока {2}

# DbfFile_Err_NumberStringTooLong
source: Text presentation '{0}' length ({1}) exceeds the length of numeric field '{2}' ({3})
ru: Длина текстового представления '{0}' ({1}) превышает длину числового поля '{2}' ({3})

# DbfFile_Err_TooManyRecords
source: There are too many records in the DBF-file header: {0}
ru: Указано слишком много строк в заголовке DBF-файла: {0}

# DbfStr_Arg_FieldIndexOutOfRange
source: Field index must be in range from от 0 to {0}
ru: Индекс поля должен быть в диапазоне от 0 до {0}

# DbfStr_Err_RecordSizeTooBig
source: Record size in DBF-file struct is too big: {0}. Maximum possible value is: {1}
ru: Слишком большой размер одной записи задан в структуре DBF-файла: {0}. Максимальное значение: {1}

# DepChangeInfo_Err_ChainLoop
source: Cannot add an item {0} to the parent {1}. Chain is looping.
ru: Нельзя добавить элемент {0} к родителю {1}, т.к. цепочка зацикливается

# DepEvalExpr_Err_ArgNumExpected
source: Char '@' must be followed an argument number
ru: После '@' должен идти номер аргумента

# DepEvalExpr_Err_ArgNumNotInt
source: String {0} cannot be converted to an integer. Argument number expected
ru: Строку {0} нельзя преобразовать в число

# DepEvalExpr_Err_ArgNumOutOfRange
source: Argument number must be in range from 1 to {0}
ru: Номер аргумента должен быть в диапазоне от 1 до {0}

# DepEvalExpr_Err_OperationExpected
source: Argument cannot immediatelly follow another expression. Operation expected.
ru: Аргумент не должен идти непосредственно после другого выражения. Ожидалась операция

# DepExpr_Err_Calculate
source: Method Calculate() must be reimplemented if the Function handler has not been given in object constructor
ru: Метод Calculate() должен быть переопределен, если обработчик Function не был задан в конструкторе объекта

# DepSyncGroup_Err_SyncObjAlreadyAdded
source: Syncronization object{0} is already attached to group
ru: Нельзя повторно присоединять объект синхронизации {0} к группе

# DepValue_Arg_InputAlreadyAdded
source: Input {0} already used
ru: Повторное присоеднинение входа {0}

# DepValue_Arg_NotDepInput
source: Source cannot be attached to item {0}. DepInput type object required
ru: К элементу {0} нельзя присоединять источник. Требуется объект типа DepInput.

# DepValue_Err_RecursionOverflow
source: Value set is looped. StackOverflowException is prevented
ru: Установка значения зациклилось. Предотвращено StackOverflowException

# ExcelFunctions_Err_DATEDIFFmode
source: Calculation modes 'ym', 'md' and 'yd are not implemented yet
ru: Режимы расчета 'ym', 'md' и 'yd 'не реализованы

# ExcelFunction_Arg_ArgCountExact
source: Wrong argument count {1} in function '{0}' call. Expected argument count is {2}
ru: Неправильное число аргументов при вызове функции '{0}': {1}. Ожидалось аргументов: {2}

# ExcelFunction_Arg_ArgCountRange
source: Wrong argument count {1} in function '{0}' call. Expected argument count is from {2} to {3}
ru: Неправильное число аргументов при вызове функции '{0}': {1}. Ожидалось аргументов: от {2} до {3}

# ExecProc_Arg_AsyncResultForAnotherProc
source: AsyncResult object belongs to another ExecProc
ru: Объект AsyncResult относится к другой процедуре

# ExecProc_ErrTitle_AbortErrorWhenDispose
source: Error execution aborting when disposing the procedure object
ru: Ошибка прекращения выполнения процедуры при удалении

# ExecProc_ErrTitle_ExecutingError
source: Procedure executing failed
ru: Ошибка выполнения процедуры

# ExecProc_ErrTitle_RemoteExecProcQueryByTimer
source: Error on query RemoteExecProc by the timer
ru: Ошибка опроса RemoteExecProc по таймеру

# ExecProc_Err_AsyncNotFinished
source: Previous async call has not finished yet
ru: Предыдущий асинхронный вызов еще не завершен

# ExecProc_Err_AsyncResultWithoutSplash
source: ExecProc.BeginExecute() was called instead of BeginExecuteWithSplash()
ru: Использовался вызов ExecProc.BeginExecute(), а не BeginExecuteWithSplash()

# ExecProc_Err_Finished
source: Procedure has finished
ru: Процедура уже была завершена

# ExecProc_Err_NoExecutionInCurrentThread
source: There is no executing procedure in the curren thread
ru: В текущем потоке нет выполняющейся процедуры

# ExecProc_Err_NotExecutingState
source: Call is allowed when the procedure is executing. Current state is {0}
ru: Вызов допускается только при работе процедуры. Текущее значение State={0}

# ExecProc_Err_ShouldCallFromExecute
source: The mehod should be called from another executing ExecProc
ru: Метод должен вызываться из другой выполняющейся процедуры ExecProc

# ExecProc_Err_SplashStackSetWhileExecuting
source: SplashStack property cannot be set while ExecProc is executing
ru: Свойство SplashStack нельзя устанавливать во время выполнения процедуры

# FunctionParser_Err_AfterOtherExpr
source: Function name should not follow another expression. Operation expected.
ru: Имя функции не может быть продолжением другого выражения. Ожидалась операция

# FunctionParser_Err_CloseParenthesisNotFound
source: Close parenthesis not found for the function '{0}'
ru: Не найдена закрывающая скобка для функции '{0}'

# FunctionParser_Err_OpenParenthesisNotFound
source: Open parenthesis not found after the function name
ru: Не найдена открывающая скобка после имени функции

# FunctionParser_Err_OutOfFunction
source: Unexpected appearance of '{0}' out of the function call
ru: Неожиданное вхождение '{0}' вне вызова функции

# FunctionParser_Err_UnknownFunctionName
source: Unknown function name '{0}'
ru: Неизвестное имя функции '{0}'

# FunctionParser_Err_WantedAnotherArg
source: Another argument expected
ru: Ожидался еще аргумент

# FunctionParser_Err_WantedArg
source: Argument expected
ru: Ожидался аргумент

# FunctionParser_Err_WantedCloseParenthesis
source: Close parenthis expected for the function
ru: Ожидалась закрывающая скобка вызова функции

# FunctionParser_Err_WantedCloseParenthesisOrComma
source: Close parenthis or argument list separator ({0}) expected for the function
ru: Ожидалась закрывающая скобка вызова функции или разделитель списка аргументов {0}

# FunctionParser_Err_WantedOpenParenthesis
source: Open parenthesis expected after the function name
ru: Ожидалась открывающая скобка после имени функции

# FunctionParser_Err_WrongArgCountRange
source: Wrong function '{0}' argument count: {1}. Expected arguments: from {2} to {3}
ru: Неправильное количество аргументов функции '{0}': {1}. Ожидалось аргументов: от {2} до {3}

# FunctionParser_Err_WrongArgCountSingle
source: Wrong function '{0}' argument count: {1}. Expected arguments: {2}
ru: Неправильное количество аргументов функции '{0}': {1}. Ожидалось аргументов: {2}

# LoggingLogoutExecProc_Err_Busy
source: Debug information is gathering by another user at the time
ru: Получение отладочной информации в данный момент выполняется другим пользователем

# LoggingLogoutExecProc_Phase_GetInfo
source: Collecting debug information
ru: Получение отладочной информации

# LogoutTools_Err_CannotGenerateUniqueFileName
source: Cannot generate an unique file name
ru: Не удалось придумать уникальное имя файла

# MathOpParser_Err_AfterNoOp
source: There must be an operation before the open parenthesis
ru: Перед открывающей скобкой должна идти операция

# MathOpParser_Err_CloseParenthesisNotFound
source: Paired close parenthesis not found
ru: Не найдена парная закрывающая скобка

# MathOpParser_Err_LeftArgNotFound
source: Left side operand for the operation '{0}' not found. Operation cannot be unary.
ru: Не найден левый операнд для операции '{0}'. Операция не может быть унарной

# MathOpParser_Err_NothingInParentheses
source: There is nothing beetween the parentheses
ru: Выражение в скобках не задано

# MathOpParser_Err_NotImplementedForTypes
source: Mathematical operations are not implemented for afguments of type {0} and {1}
ru: Математические операции не реализованы для аргументов типа {0} и {1}

# MathOpParser_Err_OpNotBinary
source: Operation '{0}' cannot be binary
ru: Операция '{0}' не может быть бинарной

# MathOpParser_Err_RightArgNotFound
source: Right side operand for the operation '{0}' not found
ru: Не найден правый операнд для операции '{0}'

# MathOpParser_Err_UnknownBinaryOp
source: Unknown binary operation '{0}'
ru: Операции '{0}' нет в списке бинарных операций

# MathOpParser_Err_UnpairedCloseParenthesis
source: Unpaired close parenthesis
ru: Непарная закрывающая скобка

# MathOpParser_Err_WrongBinaryOp
source: Wrong operation '{0}' for the arguments of type {1}
ru: Недопустимая операция '{0}' для аргументов типа {1}

# MathOpParser_Err_WrongUnaryOp
source: Wrong unary operation '{0}' for the argument of type {1}
ru: Недопустимая унарная операция '{0}' для аргумента типа {1}

# NumConstParser_Err_AfterOtherExpr
source: Constant should not follow another expression. Operation expected.
ru: Константа не должна идти непосредственно после другого выражения. Ожидалась операция

# NumConstParser_Err_InvalidReplace
source: There in an invalid replacement pair '{0}' -> '{1}'. Original text and replacing text must have the same length
ru: Задана недопустимая подстановка '{0}' -> '{1}'. Исходный текст и замена должны иметь одинаковую длину

# ParserList_Err_CreateExpressionBeforeParsing
source: Token parsing has not been proceed
ru: Парсинг лексем не выполнялся

# ParserList_Err_CreateExpressionError
source: Error when expression obtained. {0}
ru: Ошибка получения выражения. {0}

# ParserList_Err_CreateExpressionNone
source: Parsing error. {0}
ru: Ошибка парсинга. {0}

# ParserList_Err_CreateExpressionOtherParserList
source: Token parsing was proceed with another ParserList
ru: Парсинг лексем выполнялся другим списком парсеров

# ParserList_Err_CreateSubExpressionCall
source: CreateSubExpression() should be called within implementation of CreateExpression(). It cannot be called alone
ru: Метод CreateSubExpression() должен вызываться только в процессе разбора всего выражения, а не самостоятельно

# ParserList_Err_SubParseCalled
source: SubParse() can be called only from an implementation of IParser.Parse()
ru: Метод SubParse() может вызываться исключительно из реализации IParser.Parse()

# ParserList_Err_TokenBeyondText
source: Token '{0}' is beyond the parsed text
ru: Лексема '{0}' выходит за границу текста"

# ParserList_Err_TokenOverlap
source: Token '{0}' overlaps the previous token '{1}'
ru: Лексема '{0}' перекрывается с предыдущей '{1}'

# ParserList_Err_TokenStartNegative
source: Token '{0}' start position cannot be negative
ru: Начальная позиция лексемы '{0}' не может быть отрицательной

# ParserList_Err_UnparsedMultiChars
source: Unparsed chars
ru: Нераспознанные символы

# ParserList_Err_UnparsedSingleChar
source: Unparser char '{0}'
ru: Нераспознанный символ '{0}'

# ParsingData_Err_GetChildExpressionReturnsNull
source: For the expression {0}, method GetChildExpressions() added null to the expression list
ru: Для выражения {0} метод GetChildExpressions() добавил в список значение null

# ParsingData_Err_NotParsed
source: Token parsing has not been proceed
ru: Парсинг лексем не выполнялся

# ParsingData_Err_SkipTokenCall
source: Method should be used only within CreateExpression() processing
ru: Метод может использоваться только в процессе получения вычислителя

# SimpleDigitalMaskProvider_Arg_NoDigits
source: Mask does not contain any digit placeholder
ru: Маска не содержит ни одной числовой позиции

# SimpleDigitalMaskProvider_Msg_BadChar_DigitWanted
source: Invalid char '{0}' at position {1}. A digit expected.
ru: Неправильный символ '{0}' в позиции {1}. Ожидалась цифра

# SimpleDigitalMaskProvider_Msg_BadChar_SeparatorWanted
source: Invalid char '{0}' at position {1}. Char '{2}' expected.
ru: Неправильный символ '{0}' в позиции {1}. Ожидался символ '{2}'

# SimpleDigitalMaskProvider_Msg_Empty
source: Value is empty
ru: Пустая строка

# SimpleDigitalMaskProvider_Msg_WrongLength
source: Invalid string length {0}. {1} char(s) expected.
ru: Неправильная длина строки {0}. Должно быть {1} символ(a, ов)

# StdMaskProvider_Msg_BadChar
source: Invalid char '{0}' at position {1}
ru: Недопустимый символ '{0}' в позиции {1}

# StdMaskProvider_Msg_Empty
source: Value is empty
ru: Значение не задано

# StdMaskProvider_Msg_MaskMismatch
source: Value does not match the mask
ru: Значение не соответствует маске

# StdMaskProvider_Msg_MoreCharsNeeded
source: More characters required
ru: Требуются дополнительные символы

# StrConstParser_Err_AfterOtherExpr
source: Constant should not follow another expression. Operation expected.
ru: Константа не должна идти непосредственно после другого выражения. Ожидалась операция

# Token_Err_DataNotParsingState
source: Data is not in the parsing state
ru: Набор данных не находится в состоянии парсинга

# LogoutTools_ErrTitle_Default
source: Error in {0}
ru: Ошибка в {0}
