Repository: a94827/FreeLibSet
Catalog: ExtTools/Res.*.resx
Languages: ru

# ExecProc_Err_CallBackGetSuspendedException
source: One of the children objects in the callback selector threw an exception when GetSuspended() called. This object has been removed from the list
ru: Один из дочерних объектов в callback-селекторе создал исключение при вызове GetSuspended(). Этот объект удален из списка

# ExecProc_Err_CallBackGetSuspendedNoSuccess
source: There was no succeeded call of GetSuspended()
ru: Не было успешного вызова GetSuspended()

# ExecProc_Err_Started
source: Procedure has already been started
ru: Процедура уже была запущена

# LogoutTools_ErrTitle_WhenMethodCalled
source: Error when {0} called
ru: Ошибка при вызове {0}

# BRPaginator_Arg_SelectorForAnotherBand
source: Selector belongs to another band
ru: Селектор относится к другой полосе

# BRPaginator_Arg_SelectorForAnotherCell
source: Selector refers to a cell that does not included to the current range
ru: Селектор ссылается на ячейку, не входящую в текущий блок

# BRReport_Arg_ParentStyleForDifferentReport
source: Parent style belongs to another report
ru: Родительский стиль относится к другому отчету

# BRReport_Arg_StyleForDifferentReport
source: Style belongs another report
ru: Стиль относится к другому отчету

# BRReport_Err_CellAlreadyMerged
source: The cell with index [{0}, {1}] already belongs to another merged area
ru: Ячейка с индексом [{0}, {1}] уже входит в состав другого объединения

# BRReport_Err_DateOutOfExcelRange
source: *** Date is out of Excel supported range:: {0} ***
ru: *** Дата, выходящая за допустимые пределы Excel: {0} ***

# BRReport_Err_PropertyCannotBeSet
source: This property cannot be set
ru: Нельзя устанавливать это свойство

# BRReport_Err_StreamWithoutSeek
source: Stream doesn't support Seek method
ru: Поток не поддерживает Seek

# BRReport_Msg_ExcelSheetName
source: Sheet {0}
ru: Лист {0}

# BRReport_Phase_CreateExcelWorkbook
source: Workbook creation
ru: Создание книги

# BRReport_Phase_SendDataToExcel
source: Sending data to Excel
ru: Передача данных в книгу Excel

# BRReport_Phase_StartExcel
source: Excel starting
ru: Запуск Excel

# Common_Err_MustBeReimplemented
source: Метод/свойство {0} должно быть переопределено для класса {1}
ru: Method/Property {0} must be reimplented for the class {1}

# DateRangeDialog_Msg_Prompt
source: Range
ru: Диапазон

# DateRangeDialog_Msg_Title
source: Date range input
ru: Ввод диапазона дат

# DateTimeInputDialog_Msg_Prompt
source: Value
ru: Значение

# DateTimeInputDialog_Msg_TitleDate
source: Date input
ru: Ввод даты

# DateTimeInputDialog_Msg_TitleDateTime
source: Date and time input
ru: Ввод даты и времени

# DateTimeInputDialog_Msg_TitleTime
source: Time input
ru: Ввод времени

# ExecProcLock_ErrTitle_UnlockError
source: Unlock error for {0}
ru: Ошибка разблокировки {0}

# ExecProcLock_ErrTitle_UserCancel
source: User cancelled the waiting for the lock
ru: Отказ пользователя от ожидания блокировки

# ExecProcLock_Phase_ErrorGetInfo
source: Error when taken description of locked object {0}
ru: Ошибка при получении описания заблокированного объекта. {0}

# ExecProcLock_Phase_NoLockOwner
source: [ no owner info ]
ru: [ нет данных ]

# ExecProcLock_Phase_Wait
source: Waiting for lock the object '{0}'. It's locked by {1}
ru: Ожидание блокировки объекта '{0}'. Заблокировал: {1}

# ExecProc_Phase_Executing
source: Executing: {0}
ru: Выполняется {0}

# FileAssociations_ArgExtNoDot
source: File extension should start with a dot char
ru: Расширение должно начинаться с точки

# FileAssociations_ErrTitle_LoadError
source: File associatiations loading error
ru: Ошибка загрузки файловых ассоциаций

# InputDataGridDialog_Msg_Title
source: Table
ru: Таблица

# ListSelectDialog_Err_SingleSelect
source: List is for single selection only
ru: Список не предназначен для множественного выбора

# ListSelectDialog_Msg_TitleMultiSelect
source: Selection from the list
ru: Выбор из списка

# ListSelectDialog_Msg_TitleSingleSelect
source: Selection from the list
ru: Выбор из списка

# NamedValues_Arg_ConstructorNeeded
source: Type {0} has no default constructor
ru: Тип {0} не имеет конструктора без параметров

# NamedValues_Arg_MustBeClass
source: Type must be a class, Presented type: {0}
ru: Тип данных должен быть классом, а не {0}

# NamedValues_Err_NotSerializable
source: Value with key '{0}' has the type {1} which is neither serializable nor marshal-by-reference
ru: Значение с ключом '{0}' имеет тип {1}, который не является сериализуемым и не может передаваться по ссылке

# NumInputDialog_Msg_Prompt
source: Value
ru: Значение

# NumInputDialog_Msg_Title
source: Number input
ru: Ввод числа

# NumRangeInputDialog_Msg_Prompt
source: Range
ru: Диапазон

# NumRangeInputDialog_Msg_Title
source: Number range input
ru: Ввод диапазона чисел

# PasswordInputDialog_Msg_Prompt
source: Password
ru: Пароль

# PasswordInputDialog_Msg_Title
source: Password input
ru: Ввод пароля

# RemoteInterfaceNotsopportedException_Err_Default
source: Calling of user interface is not possible
ru: Вызов интерфейса пользователя невозможен

# RI_Arg_AlienCfgPart
source: Alien config section
ru: Чужая секция данных

# RI_Arg_DateRangeDiffMonths
source: Date range must belongs single month
ru: Интервал дат должен относиться к одному месяцу

# RI_Arg_DateRangeDiffYears
source: Date range must belongs single year
ru: Интервал дат должен относиться к одному году

# RI_Err_ArgumentNotSet
source: Argument '{0}' not set
ru: Не задан аргумент '{0}'

# RI_Err_IsFixed
source: Item is fixed. You cannot change controlling properties or add children items
ru: Элемент защищен от изменения управляющих свойств и добавления дочерних элементов

# RI_Err_UnknownAction
source: Unknown Action='{0}'
ru: Неизвестное действие Action='{0}'

# RI_Msg_Error
source: Error
ru: Ошибка

# RI_Msg_Warning
source: Warning
ru: Предупреждение

# TextInputDialog_Msg_Prompt
source: Value
ru: Значение

# TextInputDialog_Msg_Title
source: Text input
ru: Ввод текста

# CsvTextConvert_Err_BadChar
source: Bad char '{0}' at position {1}. '{2}' expected
ru: Неправильный символ '{0}' в позиции {1}. Ожидался символ '{2}'

# CsvTextConvert_Err_StringWithoutEnd
source: Unexpected end of line. Final quote char not found
ru: Неожиданный конец строки. Не найдена завершающая кавычка

# CsvTextConvert_Err_WithLineNumber
source: Error at line {0}. {1}
ru: Ошибка в строке {0}. {1}

# ExeFileInfo_Err_OptionalHeaderSignature
source: Aux header has an invalid signature {0}
ru: Неправильная сигнатура дополнительного заголовка {0}

# ExeFileInfo_Err_ResEndOutOfFile
source: Resource end position exceeds the file stream
ru: Конец ресурса выходит за пределы файла

# ExeFileInfo_Err_ResStartOutOfFile
source: Resource start position exceeds the file stream
ru: Начальная позиция ресурса выходит за пределы файла

# OpenOfficeTools_Arg_GenericCulture
source: Wrong culture with code '{0}'. There is no char '-' in code
ru: Неправильная культура с кодом '{0}'. Отсутствует '-'

# OpenOfficeTools_Arg_TooManyPartsInNumberFormat
source: Number format '{0}' consists of more than three sections
ru: Числовой формат '{0}' состоит больше, чем из трех частей

# SingleByteTranscoder_Arg_Unsupported
source: Cannot do a direct transcoding from encoding {0} to {1}
ru: Нельзя выполнять прямое перекодирование из кодировки {0} в {1}

# UISelRCGrid_Err_EmptyValuesNotAllowed
source: Empty values are not allowed
ru: Пустые значения не допускаются

# UISelRCGrid_Err_NoDate
source: String '{0}' cannot be converted to date
ru: Строку '{0}' нельзя преобразовать в дату

# UISelRCGrid_Err_NoEnum
source: Unknown string '{0}'
ru: Неизвестная строка '{0}'

# UISelRCGrid_Err_NoInt
source: String '{0}' cannot be converted to an integer
ru: Строку '{0}' нельзя преобразовать в целое число

# UISelRCGrid_Err_NoNumber
source: String '{0}' cannot be converted to a number
ru: Строку '{0}' нельзя преобразовать в число

# UISelRCGrid_Err_Validating
source: Value validating error. {0}
ru: Ошибка проверки значения. {0}

# UIValidateResult_Msg_NoMessage
source: Message text is not supplied
ru: Текст сообщения об ошибке не задан

# Common_Arg_UnknownValueWithWanted
source: Unknown value {0}. Available values are: {1}
ru: Неизвестное значение {0}. Допустимые значения: {1}

# RegistryKey2_Arg_InvalidValueType
source: Only string and byte arrays can written as registry values
ru: Только строка и массив байт может быть записана как значение реестра

# RegistryKey2_Arg_SubKeyNotFound
source: Subkey does not exist
ru: Подраздел не существует

# RegistryKey2_Arg_ValueNotFound
source: Value does not exist
ru: Значение не найдено

# RegistryKey2_Arg_ValueTypeMismatch
source: Type does not match the valueKind
ru: Тип значения не соответствует valueKind

# RegistryKey2_Err_ChildMustBeVolatile
source: Cannot create a stable subkey under a volatile parent key
ru: Нельзя создать стабильный подраздел во временном родительском разделе

# RegistryKey2_Err_InvalidHandle
source: Invalid handle
ru: Неправильный дескриптор

# RegistryKey2_Err_NetworkPathNotFound
source: The network path was not found
ru: Сетевой путь не найден

# RegistryKey2_Err_Root
source: Operation cannot be performed on the root registry key
ru: Операция не может быть выполнена с корневым разделом реестра

# RegistryKey2_Err_SubKeyHasChildren
source: Registry key has subkeys
ru: Подраздел содержит дочерние подразделы

# RegistryTree_Arg_UnknownRoot
source: Unknown root registry key '{0}'
ru: Неизвестный корневной узел реестра '{0}'

# RegistryTree_Err_IsReadOnly
source: Registry key collection is open in read-only mode
ru: Коллекция узлов реестра открыта только для чтения

# ResourceTable_Arg_ResourceNoFound
source: Resource {0} not found
ru: Ресурс {0} не найден

# ResourceTable_Err_IconNotFound
source: Icon {0} not found
ru: Не найден значок {0}

# ResourceTable_Err_IconWrongColorCount
source: There is no BPP presented in the icon and it's given unknown ColorCount={0}
ru: Для значка не задан BPP и задан недопустимый ColorCount=" + colorCount.ToString()

# ResourceTable_Err_PngSignature
source: First block of PNG-file must be the IHDR-header
ru: Первым блоком в PNG-файле должен быть заголовок IHDR

# ResourceTable_Err_ResourceIsEmpty
source: Empty resource {0}
ru: Пустой ресурс с идентификатором {0}

# ResourceTable_Err_UnknownImageHeader
source: Unknown header
ru: Неизестный заголовок

# WTS_Err_NoCurrentSession
source: No current session
ru: Нет текущей сессии

# Common_Arg_OutOfRangeMinMaxInv
source: Value must be in range from {0} to {1}, but this is impossible. So, the call is completely unavailable
ru: Значение должно быть в диапазоне от {0} до {1}, но это невозможно. Поэтому вызов полностью недопустим

# Common_Arg_NoType
source: Value of type {0} is not of the type {1}
ru: Значение типа {0} не является типом {1}

# Common_Err_ObjectPropertyCount
source: Property {0} of object {1} has wrong length {2}. Expected: {3}
ru: Свойство {0} объекта {1} имеет недопустимую длину {2}. Ожидалось: {3}

# Common_Err_ObjectPropertyNotSet
source: Property {0} of object {1} has not been set
ru: Свойство {0} объекта {1} не установлено

# FileBatchHandler_Phase_CopyFile
source: Copying file {0}
ru: Копирование файла {0}

# FileBatchHandler_Phase_DeleteDir
source: Deleting directory {0}
ru: Удаление каталога {0}

# FileBatchHandler_Phase_DeleteFile
source: Deleting file {0}
ru: Удаление файла {0}

# FileBatchHandler_Phase_MoveDir
source: Moving directory {0}
ru: Перемещение каталога {0}

# FileBatchHandler_Phase_MoveFile
source: Moving file {0}
ru: Перемещение файла {0}

# FileTools_Phase_ForceDirs
source: Creating directory {0}
ru: Создание каталога {0}

# Common_Err_ObjectEventHandlerNotSet
source: Event {0} handler for object {1} has not been set
ru: Обработчик события {0} объекта {1} не установлен

# UITools_Msg_Boolean
source: boolean value
ru: логическое значение

# UITools_Msg_ConvertErrorMessage
source: Text '{0}' cannot be converted to '{1}'
ru: Текст '{0}' нельзя преобразовать в значение типа '{1}'

# UITools_Msg_Date
source: date
ru: дата

# UITools_Msg_DateTime
source: date and time
ru: дата и время

# UITools_Msg_Float
source: float value
ru: число

# UITools_Msg_Int
source: integer value
ru: целое число

# UITools_Msg_Null
source: empty
ru: пусто

# UITools_Msg_String
source: string
ru: строка

# UITools_Msg_Time
source: time
ru: время

# Common_Err_ObjectPropertyAlreadySet
source: Property {0} of object {1} has already been set
ru: Свойство {0} объекта {1} уже установлено

# Common_Err_ObjectPropertySwitch
source: Invalid property {0} of object {1} switch from value {2} to {3}
ru: Недопустимое переключение свойства {0} объекта {1} из {2} в {3}

# UITools_Msg_No
source: нет
ru: no

# UITools_Msg_Yes
source: да
ru: yes

# ListSortDirection_Name_Ascending
source: in ascending order
ru: по возрастанию

# ListSortDirection_Name_AscendingShort
source: asc.
ru: возр.

# ListSortDirection_Name_Descending
source: in descending order
ru: по убыванию

# ListSortDirection_Name_DescendingShort
source: desc.
ru: убыв.

# MaskedTextResultHint_Msg_AlphanumericCharacterExpected
source: A digit or a letter expected
ru: Ожидалась цифра или буква

# MaskedTextResultHint_Msg_CharacterEscaped
source: Character escaped
ru: Символ пропускается

# MaskedTextResultHint_Msg_DigitExpected
source: A digit expected
ru: Ожидалась цифра

# MaskedTextResultHint_Msg_LetterExpected
source: A letter expected
ru: Ожидалась буква

# MaskedTextResultHint_Msg_UnavailableEditPosition
source: All characters are entered
ru: Все символы уже введены

# Common_Arg_NotInCollection
source: Value {0} does not belongs the collection {1}
ru: Значение {0} не принадлежит коллекции {1}

# Common_Arg_NotInPropertyCollection
source: Value {0} does not belongs the collection {1} ({2}) of object {3}
ru: Значение {0} не принадлежит коллекции {1} ({2}) объекта {3}

# ErrorMessageKind_Msg_ErrorShort
source: Err.
ru: Ош.

# ErrorMessageKind_Msg_InfoShort
source: Info
ru: Инфо

# ErrorMessageKind_Msg_WarningShort
source: W.
ru: Пр.

# UITools_Err_CanBeEmptyModeError
source: Value '{0}' cannot be empty
ru: Значение '{0}' должно быть заполнено

# UITools_Err_CanBeEmptyModeWarning
source: Value '{0}' probably should be not empty
ru: Значение '{0}' , вероятно, должно быть заполнено

# UITools_Err_OutOfRangeMax
source: Value {0} cannot be greater than {1}
ru: Значение {0} должно быть не больше {1}

# UITools_Err_OutOfRangeMin
source: Value {0} cannot be less than {1}
ru: Значение {0} должно быть не меньше {1}

# UITools_Err_OutOfRangeMinMax
source: Value {0} must be in range from {1} to {2}
ru: Значение {0} должно быть в диапазоне от {1} до {2}

# UITools_Err_OutOfRange
source: Value {0} must be in range {1}
ru: Значение {0} должно быть в диапазоне {1}

# Common_Err_DllNotFound
source: Cannot load DLL '{0}'
ru: Не удалось загрузить библиотеку '{0}'

# ZipFileTools_Err_ArcIsEmpty
source: Archive contains no files
ru: Архив не содержит файлов

# UITools_Msg_ListIsEmpty
source: [ List is empty ]
ru: [ Пустой список ]

# CommandLineParser_Arg_AddOptionWithValues
source: Use overload without value list when ValueMode=None
ru: Для режима ValueMode=None используйте перегрузку без списка значений

# CommandLineParser_Arg_BadActionFormat
source: Bad action format {0}
ru: Неправильный описатель действия {0}

# CommandLineParser_Arg_BadOptionFormat
source: Bad option format {0}
ru: Неправильный описатель опции {0}

# CommandLineParser_Err_ActionDisabled
source: Action disabled
ru: Действие заблокировано

# CommandLineParser_Err_ActionModeNone
source: Property ActionMode must be set when ActionDefs list is not empty
ru: Свойство ActionMode должно быть установлено, если заданы описания действий в ActionDefs

# CommandLineParser_Err_CommonArgsErrorMessage
source: Command line argument, except options, are not allowed
ru: Аргументы командной строки, кроме опций, не допускаются

# CommandLineParser_Err_MisplacedOption
source: Option '{0}' misplaced. {1}
ru: Недопустимое вхождение опции '{0}'. {1}

# CommandLineParser_Err_NoValueAfterEq
source: There must be a value after the '=' sign for the option '{0}'
ru: После знака '=' не задано значение опции '{0}'

# CommandLineParser_Err_OptionDisabled
source: Option disabled
ru: Опция заблокирована

# CommandLineParser_Err_OptionTwice
source: Option '{0}' can be placed only once in command line
ru: Для опции '{0}' может быть задано только одно вхождение в командной строке

# CommandLineParser_Err_OptionUnknownValue
source: Unknown value {0} for the option {1}. Available values are: {2}
ru: Недопустимое значение {0} для опции {1}. Допустимые значения: {2}

# CommandLineParser_Err_OptionValueRequired
source: Option '{0}' requires a value
ru: Для опции '{0}' не задано обязательное значение

# CommandLineParser_Err_OptionValueUnwanted
source: Option '{0}' cannot have a value
ru: Опция '{0}' не предусматривает задания значения

# CommandLineParser_Err_UnknownAction
source: Unknown action '{0}'
ru: Неизвестное действие '{0}'

# CommandLineParser_Err_UnknownOption
source: Unknown option '{0}'
ru: Неизвестная опция '{0}'

# Common_Err_ObjectMethodNotCalled
source: Method {0} of object {1} has not been called
ru: Метод {0} объекта {1} не вызывался

# Common_Err_DataColumnNotFound
source: Table '{0}' does not contain column '{1}'
ru: Таблица '{0}' не содержит столбца с именем '{1}'

# Common_Err_DataReaderColumnNotFound
source: Data reader does not contain column with name '{0}'
ru: Источник данных не содержит столбца с именем '{0}'

# Common_Err_ConstructorAlreadyCalled
source: Constructor of object of type '{0}' has already been called
ru: Уже выполнялось создание объектов типа '{0}'

# BRBookmark_Err_NameIsEmpty
source: Bookmark name is empty
ru: Имя закладки не задано

# BRBookmark_Err_NameIsInvalid
source: Invalid bookmark name '{0}'. Name must consist of latin letters, digits and underscore character. It must start with a letter.
ru: Неправильное имя закладки '{0}'. Имя может содержать латинские буквы, цифры и знак подчеркивания и должно начинаться с буквы.

# BRBookmark_Err_NameUnderscore
source: Invalid bookmark name '{0}'. Name should not end with an underscore character nor contains two characters together.
ru: Неправильное имя закладки '{0}'. Имя не должно зваканчиваться подчеркиванием или содержать два символа подчеркивания подряд.
