Repository: a94827/FreeLibSet
Catalog: ExtDBDocs/Res.*.resx
Languages: ru

# DBxBinDataHandler_Arg_BinDataId
source: Wrong identifier Id={0} for table 'BinData'
ru: Неправильный идентификатор записи для таблицы 'BinData' Id={0}

# DBxBinDataHandler_Arg_FileNameId
source: Wrong identifier Id={0} for table 'FileNames'
ru: Неправильный идентификатор записи в таблице 'FileNames' Id={0}

# DBxBinDataHandler_Arg_FileTooLong
source: File is too long
ru: Слишком длинный файл

# DBxBinDataHandler_Err_BinDataBlokReading
source: Table 'BinData', Id={0}. Block reading error. {1}
ru: Таблица 'BinData', Id={0}. Ошибка чтения блока данных. {1}

# DBxBinDataHandler_Err_BinDataLength
source: Block length mismatch in 'BinData' table. For block with Id={0} the stored in database value is {1}, but queried length is {2}
ru: В таблице 'BinData' для блока данных с Id={0} расходится длина. Записано в базе данных: {1}, запрошенная длина: {2}

# DBxBinDataHandler_Err_BinDataNoReplays
source: There are no replays found in table 'BinData' ('{0}')
ru: Повторов в таблице 'BinData' ('{0}') не обнаружено

# DBxBinDataHandler_Err_BinDataReplayMD5
source: Replay in table 'BinData'. For Id={0} and Id={1} there is same MD5 checksum ='{2}'
ru: Повтор в таблице 'BinData'. Для Id={0} и Id={1} задана одинаковая сумма MD5='{2}'

# DBxBinDataHandler_Err_BinDataStorageDiffSection
source: Database '{0}', table 'BinDataStorage', Id={1}. In the main table 'BinData' for this Id section #{2} is required, but #{3} really used
ru: База данных '{0}', таблица 'BinDataStorage', Id={1}. В основной таблице 'BinData' для этого идентификатора задана секция №{2}, а не №{3}

# DBxBinDataHandler_Err_BinDataStorageError
source: Database '{0}', table 'BinDataStorage'. Unhandled error: {1}
ru: База данных '{0}', таблица 'BinDataStorage'. Неперехваченная ошибка: {1}

# DBxBinDataHandler_Err_BinDataStorageHasWarnings
source: Database '{0}', table 'BinDataStorage' (section #{1}). Warnings found.
ru: База данных '{0}', таблица 'BinDataStorage' (секция №{1}). Обнаружены предупреждения.

# DBxBinDataHandler_Err_BinDataStorageNoErrors
source: Database '{0}', table 'BinDataStorage' (section #{1}). No errors
ru: База данных '{0}', таблица 'BinDataStorage' (секция №{1}). Нет ошибок

# DBxBinDataHandler_Err_BinDataStorageUnknownId
source: Database '{0}', table 'BinDataStorage', Id={1}. There is no such Id in main table 'BinData'
ru: База данных '{0}', таблица 'BinDataStorage', Id={1}. Такого идентификатора нет в основной таблице 'BinData'

# DBxBinDataHandler_Err_BinDataTotalInfo
source: Total record count in table 'BinData' ({0}): {1}, with errors: {2}
ru: Записей в таблице 'BinData' ({0}): {1}, с ошибками: {2}

# DBxBinDataHandler_Err_BinDataWrongBlockLength
source: Table 'BinData', Id={0}. Wrong data block length. Expected: {1}, read: {2}
ru: Таблица 'BinData', Id={0}. Неправильная длина блока данных. Ожидалось: {1}, прочитано: {2}

# DBxBinDataHandler_Err_BinDataWrongMD5
source: Table 'BinData', Id={0}. Wrong data block MD5-checksum
ru: Таблица 'BinData', Id={0}. Неправильная контрольная сумма MD5 для блока данных.

# DBxBinDataHandler_Err_BinDataZeroMD5
source: Table 'BinData', Id={0}. MD5 is zero. Validation skipped.
ru: Таблица 'BinData', Id={0}. Нулевое значение MD5. Не проверяется.

# DBxBinDataHandler_Err_DocRefUnknown
source: {0}. Id={1}. Wrong reference {2}. Table '{3}' does not contain a record with such identifier.
ru: {0}. Id={1}. Неправильная ссылка {2}. В таблице '{3}' нет записи с таким идентификатором

# DBxBinDataHandler_Err_ImportToNotEmptyTable
source: Table '{0}' already contains rows. Import is possible when the table is empty.
ru: Таблица '{0}' уже содержит строки. Импорт возможен, только если таблица пуста

# DBxBinDataHandler_Err_InsufficientEntryCount
source: Insufficient entry count ({0}) to fragmented databases. Table 'BinData' uses section with numbeк {1}
ru: Недостаточное количество точек входа во фрагментированные базы данных ({0}). В таблице 'BinData' используется секция с номером {1}

# DBxBinDataHandler_Err_NoSectionEntries
source: There are no section entries added
ru: Не задано ни одной точки входа в SectionEntries

# DBxBinDataHandler_Err_NoUsBinDataUseFiles
source: At least one of propertiesUseBinData or UseFiles must be set to true. If application does not store such data, the object DBxBinDataHandler should not be created
ru: Должно быть установлено хотя бы одно из свойств UseBinData или UseFiles. Если в программе не храняться такие данные, то объект DBxBinDataHandler создавать не следует

# DBxBinDataHandler_Err_SectionEntriesWithoutFragmentation
source: Cannot add entries to SectionEntries if UseFragmentation=false
ru: Нельзя задавать точки входа в SectionEntries, если UseFragmentation=false

# DBxBinDataHandler_Phase_BinDataReplaySearch
source: Replays in binary data searching
ru: Поиск повторов в двоичных данных

# DBxBinDataHandler_Phase_BinDataStorage
source: 'BinDataStorage' validation in database '{0}'
ru: Проверка 'BinDataStorage' в базе данных '{0}'

# DBxBinDataHandler_Phase_BinDataValidation
source: Binary data validation
ru: Проверка двоичных данных

# DBxBinDataHandler_Phase_DBValidation
source: Database '{0}' validation
ru: Проверка БД '{0}'

# DBxBinDataHandler_Phase_DocRefValidation
source: Document references validation
ru: Проверка ссылок в документах

# DBxBinDataHandler_Phase_RefSearching
source: Reference searching. {0}
ru: Поиск ссылок. {0}

# DBxDocConnectionHelper_Err_DBxManagerListEmpty
source: Database manager list DBxManager.Managers is empty
ru: Список менеджеров баз данных DBxManager.Managers пуст

# DBxDocConnectionHelper_Err_StructUpdatingPrefix
source: Struct {0} updating.
ru: Обновление структуры {0}.

# DBxDocConnectionHelper_Err_UndoNotAppliable
source: History is not appliable with given settings of DBxDocTypes object
ru: При заданных настройках объекта DBxDocTypes, ведение истории невозможно

# DBxDocConnectionHelper_Err_UnknownProviderName
source: ProviderName property has unknown value '{0}'. Available values are: {1}
ru: Свойство ProviderName содержит неизвестный провайдер '{0}'. Допустимые значения: {1}

# DBxDocConnectionHelper_Phase_DBUpdating
source: Updating database '{0}'
ru: Обновление базы данных '{0}'

# DBxDocPermissions_Arg_DocProviderIsProxy
source: docProvider cannot be a remote object (transparent proxy) beacause object UserPermissions is not serializable
ru: docProvider не может быть удаленным объектом (transparent proxy), т.к. объект UserPermissions не является сериализуемым

# DBxDocPermissions_Err_AccessDeniedDelete
source: to delete
ru: на удаление

# DBxDocPermissions_Err_AccessDeniedEdit
source: to edit
ru: на изменение

# DBxDocPermissions_Err_AccessDeniedNew
source: to create
ru: на создание

# DBxDocPermissions_Err_AccessDeniedRestore
source: to restore
ru: на восстановление

# DBxDocPermissions_Err_AccessDeniedView
source: to view
ru: на просмотр

# DBxDocPermissions_Err_AccessDeniedViewHistory
source: to view history of
ru: на просмотр истории

# DBxDocPermissions_Err_DocProviderWithoutUserPermissions
source: docProvider does not return UserPermissions property. Context switch is probably appear and UserPermissions object is not serializable. DBxDocProvider with its own permission copy should be used.
ru: docProvider не возвращает свойство UserPermissions, вероятно, из-за того, что выполняется переход между контекстами, а объект UserPermissions не является сериализуемым. Следует использовать DBxDocProvider, хранящий собственную копию разрешений.

# DBxDocPermissions_Err_DocSetAccessDenied
source: There is no acccess rights {0} documents. {1}
ru: Нет права {0} документов. {1}

# DBxDocProviderIdReplacer_Err_NoDocIdColumn
source: Invalid data set. In the table '{0}' there is a variable reference column {1} with a table identifier, but column '{2}' with document identifier is missed
ru: Неправильный набор данных. При создании строки в таблице '{0}' сущействует переменное ссылочное поле '{1}', содержащее идентификатор таблицы, но нет поля '{2}' содержащего идентификатор документа"

# DBxDocProviderIdReplacer_Err_NoTableIdColumn
source: Invalid data set. In the table '{0}' there is a variable reference column '{1}' with a document identifier, but column '{2}' with a table identifier is missed
ru: Неправильный набор данных. В таблице '{0}' существует переменное ссылочное поле '{1}', содержащее идентификатор документа, но нет поля '{2}', содержащего идентификатор таблицы

# DBxDocProviderIdReplacer_Err_UnknownTableId
source: While adding row to table '{0}', column '{1}' contains identifier {2} of referenced table, but there is no document table with such an identifier
ru: При создании строки в таблице '{0}' в поле '{1}' задан идентификатор таблицы {2}, на которую выполняется ссылка, которому не соответствует никакая таблица документа

# DBxDocProvider_Arg_UnknownDocType
source: Unknown document type '{0}'
ru: Неизвестный вид документа '{0}'

# DBxDocProvider_Arg_WrongId
source: Wrong identifier {0}
ru: Недопустимый идентификатор {0}

# DBxDocProvider_Arg_WrongIdInTable
source: Wrong identifier {0} in table '{1}'
ru: Недопустимый идентификатор {0} в таблице '{1}'

# DBxDocProvider_Name_NoUser
source: No user
ru: Нет пользователя

# DBxDocSelection_Msg_Empty
source: No documents
ru: Нет документов

# DBxDocSet_Arg_ProviderIsProxy
source: DBxDocProvider is a remote object (TransparentProxy). To correct work it should be created in the current context. Use object of type DBxChainDocProvider
ru: Провайдер DBxDocProvider является удаленным объектом (TransparentProxy). Для правильной работы требуется, чтобы он был в текущем контексте. Используйте переходник DBxChainDocProvider

# DBxDocSet_Err_DocSubDocStateMismatch
source: Subdocument '{0}' with identifier SubDocId={1} has state '{2}', but document '{3}' with identifier DocId={4}, that own the subdocument, has state '{5}'
ru: Поддокумент '{0}' с идентификатором SubDocId={1} находится в состоянии '{2}', а строка документа '{3}' с идентификатором DocId={4} к которому относится поддокумент, - в состоянии '{5}'

# DBxDocSet_Err_FicvtiveIdInUnchangedRow
source: {0}, Id={1}. Data row has state 'Unchanged' but identifier is fictive.
ru: {0}, Id={1}. Строка находится в состоянии Unchanged, а идентификатор является фиктивным

# DBxDocSet_Err_NoBinDataTable
source: Binary data with temporary identifier queried, but thete is no 'BinData' table in the data set
ru: Запрошены двоичные данные с временным идентификатором, но таблицы 'BinData' нет в наборе данных

# DBxDocSet_Err_NoDocForSubDoc
source: Subdocument '{0}' with identifier SubDocId={1} belongs to doucment '{2}' with identifier DocId={3} that misses in data set
ru: Поддокумент '{0}' с идентификатором SubDocId={1} относится к документу '{2}'с идентификатором DocId={3}, которого нет в наборе

# DBxDocSet_Err_NoFileNameTable
source: File with temporary identifier queried, but thete is no 'FileNames' table in the data set
ru: Запрошен файл с временным идентификатором, но таблицы 'FileNames' нет в наборе данных

# DBxDocSet_Err_RefToDeletedInDB
source: {0}, Id={1}, column '{2}'. There is a reference to document or subdocument '{3}' with Id={4}, which is marked as deleted in database
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на документ/поддокумент '{3}' с Id={4}, который в базе данных помечен как удаленный

# DBxDocSet_Err_RefToDocDeletedInDB
source: {0}, Id={1}, column '{2}'. There is a reference to subdocument '{3}' с Id={4} of document '{5}' with DocId={6}, which is marked as deleted in database
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на поддокумент '{3}' с Id={4}, документ '{5}' которого с DocId={6} помечен как удаленный

# DBxDocSet_Err_RefToNewButNoTable
source: {0}, Id={1}, column '{2}'. There is a reference to new document or subdocument RefId={3}, but there is no table '{4}' in the data set.
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на новый документ/поддокумент RefId={3}, но в наборе нет таблицы '{4}'

# DBxDocSet_Err_RefToNewDeleted
source: {0}, Id={1}, column '{2}'. There is a reference to new document or subdocument RefId={3}, but the row in table '{4}' is marked for deletion
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на новый документ/поддокумент RefId={3}, но в таблице '{4}' строка помечена на удаление

# DBxDocSet_Err_RefToNewInUnchangedRow
source: {0}, Id={1}, column '{2}'. There is a reference to new document or subdocument RefId={3}, but the row is in view mode.
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на новый документ/поддокумент RefId={3}, но строка находится в режиме просмотра

# DBxDocSet_Err_RefToNewUnknown
source: {0}, Id={1}, column '{2}'. There is a reference to new document or subdocument RefId={3}, but there is no row in table'{4}' with such an identifier.
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на новый документ/поддокумент RefId={3}, но в таблице '{4}' нет строки с таким идентификатором

# DBxDocSet_Err_RefToNotInDB
source: {0}, Id={1}, column '{2}'. There is a reference to document or subdocument '{3}' with invalid Id={4} not exist in database
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на документ/поддокумент '{3}' с Id={4}, которого нет в базе данных

# DBxDocSet_Err_RefToOldDeleted
source: {0}, Id={1}, column '{2}'. There is a reference to exist document or subdocument RefId={3}, but the row in table '{4}' is marked for deletion
ru: {0}, Id={1}, поле '{2}'. Задана ссылка на существующий документ/поддокумент RefId={3}, но в таблице '{4}' строка помечена на удаление

# DBxDocSet_Err_UnknownBinDataId
source: Binary data queried for unknown temporary identifier Id={0}
ru: Запрошены двоичные данные для несуществующего временного идентификатора Id={0}

# DBxDocSet_Err_UnknownFileNameId
source: File queried for unknown temporary identifier Id={0}
ru: Запрошен файл для несуществующего временного идентификатора Id={0}

# DBxDocSet_Msg_DocWithType
source: Document '{0}'
ru: Документ '{0}'

# DBxDocSet_Msg_SubDocWithType
source: Subdocument '{0}'
ru: Поддокумент '{0}'

# DBxDocsLockException_Err_Default
source: Cannot set the lock '{0}' because it conflicts with the lock '{1}'
ru: Невозможно установить блокировку '{0}', т.к. она конфликтует с блокировкой '{1}'

# DBxDocsLockException_Err_DocText
source: Cannot get a text representation of the document {0}
ru: Не удалось получить текстовое представление документа. {0}

# DBxDocsLockException_Err_SameUser
source: Cannot set the lock '{0}' because it conflicts with another lock '{1}' set by same user
ru: Невозможно установить блокировку '{0}', т.к. она конфликтует с другой блокировкой '{1}', установленной тем же пользователем

# DBxDocsLock_Msg_IsEmpty
source: (No documents)
ru: (Нет документов)

# DBxDocsLock_Msg_LockAdd
source: (Document creation)
ru: (Добавление документов)

# DBxDocTextHandlers_Arg_NotRefColumn
source: Column '{0}' of table '{1}' is not a reference column
ru: Поле '{0}' таблицы '{1}' не является ссылочным

# DBxDocTextHandlers_Arg_UnknownColumnName
source: Column '{0}' has not been added to required list for text representation for table '{1}'. Acceptable columns are{2}
ru: Поле '{0}' не было добавлено в список требуемых для получения текстового представления таблицы '{1}'. Допустимые поля: {2}

# DBxDocTextHandlers_Err_NoTextForGroupTrese
source: Documents '{0}' does not have any text column. These documents cannot be used as a group tree
ru: У документов '{0}' нет ни одного текстового столбца. Эти документы не образуют дерево групп

# DBxDocTextHandlers_Err_RefTextValue
source: Error. {0}
ru: Ошибка. {0}

# DBxDocTextHandlers_Err_TextValue
source: Id={0}. Error. {1}
ru: Id={0}. Ошибка. {1}

# DBxDocTextHandlers_Err_VTTextValue
source: TableId={0}, DocId={1}. Error. {2}
ru: TableId={0}, DocId={1}. Ошибка. {2}

# DBxDocTextHandlers_Msg_Deleted
source: (deleted)
ru: (удален)

# DBxDocTextHandlers_Msg_DocDeleted
source: (in the deleted document)
ru: (в удаленном документе)

# DBxDocTypes_Arg_UnknownTableName
source: Unknown table name '{0}'. It must be a documemt or subdocument name
ru: Неизвестное имя таблицы '{0}'. Должно быть задано имя документа или поддокумента

# DBxDocTypes_Err_DocTableNameTwice
source: Error in table 'DocTables'. Document name '{0}' presented twice.
ru: Ошибка в таблице 'DocTables'. Повторное вхождение документа '{0}'.

# DBxDocTypes_Err_FindByTableIdBeforeUpdate
source: Search by an identifier TableId can be performed only after database structure is updated. Property DBxDocType.TableId is unknown before update.
ru: Поиск по идентификатору TableId возможен только после обновления структуры базы данных. До этого момента свойство DBxDocType.TableId не определено.

# DBxDocTypes_Err_InvaldidPK
source: Table '{0}' structure has an invalid primary key by '{1}' column, but 'Id' column required
ru: Описание таблицы '{0}' имеет неправильный первичный ключ по полю '{1}', а не 'Id'

# DBxDocTypes_Err_NoCalcCalumn
source: Table '{0}' structure does not contain the calculated column '{1}'
ru: Описание таблицы '{0}' не содержит описания вычисляемого поля '{1}'

# DBxDocTypes_Err_NoRefColumn
source: Column '{0}' of table '{1}' is not a reference column
ru: Столбец '{0}' таблицы '{1}' не является ссылочным

# DBxDocTypes_Err_UnknownUsersDocType
source: Property UsersTableName references to unknown document table '{0}'
ru: Свойство UsersTableName ссылается на несуществующую таблицу документов '{0}'

# DBxDocTypes_Err_VTRefColumnUsed
source: For table '{0}' in the VT-reference '{1}' column '{2}' used that already used in another reference
ru: Для таблицы '{0}' в переменной ссылке '{1}' используется поле '{2}', которое уже используется в другой ссылке

# DBxDocTypes_Msg_SingularTitleDefault
source: Item of '{0}'
ru: Объект '{0}'

# DBxShortDocsLock_Name_Default
source: Writing ro database
ru: Запись в базу данных

# DBxExtRefs_Name_PluralDoc
source: Documents '{0}'
ru: Документы '{0}'

# DBxExtRefs_Name_PluralSubDoc
source: Documents '{0}', subdocuments '{1}'
ru: Документы '{0}', поддокументы '{1}'

# DBxExtRefs_Name_SingularDoc
source: Document '{0}'
ru: Документ '{0}'

# DBxExtRefs_Name_SingularSubDoc
source: Document '{0}', subdocument '{1}'
ru: Документ '{0}', поддокумент '{1}'

# DBxDocPermissions_Err_DocTypeAccessDenied
source: There is no acccess rights {0} to documents of type {1}
ru: Нет права {0} документов '{1}'

# DBxDocProvider_Err_DocInDocSet
source: Document '{0}' with identifier {1} is already in document set
ru: Документ '{0}' с идентификатором {1} уже есть в наборе

# DBxDocProvider_Err_LoadDocRowCount
source: Cannot load all required rows from document table '{0}'. Queried row count: {1}, given: {2}
ru: Не удалось загрузить все затребованные документы '{0}'. Запрошено строк: {1}, получено: {2}

# DBxMultiDocs_Arg_UnknownColumn
source: Column '{0}' does not belong to document '{1}'
ru: Поле '{0}' не принадлежит документу '{1}'

# DBxMultiDocs_Err_DocNotFound
source: Document of type '{0}' with identifier {1} not found
ru: Не найден документ '{0}' с идентификатором {1}

# DBxMultiDocs_Err_IsEmpty
source: There is no open documents of type '{0}'
ru: Нет открытых документов '{0}'

# DBxMultiDocs_Err_IsReadOnly
source: Value editing is not allowed
ru: Редактирование значений не допускается

# DBxMultiDocs_Err_SetDocState
source: Cannot set document '{0}' with DocId={1} to state '{2}' since it's current state is '{3}'
ru: Нельзя перевести документ '{0}' с DocId={1} в состояние '{2}', так как сейчас он находится в состоянии '{3}'

# DBxMultiDocs_Err_StateRequired
source: All docuiments of type '{0}' must be in state {1}
ru: Все документы '{0}' должны находиться в состоянии {1}

# DBxMultiDocs_Err_AccessDenied
source: User has no access rights to documens of type '{0}'
ru: У пользователя нет прав на доступ к документам '{0}'

# DBxMultiDocs_Err_AccessReadOnly
source: User cannot create, modify nor delete documens of type '{0}'
ru: У пользователя нет прав на создание, редактирование и удаление документов '{0}'

# DBxMultiSubDocs_Arg_MergeAlienSubSet
source: Attachin child subset was created from another subdocument set
ru: Присоединяемый дочерний набор не был создан из текущего набора поддокументов

# DBxMultiSubDocs_Arg_MergeSubSetRowState
source: Attempt to append subdocument of type '{0}' row with SubDocId={1}. The row is in state '{2}'
ru: Попытка добавление строки поддокумента '{0}' с SubDocId={1}. Строка поддокумента в состоянии '{2}'

# DBxMultiSubDocs_Err_AccessDenied
source: User has no access rights to subdocumens of type '{0}'
ru: У пользователя нет прав на доступ к поддокументам '{0}'

# DBxMultiSubDocs_Err_AccessReadOnly
source: User cannot create, modify nor delete subdocumens of type '{0}'
ru: У пользователя нет прав на создание, редактирование и удаление поддокументов '{0}'

# DBxMultiSubDocs_Err_InsertDocState
source: Cannot add a subdocument since owner document '{0}' with DocId={1} is in state '{2}'
ru: Нельзя добавить поддокумент, т.к. документ '{0}' с DocId={1} находится в состоянии '{2}'

# DBxMultiSubDocs_Err_InsertMultiDocs
source: Cannot detect the document of type'{0}' which is supposed to be the owner of new subdocument since there are more than one ({1}) document of this type exist in the doc set. Use Insert() method overload with a reference to an owner document
ru: Невозможно определить, для какого документа '{0}' нужно создать поддокумент, т.к. в наборе находится больше одного такого документа ({1}). Используйте перегрузку метода Insert(), принимающую ссылку на документ-владелец

# DBxMultiSubDocs_Err_InsertNoDocuments
source: Cannot create subdocument of type '{0}' since there are no documents of type '{1}' in doc set
ru: Невозможно создать поддокумент '{0}', т.к. в наборе нет документов '{1}'

# DBxMultiSubDocs_Err_IsEmpty
source: There is no open subdocuments of type '{0}'
ru: Нет открытых поддокументов '{0}'

# DBxMultiSubDocs_Err_SetAllState
source: Cannot set all the subdocuments of type '{0}' to state '{1}' since current state is '{2}'
ru: Нельзя перевести все поддокументы '{0}' в режим '{1}', т.к. текущее состояние набора: '{2}'

# DBxMultiSubDoc_Err_ResetTableForSubSet
source: Table reset is not allowed for the subset
ru: Сброс таблицы не разрешается для набора подмножества

# DBxMultiSubDoc_Err_RowNotFound
source: Row for subdocument with identifier {0} not found
ru: Не найдена строка поддокумента с идентификатором {0}

# DBxDocPrivider_Err_DelRefColumnInfo
source: Error when table '{0}' queried. Deleting document/subdocuments are '{1}'. Validable reference column is '{2}'. {3}
ru: Ошибка при запросе таблицы '{0}'. Удаляемые документы/поддокументы: '{1}'. Проверяемое ссылочное поле: '{2}'. {3}

# DBxDocPrivider_Err_IncompleteVTRef
source: In the table '{0}' there are incomplete columns for a variable-table reference '{1}'
ru: В таблице '{0}' присутствуют некомплектные поля для переменной ссылки '{1}'

# DBxDocPrivider_Err_RefIdsNotInDB
source: There are references to table '{0}' for identifiers {1}, which are not in database
ru: Имеются ссылки на таблицу '{0}' для идентификаторов {1}, которых нет в базе данных

# DBxDocPrivider_Err_SetValueDenied
source: Cannot set the column '{0}' value of table '{1}' since there is no rights to change value
ru: Невозможно изменить значения поля '{0}' таблицы '{1}', т.к. нет прав на изменение значения

# DBxDocPrivider_Err_VTRefDisabledDocType
source: In the table '{0}' for variable-table reference '{1}' there is a fictive table id. Column '{2}'={3}, which match the document type '{4}'. These documents are not allowed for this reference. Allowed document types are: {5}
ru: В таблице '{0}' для переменной ссылки '{1}' задан фиктивный идентификатор таблицы. Поле '{2}'={3}. Ему соответствует вид документа '{4}', который нельзя использовать в этой ссылке. Допускаются только таблицы: {5}

# DBxDocPrivider_Err_VTRefFictiveTable
source: In the table '{0}' for variable-table reference '{1}' there is a fictive table id. Column '{2}'={3}
ru: В таблице '{0}' для переменной ссылки '{1}' задан фиктивный идентификатор таблицы. Поле '{2}'={3}
