Repository: a94827/FreeLibSet
Catalog: ExtDBDocs/Res.*.resx
Languages: ru

# DBxDocPrivider_Err_VTRefIncompleteIds
source: In the table '{0}' for variable-table reference '{1}' there are incomplete identifiers. Column '{2}'={3}, and column '{4}'={5}.
ru: В таблице '{0}' для переменной ссылки '{1}' заданы некомплектные идентификаторы. Поле '{2}'={3}, а поле '{4}'={5}.

# DBxDocPrivider_Err_VTRefUnknownDocId
source: In the table '{0}' for variable-table reference '{1}' there is a fictive document id. Column '{2}'={3}, which not found in table '{4}'
ru: В таблице '{0}' для переменной ссылки '{1}' задан фиктивный идентификатор документа. Поле '{2}'={3}, для которого не была найдена запись в таблице {4}

# DBxDocPrivider_Err_VTRefUnknownDocType
source: In the table '{0}' for variable-table reference '{1}' there is a fictive table id. Column '{2}'={3}, which does not match any document type
ru: В таблице '{0}' для переменной ссылки '{1}' задан фиктивный идентификатор таблицы. Поле '{2}'={3}, которому не соответствует никакой вид документа

# DBxDocPrivider_Err_WrongFictiveRefId
source: In the table '{0}' for reference column '{1}' there is a fictive identifier {2}, which has no record in docset
ru: В таблице '{0}' для ссылочного поля '{1}' задан фиктивный идентификатор {2}, для которого не была найдена запись в наборе данных

# DBxDocProvider_Arg_SubDocIdForDoc
source: Non-zero subdocument identifier given while table '{0}' is a document
ru: Задан ненулевой идентификатор поддокумента, хотя таблица '{0}' является документом

# DBxDocProvider_Arg_UnknownTable
source: Unknown table '{0}'
ru: Неизвестная таблица '{0}'

# DBxDocProvider_Arg_UserIdNoUsers
source: UserId cannot be set since DBxDocTypes.UseUsers=false
ru: UserId не может быть задан, т.к. DBxDocTypes.UseUsers=false

# DBxDocProvider_Arg_WrongTableCount
source: Data set contains different number of tables: '{0}'. Expected: '{1}'
ru: Набор данных имеет другое количество таблиц: '{0}'. Ожидалось: '{1}'

# DBxDocProvider_Err_NoBinDataHandler
source: DBxBinDataHandler object not set
ru: Обработчик двоичных данных DBxBinDataHandler не установлен

# DBxDocProvider_Msg_ActionInfoDelete
source: Removing
ru: Удаление

# DBxDocProvider_Msg_ActionInfoEdit
source: Changing
ru: Изменение

# DBxDocProvider_Msg_ActionInfoEmpty
source: No action
ru: Нет действий

# DBxDocProvider_Msg_ActionInfoInsert
source: Creation
ru: Создание

# DBxDocProvider_Msg_ActionInfoMixed
source: Processing
ru: Обработка

# DBxDocProvider_Msg_ActionInfoMultiDocs
source: {0} docs '{1}' ({2})
ru: {0} д-тов '{1}' ({2})

# DBxDocProvider_Msg_ActionInfoSingleDoc
source: {0} of doc '{1}'
ru: {0} д-та '{1}'

# DBxExtRefs_Err_RefToUnknownTable
source: Table '{0}' declaration contains a reference column '{1}' definition, which refers to unknown table '{2}'
ru: Объявление таблицы '{0}' содержит описание ссылочного поля '{1}', которое ссылается на неизвестную таблицу '{2}'

# DBxDocProvider_Err_DelMulti
source: Cannot delete {0} because one of it is referenced by {1}
ru: Нельзя удалить {0}, потому что на один из них есть ссылка из: {1}

# DBxDocProvider_Err_DelSingle
source: Cannot delete {0} because it referenced by {1}
ru: Нельзя удалить {0}, потому что на него есть ссылка из: {1}

# DBxDocProvider_Msg_MultiDocs
source: documents {0}
ru: документы {0}

# DBxDocProvider_Msg_MultiSubDocs
source: subdocuments {0} of document {1}
ru: поддокументы {0} документа {1}

# DBxDocProvider_Msg_SingleDoc
source: document {0}
ru: документ {0}

# DBxDocProvider_Msg_SingleSubDoc
source: subdocument {0} of document {0}
ru: подокумент {0} документа {0}

# DBxDocProvider_Arg_ActionId
source: Invalid user action identifier ActionId={0}
ru: Недопустимый идентификатор действия пользователя ActionId={0}

# DBxDocProvider_Arg_UnknownSubDocType
source: Unknown subdocument type '{0}'
ru: Неизвестный вид поддокумента '{0}'

# DBxDocProvider_Err_ViewOtherUsersAction
source: Viewing other users actions is not allowed
ru: Запрещен доступ на просмотр действий, выполненных другими пользователями

# DBxDocProvider_Msg_NewDocSubDoc
source: [ New ]
ru: [ Новый ]

# DBxDocProvider_NoSingleDocType
source: Identifier of the single document to search refeneces, cannot be given wihout the docuemnt type
ru: Идентификатор единственного документа, ссылки в котором ищутся, не может задаваться без вида документов

# DBxDocProvider_Phase_DocumentRecalc
source: Document recalculating '{0}' ({1} doc(s).)
ru: Пересчет документов '{0}' ({1} шт.)

# DBxDocStructSource_Err_AccessDenied
source: Table '{0}' access denied
ru: Доступ к таблице '{0}' запрещен

# DBxRealDocProviderGlobal_Arg_BinDataHandlerIsNull
source: Since binary data used in DocTypes, value of BinDataHandler argument must be given
ru: Так как в DocTypes задано использование ссылок на двоичные данные, аргумент BinDataHandler должен быть задан

# DBxRealDocProviderGlobal_Arg_CannotUseHistory
source: History usage is not possible if property {0}={1}
ru: Ведение истории невозможно, если свойство {0}={1}

# DBxRealDocProviderGlobal_Arg_CannotUseSessionId
source: Property DBxDocTypes.UseSessionId cannot be set if the history is not used
ru: Нельзя устанавливать свойство DBxDocTypes.UseSessionId, если история документов не ведется

# DBxRealDocProviderSource_Err_GetTextValue
source: Id={0}. Error. {1}
ru: Id={0}. Ошибка. {1}

# DBxRealDocProviderSource_Name_Default
source: [ No name ]
ru: [ Без имени ]

# DBxSingleDoc_Err_DelSubDoc
source: Cannot delete a subdocument since it belongs to the docuement {0}. Document should be in state Edit or Insert
ru: Нельзя удалять поддокумент, относящийся к документу {0}. Документ должен быть в состоянии Edit или Insert

# DBxSingleSubDocs_Arg_SubDocDiffDoc
source: Subdocument of type '{0}' with SubDocId={1} belongs to document of type '{2}' with DocId={3}, but DocId={4} expected
ru: Поддокумент '{0}' c SubDocId={1} относится к документу '{2}' с DocId={3}, а не {4}

# DBxSingleSubDocs_Err_RowDetached
source: Cannot get access to subdocument with index {0} since its data row has been removed from the subdocument table (RowState=Detached)
ru: Нельзя получить доступ к поддокументу с индексом {0}, так как строка для него была удалена из таблицы поддокументов (RowState=Detached)

# DBxSubDoc_Arg_WrongState
source: Subdocument must be in state {0}, but actually it's in state {1}
ru: Поддокумент должен находиться в состоянии {0}, а не {1}

# RecalcColumnsPermissionMode_Err_Disabled
source: Calcuated column re-evaluating is not allowed
ru: Запрещен пересчет вычисляемых полей

# RecalcColumnsPermissionMode_Err_Selected
source: Calcuated column re-evaluating is not allowed if there are no document identifiers given
ru: Запрещен пересчет вычисляемых полей, если не указаны идентификаторы конкретных документов

# UndoAction_Msg_Base
source: Original state
ru: Начальное состояние

# Allowed_Msg_False
source: Disabled
ru: Запрещен

# Allowed_Msg_True
source: Allowed
ru: Разрешен

# DBxDocProvider_ErrTitle_AddFakeUserAction
source: Error occurred when adding fake record to table 'UserActions'
ru: Ошибка добавления фиктивной записи в таблицу 'UserActions'

# DBxDocProvider_Err_AddFakeUserAction
source: For document of type '{0}' with DocId={1} cannot get curret values of user id and time from main document table.
ru: Для документа '{0}' с DocId={1} не удалось извлечь текущие значения пользователя/времени из основной таблицы документов

# DBxDocProvider_Err_DocActionLimitExceeded
source: Cannot created next version for document '{0}' with DocId={1} because it exceed maximum possible value {2}
ru: Невозможно задать следующую версию документа '{0}' с DocId={1}, так как. она превышает максимальное значение {2}

# DBxDocProvider_Err_VersionMismatch
source: For document of type '{0}' with DocId={1} vesrion mismatch detected. In main document table it is ({2}), but in table 'DocActions' it is ({3}). Version vill be updated in main dicument table
ru: Для документа '{0}' с DocId={1} обнаружено несоответствие версии в основной таблице документов ({2}) и в таблице 'DocActions' ({3}). В основной таблице документов будет скорректирована версия

# DBxDocProvider_Msg_ActionAutoRecover
source: [ State auto recover from version {0} ]
ru: [ Автоматическое восстановление состояния с версии {0} ]

# DBxVTReference_Arg_ColumnIsRef
source: Columns '{0}' must not be a reference column
ru: Столбец '{0}' не должен быть ссылочным

# DBxVTReference_Arg_ColumnNoInt
source: Column '{0}' must be integer
ru: Столбец '{0}' должен быть целочисленным

# DBxVTReference_Arg_NoColumn
source: Table '{0}' does not contain column '{1}'
ru: Таблица '{0}' не содержит столбца '{1}'

# DBxVTReference_Arg_NullableDiff
source: Nullable attribute must be same
ru: Признак Nullable у столбцов должен быть одинаковым

# DocTypePermission_Arg_NoDocTypes
source: At least one document type must be given
ru: Должен быть хотя бы один тип документов

# DocTypePermission_Msg_AllDocTypes
source: All the documents
ru: Все документы

# DocTypePermission_Msg_ObjectText
source: Documents {0}
ru: Документы {0}

# DocTypePermission_Msg_ObjectTextNoDocTypes
source: Document type list is not set
ru: Список видов документов не задан

# DocTypeViewHistoryPermission_Msg_ObjectText
source: History view for {0}
ru: Просмотр истории - {0}

# RecalcColumnsPermissionMode_Msg_All
source: All
ru: Все существующие

# RecalcColumnsPermissionMode_Msg_Disabled
source: Disabled
ru: Запрещен

# RecalcColumnsPermissionMode_Msg_Selected
source: Selected in data view
ru: Выбранные в просмотре

# RecalcColumnsPermission_Msg_ObjectText
source: Calculated column re
ru: Calculated columns re-evaluating

# RefDocCommonFilterSet_Arg_GroupIdColumnIsNotRef
source: Wrong declaration of document type '{0}'. Column '{1}' is not a reference column.
ru: Неправильное описание вида документа '{0}'. Поле '{1}' не является ссылочным.

# RefDocCommonFilterSet_Arg_NoGroupIdColumn
source: Wrong declaration of document type '{0}'. There is no column '{1}'
ru: Неправильное описание вида документа '{0}'. Нет поля '{1}'

# RefDocCommonFilterSet_Err_UnknownMasterTable
source: Documents for master table '{0}' not found
ru: Не найдены документы для мастер-таблицы '{0}'

# RefGroupDocCommonFilter_Arg_NoTreeParentColumnName
source: For document type '{0}' the property TreeParentColumnName. is not set. Then these documents cannot produce a group tree.
ru: Для документов '{0}' не установлено свойство TreeParentColumnName. Следовательно, эти документы не могут быть деревом групп.

# ViewOtherUsersActionPermission_Msg_ObjectText
source: View actions of other users
ru: Просмотр действий других пользователей

# UndoAction_Msg_Delete
source: Deletion
ru: Удаление

# UndoAction_Msg_Edit
source: Change
ru: Изменение

# UndoAction_Msg_Insert
source: Creation
ru: Создание

# UndoAction_Msg_Redo
source: Redo
ru: Повтор

# UndoAction_Msg_Undo
source: Undo
ru: Откат

# UndoAction_Msg_Unknown
source: Unknown action {0}
ru: Неизвестное действие {0}

# DBxDocTypes_Arg_UnknownTableId
source: Unknown document table identifier {0}
ru: Неизвестный идентификатор таблицы документов {0}

# DBxDocTypes_Arg_ZeroTableId
source: Document table identifier cannot be 0
ru: Идентификатор таблицы документов не может быть равен 0

# DBxDocSet_Msg_MultiDocsOfType
source: {0} documents of type '{1}'
ru: {0} документ(а)(ов) '{1}'

# DBxDocSet_Msg_SingleDocOfType
source: 1 document of type '{0}'
ru: 1 документ '{0}'
