Repository: a94827/FreeLibSet
Catalog: ExtForms/Dialogs/EFPTextSearchForm.*.resx
Languages: ru

# grpFrom.Text
source: From where tu start
ru: Откуда начать

# rbFromCurr.Text
source: At the current &row
ru: С тек&ущей строки

# rbFromStart.Text
source: &At the start or end
ru: &С начала / с конца

# grpWhere.Text
source: Where
ru: Где искать

# rbCurrCol.Text
source: In c&urrent column only
ru: В текущем стол&бце

# rbAllCols.Text
source: In &all columns
ru: Во &всех столбцах

# grpDirection.Text
source: Direction
ru: Направление поиска

# rbBackward.Text
source: &Backward
ru: На&зад

# rbForward.Text
source: &Forward
ru: Вп&еред

# grpConditions.Text
source: Conditions
ru: Условия поиска

# cbWhole.Text
source: &Whole string
ru: Строка &целиком

# cbSimilarCharsDiff.Text
source: &Distinguish similar letters
ru: Отличать похо&жие буквы

# cbCaseSens.Text
source: &Case sensitive
ru: С учетом &регистра

# lblText.Text
source: &Text to search
ru: Искать &текст

# $this.Text
source: Text search
ru: Поиск текста
