Repository: a94827/FreeLibSet
Catalog: ExtForms/Res.*.resx
Languages: ru

# Btn_Text_Abort
source: &Abort
ru: Пр&ервать

# Btn_Text_Cancel
source: Cancel
ru: Отмена

# Btn_Text_Ignore
source: &Ignore
ru: &Пропустить

# Btn_Text_No
source: &No
ru: &Нет

# Btn_Text_OK
source: O&K
ru: О&К

# Btn_Text_Retry
source: &Retry
ru: По&втор

# Btn_Text_Yes
source: &Yes
ru: &Да

# CodeGridFilterForm_Err_NoCodes
source: Codes should be selected
ru: Коды должны быть выбраны

# CodeGridFilterForm_ToolTip_Codes
source: List of codes, separated with the comma char
ru: Список кодов, разделенных запятыми

# CodeGridFilterForm_ToolTip_Empty
source: In the mode 'Include codes the rows with empty field value will pass this filter. In the mode "Exclude codes" the rows with empty values will be rejected
ru: В режиме 'Включить коды' - включить в фильтр строки, в которых поле не установлено. В режиме 'Исключить коды - убрать строки с пустым значением поля

# CodesGridFilter_Msg_Empty
source: [ Empty ]
ru: [ Нет ]

# CodesGridFilter_Msg_ExcludePrefix
source: Except:
ru: Кроме:

# ColorComboBox_Arg_SystemColorNotSupported
source: System colors are bot supported
ru: Системные цвета не поддерживаются

# ColorComboBox_Msg_NotInPopupColorsListItem
source: Out of range
ru: Вне диапазона

# ColorComboBox_Msg_SelectWithDialogListItem
source: Choose...
ru: Выбрать...

# DateRangeBox_Err_DatesNotEnabled
source: To change period, both of dates must be enabled
ru: Для изменения интервала необходимо, чтобы обе даты были доступны

# DateRangeBox_Err_DatesNotFilled
source: To change period, both of dates must be filled
ru: Для изменения интервала необходимо, чтобы обе даты были заполнены

# DateRangeBox_ToolTip_Menu
source: Menu with predefined periods
ru: Меню готовых интервалов дат

# DateRangeBox_ToolTip_Next
source: Next period like this
ru: Следующий такой же интервал

# DateRangeBox_ToolTip_Prev
source: Previous period like this
ru: Предыдущий такой же интервал

# DateRangeInclusionGridFilter_Msg_WorkDate
source: Current date
ru: Текущая дата

# DBxGridFilters_ErrTitle_ReadConfig
source: Error reading filter '{0}' state
ru: Ошибка загрузки состояния фильтра '{0}'

# EFPTwoListSelector_Err_CannotBeEmpy
source: List cannot be empty
ru: Список не может быть пустым

# EFPTwoListSelector_Err_NothingAvailable
source: There is no avaliable item in the list
ru: Нет элементов в списке доступных

# EFPTwoListSelector_Err_NothingSelected
source: There is no selected item in the list
ru: Нет элементов в списке выбранных

# EFPTwoListSelector_Text_Add
source: Add
ru: Добавить

# EFPTwoListSelector_Text_Remove
source: Remove
ru: Удалить

# MonthDayBox_Arg_DayOutOfRange
source: Invalid day {0}. Value must be in range from 1 to {1} while Month is {2}
ru: Неправильный день {0}. Значение должно быть в диапазоне от 1 до {1} для месяца {2}

# ParamSetComboBox_Err_NameIsEmpty
source: Preset name cannot be empty
ru: Не задано название для набора

# ParamSetComboBox_Err_UnknownName
source: There is no preset with given name. Select a preset from the drop-down list
ru: Нет такой строки в списке. Выберите набор из выпадающего списка

# BoolValueGridFilter_Err_NoText
source: Properties FilterTextTrue and FilterTextFalse cannot be cleared at the same time
ru: Одновременная очистка свойств FilterTextTrue и FilterTextFalse не допускается

# BoolValueGridFilter_Msg_FilterTextFalse
source: Value is false
ru: Значение сброшено

# BoolValueGridFilter_Msg_FilterTextTrue
source: Value is true
ru: Значение установлено

# DateRangeDialog_Msg_Prompt
source: Range
ru: Диапазон

# DateRangeDialog_Msg_Title
source: Date range input
ru: Ввод диапазона дат

# DebugTools_ErrTitle_AppInfo
source: Application debug info
ru: Отладочная информация о программе

# DebugTools_Phase_AppInfo
source: Garhering info about the application
ru: Сбор информации о программе

# ExtValueControl_Name_GroupCheckBox
source: Group editing mark
ru: Флажок группового редактирования

# ExtValueControl_ToolTip_GroupCheckBox
source: Turn the check box on to set the same column '{0}' value for all the edited records
ru: Включите флажок, чтобы установить одинаковое значение поля '{0}' для всех редактируемых записей

# GridFilter_Err_NotEditable
source: You cannot edit this filter
ru: Редактирование этого фильтра невозможно

# GridFilter_Err_WrongValue
source: Error Value {0} is not appliable to thos filter
ru: Ошибка. Значение {0} недопустимо для этого фильтра

# GridFilter_Msg_EmptyValueText
source: [ Empty ]
ru: [ нет ]

# GridFilter_Msg_ListTitle
source: Filter value
ru: Значение фильтра

# GridFilter_Msg_ManualInputPromptWithEmptyIfNoFilter
source: Filter value (empty if no filter)
ru: Значение фильтра (пусто-нет фильтра)

# GridFilter_Msg_NoFilterMode
source: No filter
ru: Нет фильтра

# NullNotNullGridFilter_MsgNotNull
source: NOT NULL
ru: Значение установлено

# NullNotNullGridFilter_MsgNull
source: NULL
ru: Значение не установлено

# ShowExceptionForm_ErrTitle_CannotOpenReportDir
source: Cannot open the directory with report files
ru: Не удалось открыть каталог с отчетами

# ShowExceptionForm_ErrTitle_CopyError
source: Copying report text to clipboard error
ru: Ошибка копирования отчета в буфер обмена

# ShowExceptionForm_ErrTitle_DataDebugError
source: Data object debug error
ru: Ошибка просмотра объекта данных

# ShowExceptionForm_ErrTitle_ExecError
source: Error starting {0}
ru: Ошибка запуска {0}

# ShowExceptionForm_ErrTitle_ViewError
source: Cannot open report file for view
ru: Не удалось открыть файл отчета на просмотр

# ShowExceptionForm_Menu_Copy
source: Copy
ru: Копировать

# ShowExceptionForm_Menu_View
source: Internal view
ru: Встроенный просмотр

# ShowExceptionForm_Msg_NoStackTrace
source: Stack trace is not available
ru: Стек вызовов недоступен

# ShowExceptionForm_Msg_StackTraceError
source: Stack trace extracting error
ru: Не удалось получить стек вызовов

# ShowExceptionForm_Msg_Stopped
source: Showing the debug dialog is stopped, but the errors are not vanished. Close application as soon as possible
ru: Вывод сообщений об ошибках отключен. Завершите работу программы как можно быстрее

# ShowExceptionForm_Title_Stopped
source: Error debug stopped
ru: Отключение вывода сообщений

# StringValueGridFilter_ErrTitle_AllValuesNeeded
source: Error collecting row list for the filter '{0}'
ru: Ошибка получения списка строк для фильтра '{0}'

# StringValueGridFilter_Err_NoManual
source: Manual value input is not appliable
ru: Ручной ввод значения фильтра не предусмотрен

# StringValueGridFilter_Msg_Manual
source: Set manually ...
ru: Задать вручную ...

# StringValueGridFilter_Msg_NoFilter
source: [ No filter ]
ru: [ Нет фильтра ]

# Btn_Text_Close
source: Close
ru: Закрыть

# Cmd_Menu_Debug_Changes
source: Debug changes
ru: Отладка изменений

# Cmd_Menu_Debug_Form
source: Debug form
ru: Отладка формы

# ExtEditDialogForm_ErrTitle_Writing
source: Data writing error
ru: Ошибка записи данных редактора

# ExtEditDialogForm_Err_InvalidState
source: Invalid form state: {0}
ru: Неподходящее состояние формы: {0}

# ExtEditDialogForm_Err_WriteDataCall
source: Calling the method WriteData() is not allowed from the button click handlers
ru: Вызов WriteData() не допускается из обработчиков кнопок

# ExtEditDialogForm_Err_WritingInProgress
source: Previous writing is still in progress
ru: Предыдущая запись документа еще не закончена

# ExtEditDialogForm_Msg_CancelWarning
source: Data in editor '{0}' has been changed. Do you really want to exit and lost the changes?
ru: Данные в редакторе '{0}' были изменены. Вы действительно хотите выйти и потерять изменения?

# ExtEditDialogForm_Name_ChangedInfoList
source: Editor form
ru: Форма редактора

# ExtEditDialogForm_Title_CancelWarning
source: Exit without saving
ru: Выход без сохранения изменений

# ExtEditPage_Name_ChangedInfoList
source: Page '{0}'
ru: Страница '{0}'

# HistFileBrowserDialog_Msg_Overwrite
source: File '{0}' already exists. Overwrite it?"
ru: Файл '{0}' уже существует. Перезаписать его?"

# HistFileBrowserDialog_Prompt_MainGroup
source: File
ru: Файл

# HistFileBrowserDialog_Prompt_Path
source: Path to file
ru: Путь к файлу

# HistFileBrowserDialog_Title_Form
source: File selection
ru: Выбор файла

# HistFileBrowserDialog_Title_Overwrite
source: Confirmation
ru: Подтверждение

# HistFileBrowserDialog_ToolTip_MainCB
source: File path text box. Use drop-down list to choose one of previously selected path. Use 'Browse' button to select path with the system dialog box.
ru: Поле ввода файла. Чтобы выбрать ранее использованный путь, используйте выпадающий список. Чтобы выбрать файл с помощью стандартного диалога, нажмите кнопку 'Обзор'

# HistFolderBrowserDialog_Err_CreateDir
source: Folder creation failed. {0}
ru: Не удалось создать каталог. {0}

# HistFolderBrowserDialog_Prompt_MainGroup
source: Directory
ru: Каталог

# HistFolderBrowserDialog_Prompt_Path
source: Path to directory
ru: Путь

# HistFolderBrowserDialog_Title_Form
source: Folder selection
ru: Выбор папки

# HistFolderBrowserDialog_ToolTip_MainCB
source: Directory path text box. Use drop-down list to choose one of previously selected path. Use 'Browse' button to select path with the system dialog box.
ru: Поле ввода каталога. Чтобы выбрать ранее использованный путь, используйте выпадающий список. Чтобы выбрать каталог с помощью стандартного диалога, нажмите кнопку 'Обзор'

# HistFolderBrowserDialog_ToolTip_SubFolders
source: If the check box is set, the nested directories will be also viewed
ru: Если флажок установлен, то будут просмотрены также все вложенные каталоги

# TextSearchForm_Text_AtEnd
source: &At the end
ru: &С конца

# TextSearchForm_Text_AtStart
source: &At the start
ru: &С начала

# TextSearchForm_ToolTip_CaseSens
source: If flag is set, the letter case has matter. Otherwise case ignored.
ru: Если флажок установлен, то регистр букв имеет значение, иначе заглавные и строчные буквы (например, 'А' и 'а') не различаются

# TextSearchForm_ToolTip_Direction
source: Direction for the row enumeration: toward to end or beginning
ru: Направление перебора строк - к концу или к началу

# TextSearchForm_ToolTip_From
source: Defines the table part to search in. It could be a half or the whole table
ru: Определяет область для поиска: все строки или часть от текущей позиции до конца (или до начала таблицы)

# TextSearchForm_ToolTip_SimilarCharsDiff
source: If flag is set, the similar letter supposed to be different. Otherwise the cyrillic letter 'А' and latin 'A' are different
ru: Если флажок установлен, то похожие символы кириллицы и латиницы различаются, иначе, например, русская буква 'А' и латинская 'A' считаются совпадающими

# TextSearchForm_ToolTip_Text
source: Text which should be found
ru: Текст, который нужно найти

# TextSearchForm_ToolTip_Where
source: Searching in all columns is slower for a large table. Use the current-column mode if you know in which column text could be found. Select the required current column before.
ru: Поиск по всем столбцам занимает больше времени. Используйте поиск в текущем столбце, если Вы знаете, где расположен текст. Перед выбором этого режима в табличном просмотре должен быть выбран нужный столбец

# TextSearchForm_ToolTip_Whole
source: If flag is set, cells will be found if the context is equal the text to search. Otherwise if's enough to find the cell context contains the text as a part.
ru: Если флажок установлен, то будут найдены только ячейки, содержимое которых точно совпадает с введенным текстом. Иначе достаточно найти вхождение введенного текста в любое место текста ячейки

# TextSearch_Err_NoColumns
source: Data view doesn't contain columns
ru: Табличный просмотр не содержит столбцов

# TextSearch_Err_NoCurrentRow
source: Cannot continue to search because there is no current row
ru: Невозможно продолжить поиск, т.к. нет текущей строки

# TextSearch_Err_NoRows
source: Data view doesn't contain rows
ru: Просмотр не содержит строк

# TextSearch_Err_NoText
source: View has no text
ru: Просмотр не содержит текста

# TextSearch_Err_NotFound
source: Text '{0}' has not been found
ru: Строка '{0}' не найдена

# TextSearch_Err_NotStarted
source: Searching has not been started
ru: Поиск не был начат

# TextSearch_Phase_Search
source: Text search
ru: Поиск текста

# TextSearch_Phase_SearchAllRows
source: Search all rows
ru: Поиск всех строк

# TextSearch_Title_Result
source: Search results
ru: Поиск текста

# Btn_Name_Copy
source: Copy
ru: Копировать

# Btn_Name_Paste
source: Paste
ru: Вставить

# Clipboard_Err_Empty
source: Clipboard is empty
ru: Буфер обмена пуст

# FileCopier_Err_CheckBytes
source: File copying error. Destination file contents is different
ru: Ошибка при копировании файла. Файл записался неправильно

# FileCopier_Err_CheckDiskFail
source: File '{0}' validation failed. {1}
ru: Ошибка при проверке файла '{0}'. {1}

# FileCopier_Err_CheckLen
source: Source file has length {0}, but written file has {1}
ru: Исходный файл имеет длину {0}, а записанный - {1}

# FileCopier_Msg_Cancel
source: Cancel operation?
ru: Прервать операцию?

# FileCopier_Msg_CheckDisk
source: To validate {0} written file(s), extract the floppy disk and put it back againобратно
ru: Для проверки {0} записанного файла(ов) извлеките дискету {1} и вставьте ее обратно

# FileCopier_Msg_ClearDialogDelete
source: Delete all files ({0}) and directories ({1})
ru: Удалить все файлы ({0}) и каталоги ({1})

# FileCopier_Msg_ClearDialogExplorer
source: Run Windows Explorer
ru: Запустить проводник Windows

# FileCopier_Msg_ConfirmDelele
source: All exist files and directories on the drive {0} will be UNRECOVERABLE DELETED. Confirm your intension to clear the disk
ru: Сейчас все сушествующие файлы и каталоги на диске {0} будут необратимо УНИЧТОЖЕНЫ. Подтвердите Ваше намерение очистить диск

# FileCopier_Msg_SizeAsDir
source: Directory
ru: Каталог

# FileCopier_Msg_SizeAsFileAttr
source: Attributes
ru: Атрибуты

# FileCopier_Phase_ClearDisk
source: Disk {0} cleaning
ru: Очистка диска {0}

# FileCopier_Phase_Copy
source: File copying
ru: Копирование файлов

# FileCopier_Phase_DeleteDir
source: Deleting directory '{0}'
ru: Удаление каталога '{0}'

# FileCopier_Phase_DeleteFile
source: Deleting file '{0}'
ru: Удаление файла '{0}'

# FileCopier_Phase_Prepare
source: Preparing to copy
ru: Подготовка к копированию

# FileCopier_Title_Cancel
source: Confirmation
ru: Подтверждение

# FileCopier_Title_CheckDisk
source: Write validation
ru: Проверка записи

# FileCopier_Title_ClearDialog
source: Clear drive {0}
ru: Очистка диска {0}

# FileCopier_Title_ClearDialogGroupTitle
source: What to do
ru: Что сделать

# FileCopier_Title_ConfirmDelele
source: Confirmation
ru: Подтверждение

# FileCopier_Title_FreeSpaceDetectionError
source: Error while free space detection on drive {0}
ru: Ошибка при определении свободного места на диске {0}

# GridConfig_Err_ClipboardNoData
source: Clipboard doesn't contain data for any data view settings
ru: Буфер обмена не содержит настроек табличного просмотра

# GridConfig_Err_NoDefaults
source: Default settings are not defined
ru: Настройка по умолчанию не определена

# GridConfig_Msg_Default
source: Defauls
ru: По умолчанию

# GridConfig_Title_SelDefaults
source: Select default settings
ru: Выбор настройки по умолчанию

# GridConfig_ToolTip_Copy
source: Copy current settings from this dialog to the clipboard
ru: Копирует текущие настройки, заданные в этом окне, в буфер обмена

# GridConfig_ToolTip_Default
source: Reset column settings and tooltip to their original state
ru: Сброс настроек столбцов и подсказок в исходное состояние

# GridConfig_ToolTip_Paste
source: Replaces current setiings in this dialog to another from the clipboard. If settings were copied from another grid view, the only compatible settins will be pasted
ru: Заменяет текущие настройки просмотра, ранее скопированными в буфер обмена. Если настройки были скопированы для другого просмотра, то будут вставлены только совместимые настройки

# Clipboard_ErrTitle_PasteFilters
source: Error pasting filter '{0}' from the clipboard
ru: Ошибка вставки фильтра '{0}' из буфера обмена

# Clipboard_Err_FiltersDiffDB
source: Filter in clipboard belongs the different database
ru: Фильтры в буфере обмена относятся к другой базе данных

# Clipboard_Err_NoFilters
source: There are no filters in the clipboard
ru: Буфер обмена не содержит фильтров табличного просмотра

# Clipboard_Err_OtherFilters
source: Filters in clipboard are different
ru: Фильтры в буфере обмена отсутствуют в списке возможных фильтров

# Cmd_Menu_Edit_Copy
source: &Copy
ru: &Копировать

# Cmd_Menu_Edit_Cut
source: Cu&t
ru: &Вырезать

# Cmd_Menu_Edit_Paste
source: &Paste
ru: Вст&авить

# EFPGridFilterEditorGridView_ColTitle_DisplayName
source: Filter
ru: Фильтр

# EFPGridFilterEditorGridView_ColTitle_FilterText
source: Value
ru: Значение

# EFPGridFilterEditorGridView_Menu_ClearAllFilters
source: Clear all filters
ru: Очистить все фильтры

# EFPGridFilterEditorGridView_Menu_ViewFiltersXML
source: View filters as XML
ru: Просмотр фильтров в XML

# EFPGridFilterEditorGridView_Msg_NoFilters
source: Filters are not set
ru: Фильтры не установлены

# EFPGridFilterEditorGridView_Name_Default
source: {0} - Filter set
ru: {0} - Установка фильтров

# EFPGridFilterEditorGridView_Name_PasteFormat
source: Filters
ru: Фильтры

# EFPGridFilterEditorGridView_ToolTip_Copy
source: Copy all filters from this dialog to the clipboard
ru: Копирует все фильтры, заданные в этом окне, в буфер обмена

# EFPGridFilterEditorGridView_ToolTip_Paste
source: Replaces current filtres with previously copied to clipboard. If filters were copied from another view, the only same filters will be replaced. All remainded filters will be clean.
ru: Заменяет текущие фильтры, ранее скопированными в буфер обмена. Если фильтры были скопированы для другого просмотра, то будут вставлены только совместимые фильтры, а остальные - очищены

# Btn_Text_More
source: &More
ru: Ещ&ё

# Btn_ToolTip_More
source: Auxilirialy command items
ru: Дополнительные команды меню

# DateTimeInputDialog_Msg_Prompt
source: Value
ru: Значение

# DateTimeInputDialog_Msg_TitleDate
source: Date input
ru: Ввод даты

# DateTimeInputDialog_Msg_TitleDateTime
source: Date and time input
ru: Ввод даты и времени

# DateTimeInputDialog_Msg_TitleTime
source: Time input
ru: Ввод времени

# ListSelectDialog_ColTitle_Sub
source: Value
ru: Значение

# ListSelectDialog_Err_ItemNotFound
source: Item '{0}' not found
ru: Не найден элемент '{0}'

# ListSelectDialog_Err_NoChanges
source: Nothing has been changed
ru: Нет изменений

# ListSelectDialog_Err_NoneChecked
source: There must be at least one checked item
ru: Должна быть выбрана хотя бы одна позиция

# ListSelectDialog_Err_NoSelection
source: There is no selected item
ru: Нет выбранной строки

# ListSelectDialog_Err_PasteTextWithCommas
source: Text in the clipboard contains commas while the only one item in the list can be selected
ru: В буфере обмена текст содержит запятые, но в списке можно выбрать только одну строку

# ListSelectDialog_Msg_PasteAdd
source: Add to already checked items
ru: Добавить к уже отмеченным позициям

# ListSelectDialog_Msg_PasteReplace
source: Replace current checked items
ru: Заменить существующее выделение

# ListSelectDialog_ToolTip_Copy
source: Copy text from selected items to the clipboard
ru: Копирует в буфер обмена выбранные позиции списка

# ListSelectDialog_ToolTip_Paste
source: Set checkmarks for the items according to the text lines in the clipboard
ru: Установить отметки в соответствии с текстом в буфере обмена

# NumInputDialog_Msg_Prompt
source: Value
ru: Значение

# NumInputDialog_Msg_Title
source: Number input
ru: Ввод числа

# PasswordInputDialog_Msg_Prompt
source: Password
ru: Пароль

# PasswordInputDialog_Msg_Title
source: Password input
ru: Ввод пароля

# TextInputDialog_Msg_Prompt
source: Value
ru: Значение

# TextInputDialog_Msg_Title
source: Text input
ru: Ввод текста

# ListSelectDialog_Err_NoItems
source: There is no item to select
ru: Нет элементов для выбора

# ListSelectDialog_Msg_TitleMultiSelect
source: Selection from the list
ru: Выбор из списка

# ListSelectDialog_Msg_TitleSingleSelect
source: Selection from the list
ru: Выбор из списка

# NumRangeInputDialog_Err_Inverted
source: Minimum value is greater than maximum value
ru: Минимальное значение больше максимального

# NumRangeInputDialog_Msg_Prompt
source: Range
ru: Диапазон

# NumRangeInputDialog_Msg_RangeIsEmpty
source: Range is not set
ru: Диапазон не задан

# NumRangeInputDialog_Msg_Title
source: Number range input
ru: Ввод диапазона чисел

# NumRangeInputDialog_Name_2eq1
source: Maximum = Minimum
ru: Максимальное значение равно минимальному

# NumRangeInputDialog_ToolTip_2eq1
source: Assigns the 'Maximum' field value from the field 'Minimum'
ru: Присваивает полю 'Максимум' значение из поля 'Минимум'

# InputDataGridDialog_Msg_Title
source: Table
ru: Таблица

# ParamSetComboBox_Name_DelButton
source: Remove preset
ru: Удалить набор

# ParamSetComboBox_Name_SaveButton
source: Save preset
ru: Сохранить набор

# ParamSetComboBox_ToolTip_DelButton
source: Remove user preset with the given name
ru: Удалить пользовательский набор значений, имя которого задано в списке слева

# ParamSetComboBox_ToolTip_SaveButton
source: Save cuurent values as a new user preset. You must input the name of preset before pressing the button.
ru: Сохранить установленные значения как новый пользовательский набор Перед нажатием кнопки в поле слева должно быть введено имя набора

# SelectCompositionForm_ErrTitle_SetImage
source: Image set failed. {0}
ru: Не удалось вывести изображение. {0}

# SelectCompositionForm_Err_CannotDeleteCurrent
source: Unable removing current composition
ru: Нельзя удалить текущую композицию

# SelectCompositionForm_Err_NaneIsEmpty
source: Name of a composition must be given before saving
ru: Должно быть задано название сохраняемой композиции

# SelectCompositionForm_Err_NoImage
source: There is no image
ru: Нет изображения

# SelectCompositionForm_Msg_ConfirmDel
source: Do you want to delete the composition '{0}'?
ru: Удалить композицию '{0}'?

# SelectCompositionForm_Msg_CurrentComposition
source: [ Current composition ]
ru: [ Текущая композиция ]

# SelectCompositionForm_Msg_SaveInHistory
source: Save current composition in the history list instead of named compositions?
ru: Сохранить текущую композицию в списке истории, а не как \"именную\" композицию?

# SelectCompositionForm_Name_XmlButton
source: XML view
ru: Просмотр XML

# SelectCompositionForm_ToolTip_XmlButton
source: Show current composition as XML text
ru: Просмотр данных выбранной композиции

# SettingsDialog_Err_NoPages
source: There are no dialog pages
ru: Нет ни одной страницы

# SettingsDialog_Name_Default
source: As default: {0}
ru: По умолчанию - {0}

# AboutDialog_ColTitle_AsmArchitecture
source: Architecture
ru: Архитектура

# AboutDialog_ColTitle_AsmCopyright
source: Copyright
ru: Авторские права

# AboutDialog_ColTitle_AsmCreatied
source: File created
ru: Файл создан

# AboutDialog_ColTitle_AsmDebug
source: Debug
ru: Отладка

# AboutDialog_ColTitle_AsmDescription
source: Description
ru: Описание

# AboutDialog_ColTitle_AsmLocation
source: Path to assembly
ru: Путь к сборке

# AboutDialog_ColTitle_AsmName
source: Assembly name
ru: Имя сборки

# AboutDialog_ColTitle_AsmOrder
source: Order
ru: № п/п

# AboutDialog_ColTitle_AsmVersion
source: Version
ru: Версия

# AboutDialog_Phase_Assemblies
source: Getting loaded assembly list
ru: Получение списка загруженных сборок

# AboutDialog_Title_Assemblies
source: Loaded assemblies
ru: Загруженные программные модули

# AboutDialog_Title_AssembliesGAC
source: From Global Assmbly Cache
ru: Из глобального кэша сборок

# AboutDialog_Title_AssembliesPrivate
source: Private modules
ru: Основные модули

# AboutDialog_ToolTip_AsmArchitecture
source: Supported processor architecture
ru: Поддерживаемая архитектура процессора
