Repository: a94827/FreeLibSet
Catalog: ExtForms/Res.*.resx
Languages: ru

# EFPReport_Phase_Init
source: Preparing to report creation
ru: Подготовка к созданию отчета

# EFPReport_Phase_Rebuild
source: Report '{0}' re-creating
ru: Повторное построение отчета '{0}'

# BRDataTreeViewTable_Err_NoInteractiveControl
source: The view does not contain any InteractiveControl
ru: Просмотр не содержит объектов InteractiveControl

# BRDataViewPageSetupAppearance_Err_SameTrueFalse
source: Text for 'On' and 'Off' state should be different
ru: Текст для включенного и выключенного флажка должен различаться

# BRDataViewPageSetupAppearance_Msg_CellDiffMargins
source: Cell margins: left {0}, top {1}, right {2}, bottom {3} cm
ru: Поля ячейки: левое {0}, верхнее {1}, правое {2}, нижнее {3} см

# BRDataViewPageSetupAppearance_Msg_CellSameMargins
source: Cell margins: {0} cm
ru: Поля ячейки: {0} см

# BRDataViewPageSetupAppearance_Msg_MayBeNotSupported
source: {0} (may be not supported)
ru: {0} (может не поддерживаться)

# BRDataViewPageSetupAppearance_Title_Tab
source: Appearance
ru: Оформление

# BRDataViewPageSetupAppearance_ToolTip_Tab
source: Table border setting, color usage for data view
ru: Выбор наличия границ, цветового оформления табличного просмотра

# BRDataView_FileType_CSV
source: Comma-separated text
ru: Текст CSV

# BRDataView_FileType_DBF3
source: dBase III files
ru: Файлы dBase III

# BRDataView_FileType_TXT
source: Text (tab-separated)
ru: Текст (разделитель - табуляция)

# BRReport_Title_ExportToFile
source: Export to {0}
ru: Экспорт в {0}

# EFPRepoprtXmlViewPage_PhaseText_Load
source: XML view loading
ru: Загрузка XML-просмотра

# EFPReportControlPage_Msg_NoControl
source: No data
ru: Нет данных

# EFPReportExtParams_Arg_MultiPart
source: More than one part given: {0}
ru: Одновременно задано несколько частей: {0}

# EFPReportExtParams_Arg_NoPart
source: Part not given
ru: Часть не задана

# EFPReportExtParams_Err_AfterQueryParams
source: Error occurred when AfterQueryParams called
ru: Ошибка вызова AfterQueryParams

# EFPReportExtParams_Err_AuxText
source: Error. {0}
ru: Ошибка. {0}

# EFPReportExtParams_Err_NotCallable
source: This method overload is not callable for EFPReportExtParams
ru: Эта перегрузка метода не должна вызываться для EFPReportExtParams

# EFPReportExtParams_Err_WrongParams
source: Wrong parameters given
ru: Заданы неверные параметры

# EFPReportExtParams_Msg_Default
source: (Defaults)
ru: (По умолчанию)

# EFPReportExtParams_ToolTip_Cancel
source: Don't build the report
ru: Отказаться от построения отчета

# EFPReportExtParams_ToolTip_Ok
source: Build report with given parameters
ru: Построить отчет с введенными параметрами

# EFPReportPageFilterItems_ToolTip_NoFilter
source: No filter
ru: Без фильтра

# EFPReportVarGridPage_Msg_NoData
source: No data
ru: Нет данных

# BRDataViewPageSetupColumns_ColTitle_AutoGrow
source: G.
ru: Р.

# BRDataViewPageSetupColumns_ColTitle_Flag
source: P.
ru: П.

# BRDataViewPageSetupColumns_ColTitle_Name
source: Column
ru: Столбец

# BRDataViewPageSetupColumns_ColTitle_Width
source: Width, см
ru: Ширина, см

# BRDataViewPageSetupColumns_Msg_WidthOfNotPrintedColumm
source: Cannot set width of non-printed column
ru: Нельзя задавать ширину столбца, который не печатается

# BRDataViewPageSetupColumns_Name_AutoGrow
source: Grow
ru: Расширять

# BRDataViewPageSetupColumns_Name_Flag
source: Print
ru: Печатать

# BRDataViewPageSetupColumns_Title_Tab
source: Columns
ru: Столбцы

# BRDataViewPageSetupColumns_ToolTip_AutoGrow
source: Grow column width to fill the whole page
ru: Расширять столбец для заполнения листа

# BRDataViewPageSetupColumns_ToolTip_ColumnSubHeaderNumbers
source: Set presence of auxiliary row below the column titles where column numbers will be printed
ru: Наличие дополнительной строки под заголовками столбов, содержащей номера колонок

# BRDataViewPageSetupColumns_ToolTip_Flag
source: Set checkmarks for columns to be printed
ru: Установите флажки для тех столбцов, которые должны быть напечатаны

# BRDataViewPageSetupColumns_ToolTip_Name
source: Column title
ru: Название столбца

# BRDataViewPageSetupColumns_ToolTip_RepeatedColumns
source: Number of columns that will be repeated on every band. Only first items from selected column list can be repeated. Zero means there is no repeated column.
ru: Количество столбцов, которые будут повторятся для каждой полосы. Повторяться могут только первые печататаемые столбцы, выбранные в списке. Нулевое значение означает, что повторяемых столбцов нет

# BRDataViewPageSetupColumns_ToolTip_Tab
source: Printed column selection with their width
ru: Выбор печатаемых столбцов и их ширины

# BRDataViewPageSetupColumns_ToolTip_WholeWidth
source: Whole width of selected columns (in centimeters)
ru: Полная ширина отмеченных столбцов в списке (в сантиметрах)

# BRDataViewPageSetupColumns_ToolTip_Width
source: Column width on the paper (in centimeters)
ru: Ширина области, отведенной для печати столбца (в сантиметрах)

# BRDataViewPageSetupColumns_ToolTip_WorkWidth
source: Printable area width calculated as Paper width - Left margin - Right margin (in centimeters). To change value, if possible, use tabs 'Page' and 'Margins'
ru: Ширина области печати, вычисляемая как Ширина страницы - Левое поле - Правое поле (в сантиметрах). Для изменения значения (если возможно) используйте закладки 'Страница' и 'Поля'

# BRDataViewPageSetupDbf_ColTitle_DbfName
source: DBF field
ru: Поле в DBF

# BRDataViewPageSetupDbf_ColTitle_DisplayName
source: Column in data view
ru: Столбец в просмотре

# BRDataViewPageSetupDbf_ColTitle_Format
source: Field format
ru: Формат

# BRDataViewPageSetupDbf_Err_BadFieldName
source: Invalid field name
ru: Неправильное имя поля

# BRDataViewPageSetupDbf_Err_NoFields
source: There are no selected fields
ru: Нет выбранных полей

# BRDataViewPageSetupDbf_Err_RepeatedFieldName
source: Repeated field name
ru: Повторяющееся имя поля

# BRDataViewPageSetupDbf_Err_RepeatedFieldName2
source: Field name '{0}' appeared twice
ru: Имя поля '{0}' встречается дважды

# BRDataViewPageSetupDbf_Name_Exported
source: Shoud export column
ru: Нужно ли экспортировать столбец

# BRDataViewPageSetupDbf_ToolTip_Tab
source: Column selection and used encoding to export to DBF file
ru: Выбор полей и кодировки для экспорта в файл DBF

# BRDataViewPageSetupSendTo_Msg_Export
source: Columns will be sent if they are marked in the 'Page Setup' dialog. All rows wil be exported to file
ru: В файл записываются все строки таблицы и столбцы, отмеченные в диалоге 'Параметры страницы'

# BRDataViewPageSetupSendTo_Msg_GridSendTo
source: Columns will be sent if they are marked in the 'Page Setup' dialog
ru: Печатаются столбцы, отмеченные в диалоге 'Параметры страницы'

# BRDataViewPageSetupSendTo_Msg_TreeSendTo
source: In '{0}' mode columns will be sent if they are selected in the 'Page Setup' dialog In '{1}' mode selected columns ignored
ru: В режиме '{0}' печатаются столбцы, отмеченные в диалоге 'Параметры страницы'. В режиме '{1}' выбранные столбцы не учитываются.

# BRDataViewPageSetupSendTo_Text_SelCell
source: Selected cell
ru: Выбранная ячейка

# BRDataViewPageSetupSendTo_Text_SelCells
source: Selected cells
ru: Выбранные ячейки

# BRDataViewPageSetupSendTo_Text_SelRow
source: Selected row
ru: Выбранная строка

# BRDataViewPageSetupSendTo_Text_SelRows
source: Selected rows
ru: Выбранные строки

# BRDataViewPageSetupSendTo_Title_Tab
source: Area
ru: Область

# BRDataViewPageSetupSendTo_ToolTip_Tab
source: View area selection for export
ru: Выбор области просмотра для экспорта

# BRDataViewPageSetupText_Err_SingleCharRequired
source: String must contain single char only
ru: Строка должна содержать один символ

# BRDataViewPageSetupText_Title_CSV
source: CSV file parameters
ru: Параметры файла в формате CSV

# BRDataViewPageSetupText_Title_Tab
source: Format
ru: Формат

# BRDataViewPageSetupText_ToolTip_Tab
source: Export file format
ru: Формат файла для экспорта

# BRFilePdf_Err_NoDll
source: Cannot load PdfSharp.dll. It requires to create a pdf file
ru: Не удалось загрузить библиотеку PdfSharp.dll. Без нее невозможно создание pdf-файлов

# BRFileTiff_Err_NoCodec
source: There is no GDI+ codec installed for TIFF writing
ru: В GDI+ не установлен кодировщик для записи файлов TIFF

# BRMenuOutItem_ErrTitle_Print
source: Error occurred when document printing
ru: Ошибка печати документа

# BRMenuOutItem_Err_NoBRReport
source: Resport is not attached
ru: Отчет не присоединен

# BRMenuOutItem_FileType_HTML
source: HTML files
ru: Файлы HTML

# BRMenuOutItem_FileType_PDF
source: PDF files
ru: Файлы PDF

# BRMenuOutItem_FileType_TIFF
source: TIFF files
ru: Файлы TIFF

# BRMenuOutItem_Msg_NoPageSetup
source: There are no page settings
ru: Нет параметров страницы

# BRMenuOutItem_Name_BRReport
source: Report
ru: Отчет

# BRMenuOutItem_Phase_CreateBRReport
source: Creating report '{0}'
ru: Создание отчета '{0}'

# BRMenuOutItem_Phase_CreateFile
source: File creating
ru: Создание файла

# BRMenuOutItem_Phase_Export
source: Saving file '{0}'
ru: Сохранение файла '{0}'

# BRMenuOutItem_Phase_LaunchApp
source: Launching {0}
ru: Запуск {0}

# BRMenuOutItem_Phase_Print
source: Document is printing
ru: Идет печать документа

# BRMenuOutItem_Phase_SendTo
source: Sending to {0}
ru: Отправка в {0}

# BRMenuOutItem_Title_Export
source: Export to file '{0}'
ru: Экспорт в '{0}'

# BRMenuOutItem_Title_PageSetup
source: Page setup
ru: Параметры страницы

# BRPageSetupBitmap_Msg_BitDepth
source: {0}-bit color
ru: {0}-битный цвет

# BRPageSetupBitmap_Msg_BW
source: Black-white
ru: Черно-белый

# BRPageSetupBitmap_Title_Tab
source: Graphics
ru: Графика

# BRPageSetupBitmap_ToolTip_Tab
source: Select resolution and color depth
ru: Выбор разрешения и количества цветов

# BRPageSetupFont_Err_Sample
source: Image drawing error
ru: Ошибка при построении изображения

# BRPageSetupFont_Msg_Sample
source: {0}. Height {1}. Width {2} pt.
ru: {0}. Высота {1}. Ширина {2} пт.

# BRPageSetupFont_Title_Tab
source: Font
ru: Шрифт

# BRPageSetupFont_ToolTip_FontHeight
source: Font height in points. 1 pt = 1/72 inch (appox. 0,35 mm)
ru: Высота шрифта в пунктах. 1 пт = 1/72 дюйма (примерно 0,35 мм)

# BRPageSetupFont_ToolTip_FontName
source: Font family name
ru: Имя гарнитуры шрифта

# BRPageSetupFont_ToolTip_FontWidth
source: Font width in points. 1 pt = 1/72 inch (appox. 0,35 mm)
ru: Ширина шрифта в пунктах. 1 пт = 1/72 дюйма (примерно 0,35 мм)

# BRPageSetupFont_ToolTip_LineHeight
source: Line height in points. Consists of font height and led height.
ru: Высота строки в пунктах. Складывается из высоты шрифта и межстрочного интервала

# BRPageSetupFont_ToolTip_Tab
source: Select font name and size
ru: Выбор гарнитуры и размеров шрифта

# BRPageSetupMargins_Title_Tab
source: Margins
ru: Поля

# BRPageSetupMargins_ToolTip_Tab
source: Margin sizes from paper edges to print area
ru: Размеры полей по краям бумаги

# BRPageSetupPaper_Msg_NonStandard
source: Other
ru: Другой

# BRPageSetupPaper_Title_Tab
source: Paper
ru: Бумага

# BRPageSetupPaper_ToolTip_CenterHorizontally
source: If mark set, document will be horizontally centered on the page
ru: Если флажок установлен, документ будет напачатан посередине листа по горизонтали

# BRPageSetupPaper_ToolTip_CenterVertically
source: If mark set, document will be vertically centered on the page
ru: Если флажок установлен, документ будет напачатан посередине листа по вертикали

# BRPageSetupPaper_ToolTip_Orientation
source: Paper orientation: Portrait (vertical) or landscape (horizontal)
ru: Ориентация бумаги: книжная (вертикальная) или альбомная (горизонтальная). При альбомной ориентации принтер печатает 'боком'

# BRPageSetupPaper_ToolTip_PageSize
source: Standard paper size selection
ru: Выбор стандартного размера бумаги

# BRPageSetupPaper_ToolTip_PaperHeight
source: Allows set non-standard paper height in centimeters regarding the portrait or landscape orientation. Select paper orientation before.
ru: Задание высоты бумаги в сантиметрах (с учетом книжной или альбомной ориентации) при использовании нестандартных листов. Задавайте значение после выбора правильной ориентации бумаги.

# BRPageSetupPaper_ToolTip_PaperWidth
source: Allows set non-standard paper width in centimeters regarding the portrait or landscape orientation. Select paper orientation before.
ru: Задание ширины бумаги в сантиметрах (с учетом книжной или альбомной ориентации) при использовании нестандартных листов. Задавайте значение после выбора правильной ориентации бумаги.

# BRPageSetupPaper_ToolTip_Tab
source: Paper size and orientation
ru: Размер и ориентация бумаги

# BRReportPainter_Err_GetLines
source: Text getting error
ru: Ошибка получения текста

# BRReportPainter_Arg_PixelFormat
source: Cannot create graphics for drawing image in format {0}. {1}
ru: Не удалось создать контекст вывода для изображения в формате {0}. {1}

# BRReportPainter_ErrTitle_Print
source: Print error occurred
ru: Ошибка при печати

# Splash_Msg_Complete
source: Complete
ru: Выполнено

# Splash_Msg_Current
source: Current
ru: Выполняется

# Splash_Msg_Skipped
source: Skipped
ru: Отменено

# Twain_Err_Cancel
source: Operation cancelled by user
ru: Операция отменена пользователем

# Twain_Err_CheckStatus
source: Operation executed partially
ru: Операция выполнена частично

# Twain_Err_DataNotAvailable
source: Data not available
ru: Данные недоступны

# Twain_Err_EndOfList
source: There are no more sources
ru: Больше источников не найдено

# Twain_Err_Failure
source: Failed
ru: Ошибка

# Twain_Err_InfoNotSupported
source: Information not available
ru: Получение информации недоступно

# Twain_Err_InitTwain
source: TWAIN cannot be initialized
ru: Не удалось инициализировать TWAIN

# Twain_Err_ScannerNotFound
source: Scanner not found
ru: Сканер не найден

# Twain_Err_SourceNotOpened
source: Cannot open the source
ru: Не удалось открыть источник

# Twain_Err_TwainCaps
source: Cannot get TWAIN device capabilties
ru: Не удалось получить возможности устройства TWAIN

# Twain_Err_TwainUI
source: Cannot start TWAIN user interface
ru: Не удалось запустить пользовательский интерфейс TWAIN

# Twain_Err_WithCode
source: Error with code {0}
ru: Код ошибки {0}

# Twain_Err_XferDone
source: All data transferred
ru: Все данные переданы

# WinFormsTools_Arg_SystemColor
source: System colors are not allowed
ru: Системные цвета недопустимы

# EFPGridProducer_Arg_SourceColumnMustBeSingle
source: There must be single source column
ru: Должен быть задан единственный исходный столбец
