Repository: a94827/FreeLibSet
Catalog: ExtForms/Res.*.resx
Languages: ru

# EFPErrorMessageListButton_Name_Default
source: Messages
ru: Сообщения

# EFPMaskedTextBox_Err_MaskIncomplete
source: All characters must be entered
ru: Должны быть введены все символы

# EFPMaskedComboBox_ToolTip_ClearButton
source: Clean the text in the text box
ru: Очистить введенное значение

# ParamSetComboBox_ErrTitle_ConfigFromControls
source: Error reading values from controls
ru: Ошибка получения значений из управляющих элементов

# ParamSetComboBox_ErrTitle_ConfigToControls
source: Error writing values to controls
ru: Ошибка записи значений в управляющие элементы

# ParamSetComboBox_ErrTitle_ReadHistory
source: History list reading error
ru: Ошибка чтения списка истории

# ParamSetComboBox_Err_CannotDelete
source: This preset cannot be deleted
ru: Этот набор нельзя удалить

# ParamSetComboBox_Err_NameStartsWithBracket
source: Preset name should not start with a bracket
ru: Имя набора не может начинаться со скобки

# ParamSetComboBox_Err_NotPersist
source: Preset saving is not implemented by the application
ru: Cохранение значений между сеансами работы не предусмотрено в программе

# ParamSetComboBox_Err_NotUserSetOverwrite
source: User presets only can be overwritten. Enter the name of a user new preset.
ru: Перезаписывать можно только пользовательские наборы. Введите название набора.

# ParamSetComboBox_Msg_Delete
source: Do you want to delete the preset '{0}'?
ru: Удалить набор '{0}'?

# ParamSetComboBox_Msg_Hist0
source: (Last)
ru: (Последний)

# ParamSetComboBox_Msg_Hist1
source: (Second last)
ru: (Предпоследний)

# ParamSetComboBox_Msg_HistN
source: (Previous nr {0})
ru: (Предыдщий №{0})

# ParamSetComboBox_Msg_NoSelection
source: There is no selected preset
ru: Нет выбранного готового набора

# ParamSetComboBox_Msg_Overwrite
source: Named preset '{0}' already exists. Do you want to override it?
ru: Набор '{0}' уже существует. Вы хотите перезаписать его?

# ParamSetComboBox_Title_CurrentSettingsXML
source: Dialog current settings ({0})
ru: Текущие настройки диалога ({0})

# ParamSetComboBox_ToolTip_ComboBox
source: Selection of ready-to-use preset from a drop-down list. The list contains: - named user's sets you had saved; - application-predefined default set(s), if any; - up to 9 last used sets (history) Text box uses for entering a name for a new user preset.
ru: Выбор готового набора из выпадающего списка. В список входят: - пользовательские наборы, которые Вы сохранили; - настройки по умолчанию, если заданы в программе; - а также до 9 последних наборов значений (история) Текстовое поле предназначено для ввода названия для нового пользовательского набора

# TrayIcon_ErrTitle_RemoveNotifyIcon
source: NotifyIcon disposing error
ru: Ошибка удаления NotifyIcon

# Cmd_Menu_Filter
source: &Filter
ru: &Фильтр

# Cmd_Menu_Filter_NextDateFilter
source: &Next time period
ru: &Следующий период времени

# Cmd_Menu_Filter_PrevDateFilter
source: &Previous time period
ru: &Предыдущий период времени

# Cmd_Menu_Filter_SetFilter
source: &Set filter ...
ru: &Установить фильтр ...

# Cmd_Menu_View_GridConfig
source: Data view configuration ...
ru: Настройка просмотра ...

# EFPConfigurableDataView_ErrTitle_ReadConfig
source: Data view config loading error
ru: Ошибка загрузки сохраненной конфигурации табличного просмотра

# EFPConfigurableDataView_Err_NoFilters
source: Data view contains no filter
ru: Просмотр не содержит фильтров

# EFPConfigurableDataView_Err_ScrollFilter
source: Cannot scroll the filter '{0}'
ru: Прокрутка фильтра '{0}' невозможна

# EFPConfigurableDataView_ToolTip_ForFilter
source: {0} for the filter '{1}';
ru: {0} для фильтра '{1}';

# EFPConfigurableDataView_ToolTip_ForNoActiveFilter
source: {0} - there is no active filter
ru: {0} - нет активного фильтра

# EFPControl_ErrTitle_SetProviderStateDisposed
source: Error when set EFPControlBase.State to EFPControlProviderState.Disposed
ru: Ошибка установки состояния EFPControlProviderState.Disposed

# EFPControlWithToolBar_Arg_ControlHasParent
source: Main control '{0}' should have no parent
ru: Основной управлящий элемент '{0}' не должен иметь родителя

# EFPControlWithToolBar_Arg_ParentNotEmpty
source: Parent control '{0}' has childen
ru: Родительский управляющий элемент '{0}' уже содержит дочерние элементы

# EFPControl_Err_Created
source: Control '{0}' has already been created
ru: Управляюший элемент '{0}' уже был выведен на экран

# EFPControl_Err_LoadConfigCalled
source: Configuration for the control '{0}' has already been loaded
ru: Для управляющего элемента '{0}' уже была загружена конфигурация

# EFPControl_Err_OutsideValidating
source: Method should be called only from OnValidate() or Validating event handler
ru: Метод может вызываться только из метода OnValidate() или обработчика события Validating

# EFPControl_Err_Validating
source: Exception occurred while validating. {0}
ru: Ошибка при проверке. {0}

# EFPDataGridView_Err_DataErrorException
source: DataGridView.DataError ({0}) occurred
ru: Ошибка DataGridView.DataError ({0})

# EFPDataGridView_Err_DataErrorFormatting
source: Formatting error for the table cell with RowIndex={0} and ColIndex={1}
ru: Ошибка форматирования для ячейки RowIndex={0} и ColIndex={1}

# EFPDataGridView_Err_DataErrorParsing
source: Error parsing entered value '{0}'
ru: Ошибка преобразования введенного значения '{0}'

# EFPDataGridView_Name_Default
source: Grid view
ru: Табличный просмотр

# EFPDataView_Err_AlreadySorted
source: Rows are already sorted for this column
ru: Строки уже отсортированы по этому столбцу

# EFPDataView_Err_CellFormatting
source: Cell formatting error. {0}
ru: Ошибка форматирования. {0}

# EFPDataView_Err_ColumnCustomSortNotAllowed
source: Cannot perform sort with the column '{0}'
ru: Нельзя выполнять сортировку по столбцу '{0}'

# EFPDataView_Err_ColumnHasNoSort
source: There is no sort order for thisc column. Select a predeined order from the menu.
ru: Для этого столбца нет сортировки. Выберите порядок строк из меню.

# EFPDataView_Err_ComplexSortNotStarted
source: Custom sort has not been started. Do not press <Ctrl> key
ru: В данный момент сортировка не выполнена. Не нажимайте <Ctrl>

# EFPDataView_Err_ComplexSortRepeatedColumn
source: Cannot add the column to the custom sort order since it already is a part of the sort
ru: Нельзя добавить столбец к сортировке, так как он уже в ней участвует

# EFPDataView_Err_CustomOrderNotAllowed
source: Custom sort is not allowed for this view
ru: Произвольная сортировка запрещена для этого просмотра

# EFPDataView_Err_DataViewNotSorted
source: Attached to view DataView object has no sort
ru: Присоединенный к просмотру объект DataView не имеет полей сортировки

# EFPDataView_Err_EditNotFinished
source: Editing has not finished yet
ru: Редактирование не закончено

# EFPDataView_Err_InlineEditNotImplemented
source: Inline edit is not implemented for the state {0}
ru: Редактирование по месту для режима {0} не реализовано

# EFPDataView_Err_MoveRowsUpDown
source: Cannot move {1} selected rows ({0})
ru: Нельзя передвинуть выбранные строки ({0}) {1}

# EFPDataView_Err_MultiSelectedRows
source: There are more than one selected rows in the view
ru: В просмотре выбрано больше одной строки

# EFPDataView_Err_NoDataView
source: Data view does not have linked DataView object
ru: Просмотр не связан с DataView

# EFPDataView_Err_NoPredefinedOrders
source: There are no predefined sort orders for the view. Switch to the custom row order mode.
ru: Нет предопределенных порядков сортировки. Переключитесь на произвольный порядок строк

# EFPDataView_Err_NoSelectedCell
source: There is no selected cell in the view
ru: В просмотре нет выбранной ячейки

# EFPDataView_Err_NoSelectedRow
source: There is no selected row in the view
ru: В просмотре нет выбранной строки

# EFPDataView_Err_OrderNotAllowed
source: Sorting is not allowed for the view
ru: Сортировка не предусмотрена

# EFPDataView_Err_PasteMore
source: Text in clipoard contains {0} row(s) and {1} column(s), but selected less quantity of cells: {2} row(s} and {3} column{s}
ru: Текст в буфере обмена содержит {0} строк(и) и {1} столбца(ов), а выбрано меньше: {2} строк(и) и {3} столбца(ов)

# EFPDataView_Err_PasteNoDivided
source: Text in clipoard contains {0} row(s) and {1} column(s), but selected {2} row(s} and {3} column{s}. Cannot multiply rows and columns because cell quantities are not divisible by an integer
ru: Текст в буфере обмена содержит {0} строк(и) и {1} столбца(ов), а выбрано (2) строк(и) и {3}столбца(ов). Не делится нацело

# EFPDataView_Err_PasteNoText
source: There is no text given
ru: Текст не задан

# EFPDataView_Err_PasteOutIOfBounds
source: Text in clipoard contains {0} row(s) and {1} column(s), it excess the view boundaries
ru: Текст в буфере обмена содержит {0} строк(и) и {1} столбца(ов), не помещается

# EFPDataView_Err_RefreshRestoreSelection
source: Error occurred when selected rows restored after the table had been refreshed. {0}
ru: Возникла ошибка при восстановлении выбранных строк при обновлении таблицы. {0}

# EFPDataView_Err_SetTextValue
source: Cannot write text value '{0}' to the cell. {1}
ru: Нельзя записать значение '{0}' в ячейку. {1}

# EFPDataView_Msg_MoveDown
source: down
ru: вниз

# EFPDataView_Msg_MoveUp
source: up
ru: вверх

# EFPDataView_Msg_ReadOnlyColumn
source: Column is read-only
ru: Столбец предназначен только для просмотра

# EFPDataView_Msg_ReadOnlyRow
source: Row is read-only
ru: Строка предназначена только для просмотра

# EFPDataView_Msg_ReadOnlyView
source: View is read-only
ru: Просмотр предназначен только для чтения

# EFPDataView_Msg_RowIdText_NoDataRow
source: No row
ru: Нет строки

# EFPDataView_Msg_RowIdText_RowNumber
source: Row {0}
ru: Строка {0}

# EFPDataView_Err_Empty
source: The view has no rows
ru: Просмотр не содержит ни одной строки

# EFPDataView_Err_RowErrNavNotSuppoprted
source: The view does not support row error navigation
ru: Просмотр не поддерживает навигацию по строкам с ошибками

# EFPDataView_Err_IncSearchCannotAddChar
source: The character '{0}' cannot be added to the increment search string. {1}
ru: Символ '{0}' не может быть добавлен к строке быстрого поиска. {1}

# EFPDataView_Msg_RowErrNav
source: {0}, but there is no row {1} found
ru: {0}, но строка {1} не найдена

# EFPDataView_Msg_RowErrNavTableBottom
source: The bottom of the table reached
ru: Достигнут конец таблицы

# EFPDataView_Msg_RowErrNavTableTop
source: The top of the table reached
ru: Достигнуто начало таблицы

# EFPDataView_Msg_RowErrNav_Error
source: with an error
ru: с ошибкой

# EFPDataView_Msg_RowErrNav_Information
source: with a message
ru: с сообщением

# EFPDataView_Msg_RowErrNav_None
source: without an error
ru: без ошибок

# EFPDataView_Msg_RowErrNav_Warning
source: with an error or a warning
ru: с ошибкой или предупреждением

# EFPDataView_Name_NoNameColumn
source: Untitled column
ru: Столбец без названия

# EFPDataView_Phase_IncSearch
source: Increment search
ru: Поиск

# EFPDataView_ToolTip_Exception
source: Error creating tooltip text. {0}
ru: Ошибка при получении подсказки {0}

# EFPDataView_ToolTip_TopLeftCellErrNav
source: Use Ctrl+] и Ctrl+[ key combinations to navigate these rows
ru: Используйте Ctrl+] и Ctrl+[ для перехода к этим строкам

# EFPDataView_ToolTip_TopLeftCellErrors
source: There are rows with errors ({0})
ru: Есть строки с ошибками ({0})

# EFPDataView_ToolTip_TopLeftCellNoErrors
source: There are no rows with errors or warnings
ru: Нет строк с ошибками или предупреждениями

# EFPDataView_ToolTip_TopLeftCellRowCount
source: Rows in the view: {0}
ru: Строк в просмотре: {0}

# EFPDataView_ToolTip_TopLeftCellWarmings
source: There are rows with warnings ({0})
ru: Есть строки с предупреждениями ({0})

# Cmd_Menu_CheckMarks
source: Check marks
ru: Установка/снятие отметок для строк

# Cmd_Menu_CheckMarks_DelAll
source: Delete marks for all rows
ru: Снять отметки для всех строк

# Cmd_Menu_CheckMarks_DelSelected
source: Delete marks for selected rows
ru: Снять отметки для выбранных строк

# Cmd_Menu_CheckMarks_InvSelected
source: Invert marks for selected rows
ru: Инвертировать отметки для выбранных строк

# Cmd_Menu_CheckMarks_SetAll
source: Set marks for all rows
ru: Установить отметки для всех строк

# Cmd_Menu_CheckMarks_SetSelected
source: Set marks for selected rows
ru: Установить отметки для выбранных строк

# Cmd_Menu_Edit_CopyToolTip
source: Copy tooltip text
ru: Копировать всплывающую подсказку

# Cmd_Menu_Edit_Delete
source: Delete
ru: Удалить запись

# Cmd_Menu_Edit_Delete_MultiRows
source: Delete selected rows
ru: Удалить выбранные записи

# Cmd_Menu_Edit_Delete_SingleRow
source: Delete current row
ru: Удалить запись

# Cmd_Menu_Edit_Edit
source: Edit
ru: Редактировать запись

# Cmd_Menu_Edit_EditInline
source: Edit inline
ru: Редактировать по месту

# Cmd_Menu_Edit_Edit_MultiRows
source: Edit selected rows
ru: Редактировать выбранные записи

# Cmd_Menu_Edit_Edit_SingleRow
source: Edit current row
ru: Редактировать запись

# Cmd_Menu_Edit_IncSearch_Finish
source: Finish incremental search
ru: Закончить поиск по буквам

# Cmd_Menu_Edit_IncSearch_Start
source: Start incremental search
ru: Начать поиск по буквам

# Cmd_Menu_Edit_Insert
source: Create
ru: Создать новую запись

# Cmd_Menu_Edit_InsertCopy
source: Create copy
ru: Создать копию записи

# Cmd_Menu_Edit_View
source: View
ru: Просмотреть запись

# Cmd_Menu_Edit_View_MultiRows
source: View selected rows
ru: Просмотреть выбранные записи

# Cmd_Menu_Edit_View_SingleRow
source: View current row
ru: Просмотреть запись

# Cmd_Menu_RowErrNav
source: Rows with messages
ru: Строки с ошибками

# Cmd_Menu_RowErrNav_CopyMessage
source: Copy message
ru: Копировать сообщение

# Cmd_Menu_RowErrNav_MessageList
source: Message list
ru: Список сообщений

# Cmd_Menu_RowErrNav_NextError
source: Go to next row with an error
ru: Перейти к следующей строке с ошибкой

# Cmd_Menu_RowErrNav_NextWarning
source: Go to next row with error/warning
ru: Перейти к следующей строке с ош./пр.

# Cmd_Menu_RowErrNav_PrevError
source: Go to previous row with an error
ru: Перейти к предыдущей строке с ошибкой

# Cmd_Menu_RowErrNav_PrevWarning
source: Go to previous row with error/warning
ru: Перейти к предыдущей строке с ош./пр.

# Cmd_Menu_RowOrder
source: Row order
ru: Порядок строк

# Cmd_Menu_RowOrder_Custom
source: &Custom
ru: &Произвольный

# Cmd_Menu_RowOrder_Dialog
source: &More ...
ru: &Еще ...

# Cmd_Menu_RowOrder_MoveDown
source: Move down
ru: Переместить вниз

# Cmd_Menu_RowOrder_MoveUp
source: Move up
ru: Переместить вверх

# Cmd_Menu_RowOrder_RestoreOrder
source: Restore default order
ru: Восстановить порядок по умолчанию

# Cmd_Menu_ToolTip_InsertCopy
source: Create new record using current as a template
ru: Создать новую запись на основании текущей записи

# Cmd_Status_Edit_IncSearch_NoColumn
source: <Column not selected>
ru: <Столбец не выбран>

# Cmd_Status_Edit_IncSearch_NotStarted
source: <Search not started>
ru: <Поиск не начат>

# Cmd_Status_Edit_IncSearch_Unsupported
source: <Search not supported>
ru: <Поиск невозможен>

# Cmd_Status_Edit_IncSearch_WrongColumn
source: <Wrong column>
ru: <Неподходящий столбец>

# Cmd_Status_View_StatCalculating
source: Calculating
ru: Идет расчет

# Cmd_ToolTip_Edit_EditInline_CanStart
source: Inline editing can be started
ru: Можно начать редактирование ячейки

# Cmd_ToolTip_Edit_EditInline_CellReadOnly
source: Cannot edit the cell. {0}
ru: Нельзя редактировать ячейку. {0}

# Cmd_ToolTip_Edit_EditInline_ControlReadOnly
source: The view does not support inline editing
ru: Просмотр не поддерживает редактирование по месту

# Cmd_ToolTip_Edit_EditInline_EditInProgress
source: Cell editing is in progress
ru: Выполняется редактирование ячейки

# Cmd_ToolTip_Edit_EditInline_NoSelectedCell
source: There is no selected cell
ru: Нет выбранной ячейки

# Cmd_ToolTip_RowErrNav_CopyMessage
source: Copy message to the cipboard
ru: Копировать сообщение в буфер обмена

# Cmd_ToolTip_RowErrNav_MessageList
source: Show the list of messages
ru: Показать список сообщений

# Cmd_ToolTip_RowErrNav_NextError
source: Go to next row with an error
ru: Перейти к следующей строке с ошибкой

# Cmd_ToolTip_RowErrNav_NextWarning
source: Go to next row with an error or a warning
ru: Перейти к следующей строке с ошибкой или предупреждением

# Cmd_ToolTip_RowErrNav_PrevError
source: Go to previous row with an error
ru: Перейти к предыдущей строке с ошибкой

# Cmd_ToolTip_RowErrNav_PrevWarning
source: Go to previous row with an error or a warning
ru: Перейти к предыдущей строке с ошибкой или предупреждением

# Cmd_ToolTip_View_RowOrder_WithName
source: Row order ({0})
ru: Порядок строк ({0})

# Cmd_ToolTip_View_StatCount
source: Quantity of numbers in the selected cells
ru: Количество чисел в выбранных ячейках просмотра

# Cmd_ToolTip_View_StatError
source: Error occurred when value was calculated
ru: Ошибка при вычислении значения

# Cmd_ToolTip_View_StatMouseInfo
source: Use left mouse button double click to copy shown value to the clipboard
ru: Двойной щелчок мыши - копирование значения в буфер обмена

# Cmd_ToolTip_View_StatNonSummable
source: Some of selected cells are not summable
ru: Некоторые выбранные ячейки не являются суммируемыми

# Cmd_ToolTip_View_StatSum
source: Sum of numbers in the selected cells
ru: Сумма выбранных ячеек

# EFPDataViewConfig_ErrTitle_Validation
source: Validation failed when grid configuration saved
ru: Ошибка проверки при записи конфигурации табличного просмотра

# EFPDataViewConfig_Err_NoColumns
source: Configuration has no columns
ru: В конфигурации не задано ни одного столбца

# EFPDataView_Err_CheckMarksNotChanged
source: There are no changes in row check marks
ru: Нет изменившихся отметок строк

# EFPDataView_Err_ControlReadOnly
source: Inline cell editing is not allowed in the view
ru: Просмотр не допускает редактирование ячеек

# EFPDataView_Err_Copy
source: Error occurred when cells copied
ru: Ошибка при выполнении копирования ячеек

# EFPDataView_Err_DefaultOutItemDeleted
source: Default print settings set for the view has been removed
ru: Стандартный вариант печати табличного просмотра был удален

# EFPDataView_Err_IncSearchIsEmpty
source: Increment search string is empty
ru: Строка быстрого поиска не содержит введенных символов

# EFPDataView_Err_IncSearchNoMoreRows
source: There is no more row with cell value started with '{0}'
ru: Нет больше строк, в которых значение поля начинается с '{0}'

# EFPDataView_Err_IncSearchNotSupportedByColumn
source: The column does not support incremental search
ru: Столбец не поддерживает поиск по первым буквам

# EFPDataView_Err_MultiSelectedCells
source: There are more than one selected cells in the view
ru: Должно быть выбрано не более одной ячейки

# EFPDataView_Err_NoCellToolTip
source: There is no tooltip for the cell
ru: Нет всплывающей подсказки для ячнйки

# EFPDataView_Err_NoRowToolTip
source: There is no tooltip for the row header
ru: Нет всплывающей подсказки для заголовка строки

# EFPDataView_Err_NoSelectedColumn
source: There is no selected column in the view
ru: В просмотре нет выбранного столбца

# EFPDataView_Err_NoStatValueToCopy
source: There is no value to copy to the clipboard
ru: Нет значения для копирования в буфер обмена

# EFPDataView_Err_NotRectangleSelection
source: A rectangle cell block should be selected
ru: Должна быть выбрана прямоугольная область ячеек

# EFPDataView_Name_ImageColumn
source: Image
ru: Значок

# EFPDataView_Order_None
source: None
ru: Не задан

# EFPDataView_Phase_CalcColumnWidth
source: Column '{0}' width calculating
ru: Определение ширины столбца '{0}'

# EFPDataView_Phase_IncSearchLoadColumnData
source: Column data loading for incremental search
ru: Загрузка данных столбца для поиска по первым буквам

# EFPDataView_Title_RowMessagesForAllRows
source: Messages for all rows
ru: Сообщения для всех строк

# EFPDataView_Title_RowMessagesForCurrentRow
source: Messages for current row
ru: Сообщения для текущей строки

# EFPDataView_Title_RowMessagesForSelectedRows
source: Messages for selected rows ({0})
ru: Сообщения для выбранных строк ({0})

# EFPDataGridViewOrderForm_ErrTitle_CreateList
source: Error creating sorting list
ru: Ошибка получения элементов сортировки

# EFPDataGridViewOrderForm_Err_EmptyCustomList
source: At least one column must be selected for the sort
ru: Должно быть выбрано хотя бы одно поле для сортировки

# EFPDataGridViewOrderForm_Name_Add
source: Add
ru: Добавить

# EFPDataGridViewOrderForm_Name_Remove
source: Remove
ru: Удалить

# EFPDataGridViewOrderForm_ToolTip_Add
source: Places column to the list of sorting columns
ru: Добавляет столбец в список выбранных для сортировки

# EFPDataGridViewOrderForm_ToolTip_Remove
source: Removes column from the sorting list
ru: Удаляет столбец из сортировки

# EFPDataView_Err_CalcRowsHeight
source: Error when row height calcualted. Repeated errors will not be logged
ru: Ошибка расчета высоты строк табличного просмотра. Повторные ошибки не регистрируются

# EFPDataView_Phase_CalcRowsHeight
source: Calculating heights of rows
ru: Вычисление высоты строк

# DateRangeBox_Err_CannotChangeYear
source: Cannot change the year
ru: Нельзя изменить год

# DateTimeBox_Err_DateMustBeInRange
source: Date must be in range {0}
ru: Дата должна быть в диапазоне {0}

# DateRangeBox_Err_Inverted
source: Wrong date interval. The first is greater than the last date
ru: Неправильный интервал дат. Начальная дата больше конечной

# DateRangeBox_Err_IsHalfEmpty
source: Half-open periods are not allowed
ru: Полуоткрытые интервалы не допускаются

# DateRangeBox_Menu_Edit_Month
source: Month
ru: Месяц

# DateRangeBox_Menu_Edit_NextYear
source: Next year
ru: Следующий год

# DateRangeBox_Menu_Edit_PrevYear
source: Previous year
ru: Предыдущий год

# DateRangeBox_Menu_Edit_Quarter
source: Quarter
ru: Квартал

# DateRangeBox_Menu_Edit_SetFirstDateAsLast
source: Set first date as last
ru: Начальная дата равна конечной

# DateRangeBox_Menu_Edit_SetLastDateAsFirst
source: Set last date as first
ru: Конечная дата равна начальной

# DateRangeBox_Menu_Edit_Today
source: Today
ru: Сегодня

# DateRangeBox_Menu_Edit_Year
source: Year
ru: Год

# DateRangeBox_Name_First
source: First date
ru: Начальная дата

# DateRangeBox_Name_Last
source: Last date
ru: Конечная дата

# EFPDateOrRangeBox_Err_ShowCalendar
source: Calendar show error
ru: Ошибка вызова календаря

# EFPDateOrRangeBox_Name_ToRangeButton
source: Period
ru: Диапазон

# DateTimeBox_ToolTip_ClearButton
source: Clear date
ru: Очистить дату

# DateTimeBox_ToolTip_PopupButton
source: Select date via calendar
ru: Выбрать дату из календаря

# EFPErrorDataGridView_ColTitle_Code
source: Code
ru: Код

# EFPErrorDataGridView_ColTitle_Kind
source: Kind
ru: Тип

# EFPErrorDataGridView_ColTitle_Message
source: Message
ru: Сообщение

# EFPErrorDataGridView_ColTitle_Order
source: Order
ru: № п/п

# EFPErrorDataGridView_Msg_EmptyList
source: No messages
ru: Нет ошибок

# EFPErrorDataGridView_Msg_NoList
source: Message list has not been attached!
ru: Список ошибок не присоединен!

# Cmd_Menu_Scale
source: Scale
ru: Масштаб

# Cmd_Menu_Scale_100
source: Scale 100 %
ru: Масштаб 100 %

# Cmd_Menu_Scale_200
source: Scale 200 %
ru: Масштаб 200 %

# Cmd_Menu_Scale_50
source: Scale 50 %
ru: Масштаб 50 %

# Cmd_Menu_Scale_500
source: Scale 500 %
ru: Масштаб 500 %

# Cmd_Menu_Scale_AllPages
source: All pages
ru: Все страницы

# Cmd_Menu_Scale_OnePage
source: Single page
ru: Страница целиком

# Cmd_Menu_Scale_SetScale
source: Set scale ...
ru: Установить масштаб ...

# Cmd_Menu_Scale_TwoPages
source: Two pages side-by-side
ru: Две страницы рядом

# Cmd_Menu_Scale_ZoomIn
source: Zoom In
ru: Увеличить изображение

# Cmd_Menu_Scale_ZoomOut
source: Soom Out
ru: Уменьшить изображение

# Cmd_Menu_View_FirstPage
source: First page
ru: Первая страница

# Cmd_Menu_View_GotoPage
source: Go to page ...
ru: Перейти к странице ...
