Repository: a94827/FreeLibSet
Catalog: ExtForms/Res.*.resx
Languages: ru

# AboutDialog_ToolTip_AsmDebug
source: If marked, the assembly compiled in debug mode. If not marked, the assembly complied with optimization,
ru: Флажок установлен, если сборка скомпилирована в отладочном режиме. Если флажка нет, сборка скомпилирована с оптимизацией кода

# AboutDialog_ToolTip_AssemblyCount
source: Assembly loaded total: {0}
ru: Всего загружено сборок: {0}

# SettingsDialog_Arg_PageTemplateIsForm
source: The control cannot be a Form class. If you want to use a template form, create a Panel on the form. Panel should contains controls.. Then send the Panel as an argument.
ru: Управляющий элемент не может быть Form. Если используется форма-шаблон, то добавьте панель с элементами и передавайте Panel в конструктор SettingsDialogPage

# SettingsDialog_Arg_PageTemplateIsTabPage
source: The control cannot be a TabPage class. If you want to use a template form, with TabControl create a Panel on the TabPage. Panel should contains controls.. Then send the Panel as an argument.
ru: Управляющий элемент не может быть TabPage. Если используется форма-шаблон, то добавьте на TabPage объект Panel с элементами и передавайте Panel в конструктор SettingsDialogPage

# AboutDialog_Err_AttrException
source: Error getting attributes. {0}
ru: Ошибка получения атрибутов. {0}

# AboutDialog_Err_EntryAsmException
source: Error defining entry assembly. {0}
ru: Ошибка определения выполняемой сборки. {0}

# AboutDialog_Err_UnknownEntryAsm
source: Cannot define entry assembly
ru: Не удалось определить сборку

# AboutDialog_Msg_Version
source: Version {0}
ru: Версия {0}

# AboutDialog_Order_AsmArchitecture
source: Architecture
ru: Архитектура

# AboutDialog_Order_AsmCopyright
source: Copyright
ru: Авторские права

# AboutDialog_Order_AsmCreatedASC
source: File created (older first)
ru: Файл создан (старые вверху)

# AboutDialog_Order_AsmCreatedDESC
source: File created (newer first)
ru: Файл создан (новые вверху)

# AboutDialog_Order_AsmName
source: Assembly name
ru: Имя сборки

# AboutDialog_Order_AsmOrder
source: Loading order
ru: В порядке загрузки

# AboutDialog_Order_AsmPath
source: Path to assembly
ru: Путь к сборке

# AboutDialog_Title_Main
source: About
ru: О программе

# AboutDialog_Title_WithAppName
source: About '{0}'
ru: О программе '{0}'

# ApplicationExceptionHandler_ErrTitle_DataGridViewSetCurrentCellAddressCore
source: Application.ThreadException catched. Error setting current cell in DataGridView. Exception registered once.
ru: Перехват Application.ThreadException. Oшибка выбора ячейки DataGridView. Исключение регистрируется однократно

# ApplicationExceptionHandler_ErrTitle_IconDisposed
source: Application.ThreadException catched. Error access to disposed Icon object. Exception registered once.
ru: Перехват Application.ThreadException. Ошибка доступа к удаленному значку. Исключение регистрируется однократно

# ApplicationExceptionHandler_ErrTitle_ToolStripSetItemLocation
source: Application.ThreadException catched. Error when ToolStrip object position defined. Exception registered once.
ru: Перехват Application.ThreadException. Ошибка позицонирования ToolStrip. Исключение регистрируется однократно

# ApplicationExceptionHandler_ErrTitle_UnhandledInternalError
source: Internal error in UnhandledException
ru: Внутренняя ошибка обработки UnhandledException

# ApplicationExceptionHandler_ErrTitle_UnhandledNoTermination
source: Not catched exception UnhandledException without program termination
ru: Неперехваченное исключение UnhandledException без завершения работы

# ApplicationExceptionHandler_ErrTitle_UnhandledWithTermination
source: Not catched exception UnhandledException with program termination
ru: Неперехваченное исключение UnhandledException с завершением работы

# BackgroundPrint_Phase_AddDoc
source: Document is putting in the queue
ru: Постановка задания в очередь

# BackgroundPrint_Phase_Default
source: Backgrount document printing
ru: Фоновая печать документов

# BackgroundPrint_Phase_Page
source: page {0}
ru: страница {0}

# BackgroundPrint_Phase_PrintDoc
source: Background printing of document '{0}' is in progress. {1}. The queue contains {2} more document(s)
ru: Фоновая печать документа '{0}' {1}. Еще осталось документов в очереди: {2}

# BackgroundPrint_Phase_Terminating
source: printing finishing
ru: завершение печати

# BackgroundPrint_ToolTip_PrintPage
source: Document '{0}' page {1} is printed
ru: Идет печать страницы {1} документа '{0}'

# BackgroundPrint_ToolTip_Terminating
source: Document '{0}' print terminating
ru: Завершается печать документа '{0}'

# Btn_Text_Back
source: &Back
ru: &Назад

# Btn_Text_Finish
source: &Finish
ru: &Готово

# Btn_Text_Forward
source: &Forward
ru: &Далее

# Cmd_ToolTip_View_BackgroundPrintStatus
source: Background printing state panel. No printing jobs.
ru: Окно состояния фоновой печати. Нет заданий

# Common_Err_AppDomainUnhandledException
source: Unhanded exception (событие AppDomain.UnhandledException)
ru: Необрабатываемое исключение (событие AppDomain.UnhandledException)

# EFPAppExecProcCallList_ErrTitle_Running
source: Execution {0} failed
ru: Ошибка выполнения {0}

# EFPAppExecProcCallList_Phase_Running
source: Executing {0}
ru: Выполнение {0}

# EFPApp_ErrTitle_CreateSDIForm
source: Cannot create an instance of form '{0}' for the SDI interface. An empty window will be created instead.
ru: Не удалось создать окно класса '{0}' для интерфейса SDI. Будет создано пустое окно.

# EFPApp_ErrTitle_DialogPosition
source: Error when defining dialog position
ru: Ошибка определения позиции блока диалога

# EFPApp_ErrTitle_DialogRunnerDetach
source: Error when DialogRunner detached
ru: Ошибка отсоединения DialogRunner

# EFPApp_ErrTitle_LoadComposition
source: Cannot restore current workspace composition
ru: Не удалось восстановить композицию окон

# EFPApp_ErrTitle_RICallBack
source: Callback handle error
ru: Ошибка обработки обратного вызова

# EFPApp_ErrTitle_SaveComposition
source: Cannot save current workspace composition
ru: Не удалось сохранить существующую композицию окон

# EFPApp_ErrTitle_ShellExecute
source: File open error
ru: Ошибка открытия файла

# EFPApp_ErrTitle_ShowExceptionInternal
source: Error when show exception message
ru: Ошибка при выводе сообщения об исключении

# EFPApp_ErrTitle_ToolFormHide
source: Set tool forms off
ru: Выключение tool forms

# EFPApp_ErrTitle_ToolFormShow
source: Set tool forms on
ru: Включение tool forms

# EFPApp_Err_CreatorClassType
source: Type {0} is not a Form class descendant and does not implement the IEFPFormCreator interface
ru: Класс {0} не является производным от Form и не поддерживает интерфейс IEFPFormCreator

# EFPApp_Err_DirIsEmpty
source: Directory is not given
ru: Каталог не задан

# EFPApp_Err_DirNotFound
source: Directory '{0}' not found
ru: Каталог '{0}' не существует

# EFPApp_Err_FileNotFound
source: File {0} not found
ru: Файл {0} не найден

# EFPApp_Err_MainWindowShown
source: Main window has already been shown
ru: Главное окно уже выведено

# EFPApp_Err_NoHelpContext
source: Help context is not given
ru: Контекст справки не задан

# EFPApp_Err_NoInitAppCalled
source: Method EFPApp.InitApp() has not been called
ru: Не было вызова EFPApp.InitApp()

# EFPApp_Err_NoInterface
source: There is no user interface set
ru: Нет подключенного пользовательского интерфейса

# EFPApp_Err_NotMainThread
source: Call not from the EFPApp.MainThread
ru: Вызов не из основного потока приложения

# EFPApp_Err_SetUnknownInterface
source: Unknown user interface type '{0}' inquired. The user interface '{1}' will be used instead.
ru: Запрошена установка неизвестного интерфейса пользователя '{0}'. Будет использован интерфейс '{1}'

# EFPApp_Err_ShellExecuteFailed
source: Cannot open file '{0}'
ru: Не удалось открыть файл '{0}'

# EFPApp_Err_ShowWindowsExplorerFailed
source: Running {0} failed
ru: Ошибка запуска {0}

# EFPApp_Err_ShowWindowsExplorerNotSupported
source: There is no known application for viewing directories in the current operating system
ru: Для установленной операционной системы программа просмотра каталогов неизвестна

# EFPApp_Err_ShowWindowsExplorerRunning
source: Previous command to start the Explorer is in progress
ru: Предыдущая команда открытия Проводника еще не выполнена

# EFPApp_Msg_FormMinimized
source: {0} (minimized)
ru: {0} (свернуто)

# EFPApp_Phase_DirExists
source: Is directory exist test
ru: Определение существования каталога

# EFPApp_Phase_FileExists
source: Is file exist test
ru: Определение существования файла

# EFPApp_Phase_ShowWindowsExplorer
source: Starting {0}
ru: Запуск {0}

# EFPApp_Title_LoadComposition
source: Restore workspace composition
ru: Восстановление интерфейса

# EFPApp_Title_SelectForm
source: Select a window
ru: Выбрать окно

# EFPTwainHandler_ErrTitle_Init
source: TWAIN initialization failed
ru: Ошибка инициализации TWAIN

# EFPTwainHandler_Err_NoMainWindow
source: Application main window is closed
ru: Главное окно программы закрыто

# EFPTwainHandler_Phase_Init
source: TWAIN initialization
ru: Инициализация TWAIN

# EFPTwainHandler_Phase_Scan
source: Scan in progress
ru: Идет сканирование

# EFPTwainHandler_Phase_Start
source: Scan starts
ru: Запуск сканирования

# ErrorMessageKind_Title_Errors
source: Errors
ru: Ошибки

# ErrorMessageKind_Title_Infos
source: Messages
ru: Сообщения

# ErrorMessageKind_Title_None
source: No errors
ru: Нет ошибок

# ErrorMessageKind_Title_Warnings
source: Warnings
ru: Предупреждения

# ErrorMessageKind_ToolTip_Errors
source: Errors: {0}
ru: Ошибок: {0}

# ErrorMessageKind_ToolTip_Infos
source: Messages: {0}
ru: Сообщений: {0}

# ErrorMessageKind_ToolTip_NoMessageList
source: Error message list is not attached
ru: Список ошибок не присоединен

# ErrorMessageKind_ToolTip_None
source: There are no error messages
ru: Нет сообщений об ошибках

# ErrorMessageKind_ToolTip_Warnings
source: Warnings: {0}
ru: Предупреждений: {0}

# ExtTextRenderer_Err_NotForPaint
source: Object is suitable only for measurement
ru: Объект предназначен только для измерения

# FileEditorFormHandler_Title_Default
source: No name
ru: Без имени

# MessageBox_Title_Confirmation
source: Confirmation
ru: Подтверждение

# MessageBox_Title_Error
source: Error
ru: Ошибка

# MessageBox_Title_Information
source: Information
ru: Сообщение

# MessageBox_Title_Warning
source: Warning
ru: Предупреждение

# Wizard_Arg_ControlIsForm
source: Control is a Form class. If you use a template form, add a panel. Put controls on the Panel and send the Panel as an argument.
ru: Управляющий элемент не может быть Form. Если используется форма-шаблон, то добавьте панель элементами и передавайте Panel в конструктор WizardStep

# Wizard_Arg_ControlIsTabPage
source: Control is a TabPage class. If you use a template form with TabControl, add a Panel to TabPage . Put controls on the Panel and send the Panel as an argument.
ru: Управляющий элемент не может быть TabPage. Если используется форма-шаблон, то добавьте на TabPage объект Panel с элементами и передавайте Panel в конструктор WizardStep

# Wizard_Arg_TempPageAlreadyAttached
source: Temprary page already attached
ru: Повторное присоединение временной страницы

# Wizard_Err_AlreadyStarted
source: Property can be set until the wizard started
ru: Свойство можно устанавливать только до запуска мастера

# Wizard_Err_BackFromFirstStep
source: Cannot go back from the first step
ru: Нельзя отменить первый шаг

# Wizard_Err_NoNextStep
source: Next step is not defined
ru: Следующий кадр не определен

# Clipboard_ErrTitle_GetData
source: Error extracting data from the clipboard
ru: Ошибка чтения из буфера обмена

# Clipboard_ErrTitle_SetData
source: Error writing data to the clipboard
ru: Ошибка записи в буфер обмена

# Clipboard_Err_NoText
source: There is no text in the clipboard
ru: Буфер обмена не содержит текста

# Clipboard_Phase_GetData
source: Extracting data from the clipboard
ru: Извлечение данных из буфера обмена

# Clipboard_Phase_SetData
source: Copying data to the clipboard
ru: Копирование данных в буфер обмена

# Cmd_Menu_Edit
source: &Edit
ru: &Правка

# Cmd_Menu_Edit_Find
source: &Find ...
ru: &Найти ...

# Cmd_Menu_Edit_FindNext
source: Find &next
ru: Найти &далее

# Cmd_Menu_Edit_Goto
source: Go to ...
ru: Перейти ...

# Cmd_Menu_Edit_IncSearch
source: Incremental search
ru: Найти по первым буквам

# Cmd_Menu_Edit_PasteSpecial
source: Paste &special ...
ru: Сп&ециальная вставка ...

# Cmd_Menu_Edit_Redo
source: &Redo
ru: &Отменить

# Cmd_Menu_Edit_Replace
source: Replace ...
ru: Заменить ...

# Cmd_Menu_Edit_SelectAll
source: Select &all
ru: В&ыделить все

# Cmd_Menu_Edit_Undo
source: &Undo
ru: Пов&торить

# Cmd_Menu_File
source: &File
ru: &Файл

# Cmd_Menu_File_Exit
source: E&xit
ru: В&ыход

# Cmd_Menu_File_New
source: Create
ru: Создать

# Cmd_Menu_File_Open
source: Open
ru: Открыть

# Cmd_Menu_File_PageSetup
source: Page setup ...
ru: Параметры страницы ...

# Cmd_Menu_File_Print
source: Print ...
ru: Печать ...

# Cmd_Menu_File_PrintPreview
source: Print preview
ru: Предварительный просмотр

# Cmd_Menu_File_Save
source: Save
ru: Сохранить

# Cmd_Menu_File_SaveAs
source: Save as
ru: Сохранить как

# Cmd_Menu_Help
source: &Help
ru: &Справка

# Cmd_Menu_Help_About
source: About ...
ru: О программе ...

# Cmd_Menu_Help_Contents
source: &Contents
ru: &Содержание

# Cmd_Menu_Help_ContextHelp
source: Context help
ru: Контекстная помощь

# Cmd_Menu_Help_Index
source: &Index
ru: &Указатель

# Cmd_Menu_SendTo
source: Send &to
ru: Отправит&ь

# Cmd_Menu_SendTo_InternetBrowser
source: Internet browser
ru: Интернет-обозреватель

# Cmd_Menu_SendTo_Notepad
source: Notepad
ru: Блокнот

# Cmd_Menu_View
source: &View
ru: &Вид

# Cmd_Menu_View_FullScreen
source: Full screen
ru: Во весь экран

# Cmd_Menu_View_Refresh
source: Refresh
ru: Обновить

# Cmd_Menu_View_RestoreToolBars
source: &Restore
ru: Восстановить

# Cmd_Menu_View_StatusBarVisible
source: &Status bar
ru: &Статусная строка

# Cmd_Menu_View_ToolBarOnBottom
source: &Bottom
ru: С&низу

# Cmd_Menu_View_ToolBarOnLeft
source: &Left
ru: С&лева

# Cmd_Menu_View_ToolBarOnRight
source: &Right
ru: С&права

# Cmd_Menu_View_ToolBarOnTop
source: &Top
ru: С&верху

# Cmd_Menu_View_ToolBars
source: &Toolbars
ru: &Панели инструментов

# Cmd_Menu_View_ToolBarVisible
source: Panel is visible
ru: Панель включена

# Cmd_Menu_Window
source: &Window
ru: &Окно

# Cmd_Menu_Window_ArrangeIcons
source: Arrange icons
ru: Упорядочить значки

# Cmd_Menu_Window_Cascade
source: Cascade
ru: Каскадом

# Cmd_Menu_Window_CloseAll
source: Close all
ru: Закрыть все

# Cmd_Menu_Window_CloseAllButThis
source: Close all but this
ru: Закрыть все, кроме текущего окна

# Cmd_Menu_Window_NewMainWindow
source: New main window
ru: Новое главное окно

# Cmd_Menu_Window_OtherWindows
source: Other windows ...
ru: Другие окна ...

# Cmd_Menu_Window_SavedCompositions
source: Saved compositions
ru: Композиции рабочего стола

# Cmd_Menu_Window_TileHorizotal
source: Tile horizontal
ru: Сверху вниз

# Cmd_Menu_Window_TileVertical
source: Tile vertical
ru: Слева направо

# Cmd_ToolTip_File_PrintDefault
source: Print on the default printer
ru: Печать на принтере по умолчанию

# Cmd_ToolTip_Help_Contents
source: Help contents
ru: Содержание справки

# Cmd_ToolTip_Help_Index
source: Help index
ru: Алфавитный указатель справки

# Cmd_ToolTip_SendTo_App
source: Open with {0}
ru: Открыть в {0}

# Cmd_ToolTip_SendTo_NotePad
source: Open with Notepad
ru: Открыть в Блокноте

# EFPApp_Arg_UnknownStdCommandCategoryAndName
source: Unknown standard command with the category '{0}' and name '{1}'
ru: Неизвестная стандартная команда с категорией '{0}' и именем '{1}'

# EFPApp_ErrTitle_InterfaceChanged
source: Error in main menu commands state initialization when user interface switched
ru: Ошибка инициализации состояния команд главного меню при переключении интерфейса

# EFPApp_ErrTitle_Wait
source: EFPApp.BeginWait()/EndWait() error catched once
ru: Перехват ошибки EFPApp.BeginWait()/EndWait(). Повторные сообщения не выводятся

# EFPApp_Err_NoCurrentForm
source: There is no current window
ru: Нет текущего окна

# EFPApp_Msg_RestoreToolBars_AllWindows
source: For all open windows
ru: Для всех открытых окон

# EFPApp_Msg_RestoreToolBars_CurrentWindow
source: For the current window only
ru: Только для текущего окна

# EFPApp_Phase_Wait
source: Wait
ru: Ждите

# EFPApp_Title_RestoreToolBars
source: Toolbars restoring
ru: Восстановление панелей инструментов

# EFPCommandItem_ErrTitle_Click
source: Error handling command '{0}'
ru: Ошибка при обработке команды '{0}'

# EFPCommandItem_ErrTitle_ClickUnhandled
source: Unhandler exception in command handler. Call the application developer.
ru: Неперехваченная ошибка при обработке команды. Обратитесь к разработчику программы

# EFPCommandItem_Err_AnotherOwner
source: Command '{0}' has been attached to another command list
ru: Команда '{0}' уже добавлена в другой список

# EFPCommandItem_Err_Disabled
source: Command disabled: '{0}'
ru: Команда заблокирована: '{0}'

# EFPCommandItem_Err_HasUIObjs
source: Command already has an attached UI object
ru: Команда уже имеет связанные объекты пользовательского интерфейса

# EFPCommandItem_Err_Hidden
source: Command hidden: '{0}'
ru: Команда невидима: '{0}'

# EFPCommandItem_Err_Nested
source: Previous executing of command '{0}' is in progress
ru: Предыдущее выполнение команды '{0}' еще не закончено

# EFPCommandItem_Err_NoHandler
source: There is no handler for the command '{0}'
ru: Нет обработчика выполнения команды '{0}'

# EFPCommandItem_Err_ParentNotAttached
source: Parent command '{0}' has not been attached to the current command list
ru: Родительская команда '{0}' не была присоединена к коллекции ранее

# EFPCommandItem_Name_StatusPanel
source: [status bar panel]
ru: [окно статусной строки]

# EFPMenu_Arg_AnoherMenu
source: Command '{0}' is situated in another menu
ru: Команда '{0}' располагается в другом меню

# EFPMenu_Arg_NotInMenu
source: Command '{0}' has not been added to the menu
ru: Команда '{0}' не была добавлена в меню

# EFPMenu_ErrTitle_DelayedInit
source: Delayed menu initialization failed
ru: Ошибка отложенной инициализации меню

# EFPMenu_Err_ParentNotAttached
source: Parent command '{0}' has not been attached to the menu object
ru: Родительская команда '{0}' не была добавлен в меню

# EFPMenu_Err_ParentNotInCommadList
source: Cannot attach the command '{0}' to menu, because parent command '{1}' has not been attached to the command list
ru: Нельзя присоединить команду '{0}' к меню, потому что ее родительская команда '{1}' не входит в список команд

# EFPMenu_Err_ParentNotInMenu
source: Cannot attach the command '{0}' to the menu, because parent command '{1}' does not belong to menu
ru: Нельзя присоединить команду '{0}' к меню, потому что ее родительская команда '{1}' не относится к меню

# EFPStatuBar_ErrTitle_DetachPanel
source: Error when status bar panel detached: {0}
ru: Ошибка отсоединения панели статусной строки {0}

# FileEditorFormHandler_Msg_NotSaved
source: Document '{0}' not saved. Save changes?"
ru: Документ '{0}' не сохранен. Сохранить изменения?"

# Keys_Name_Down
source: Arrow down
ru: Стрелка вниз

# Keys_Name_Left
source: Arrow left
ru: Стрелка влево

# Keys_Name_OemMinus
source: Top row [-]
ru: Верхний [-]

# Keys_Name_OemPlus
source: Top row [=]
ru: Верхний [=]

# Keys_Name_Right
source: Arrow right
ru: Стрелка вправо

# Keys_Name_Space
source: Space
ru: Пробел

# Keys_Name_Up
source: Arrow up
ru: Стрелка вверх

# Cmd_Menu_Debug_CurrentSettingsXML
source: Current dialog settings (XML)
ru: Текущие настройки диалога (XML)

# Cmd_Menu_Debug_SavedSettingsXML
source: Saved settings of the set (XML)
ru: Сохраненные настройки набора (XML)

# EFPAppCompositionHistoryItem_Arg_NotSaved
source: Composition has not been saved
ru: Композиция не записана

# EFPAppCompositionHistoryItem_ErrTitle_SavePreview
source: Preview image saving failed
ru: Не удалось сохранить изображение для предварительного просмотра

# EFPAppCompositionHistoryItem_Msg_Hist0
source: Last
ru: Последняя

# EFPAppCompositionHistoryItem_Msg_Hist1
source: Second last
ru: Предпоследняя

# EFPAppCompositionHistoryItem_Msg_HistN
source: Previous nr {0}
ru: Предыдущая №{0}

# EFPAppRI_Arg_BaseProviderForDialog
source: For the dialog. the BaseProvider must be null
ru: Для диалога BaseProvider не задается

# EFPAppRI_Arg_NoCreator
source: In the list EFPApp.RICreators, none of object could create the windows control for the remote control of type {0}
ru: В списке EFPApp.RICreators не один из объектов не смог создать управляющий элемент для элемента удаленного интерфейса типа {0}

# EFPAppRI_ErrTitle_WriteValues
source: Value writing error
ru: Ошибка записи значения

# EFPAppRI_Err_CannotAddToBandPanel
source: Control item '{0}' cannot be added to a control band
ru: Элемент '{0}' нельзя добавить к полосе управляющих элементов

# EFPApp_ErrTitle_ExitFailed
source: Cannot exit the application
ru: Не удалось завершить приложение

# EFPApp_ErrTitle_ExtractIconImage
source: Error extracting icon image
ru: Ошибка извлечения значка из файла

# EFPApp_ErrTitle_IdleSingleAction
source: Error when called the single-call idle handler
ru: Ошибка вызова обработчика однократного Idle-действия

# EFPApp_ErrTitle_LoadMainImages
source: Error when loading main images
ru: Ошибка загрузки значков

# EFPApp_ErrTitle_RestoreFormUnknownError
source: Error found on form '{0}' restoring
ru: Возникла неизвестная ошибка при восстановлении формы '{0}'

# EFPApp_ErrTitle_ShowForm
source: Form {0} showing failed
ru: Не удалось показать форму {0}

# EFPApp_Err_CannotCloseAllForms
source: Cannot close some open windows
ru: Не удалось закрыть все открытые окна

# EFPApp_Err_FormAlreadyInMainWindow
source: Form '{0}' already belongs to main window
ru: Форма '{0}' уже есть в списке форм главного окна

# EFPApp_Err_LoadCompositionForm
source: Form '{0}' restoring failed when composition loaded. {1}
ru: Возникла ошибка при восстановлении формы '{0}'. {1}

# EFPApp_Msg_CloseMainWindowCloseCurrent
source: Close current main window only
ru: Закрыть текущее главное окно

# EFPApp_Msg_CloseMainWindowExit
source: Exit the application
ru: Завершить работу

# EFPApp_Name_FormToolBar
source: Window toolbar
ru: Панель инструментов окна

# EFPApp_Phase_GetPrinterList
source: Gathering installed printers
ru: Определение списка установленных принтеров

# EFPApp_Phase_GetPrinterProps
source: Gathering printer '{0}' properties
ru: Получение свойств принтера '{0}'

# EFPApp_Phase_LoadFonts
source: Font list loading
ru: Загрузка списка установленных шрифтов

# EFPApp_Title_CloseMainWindow
source: Window '{0}' closing
ru: Закрытие окна '{0}'

# EFPApp_Title_CloseMainWindowAction
source: What are you going to do
ru: Что надо сделать

# EFPButton_ErrTitle_Click
source: Error when handled the button '{0}' click
ru: Ошибка при нажатии кнопки '{0}'

# EFPButton_Err_ClickInProgress
source: Previous click the button '{0}' has not been handled yet
ru: Предыдущее нажатие кнопки '{0}' еще не обработано

# EFPButton_Err_InsideClickEvent
source: Cannot be called inside Click event handler
ru: Не должно вызываться из обработчика события Click

# EFPButton_Phase_Click
source: Button '{0}' click handling
ru: Нажатие кнопки '{0}'

# EFPCheckBox_Arg_ThreeStateInGroup
source: CheckBox item at position {0} has a property value ThreeState=true
ru: Для CheckBox с индексом {0} установлено свойство ThreeState=true

# EFPCheckBox_Err_GroupNoneChecked
source: At least one check mark must be set
ru: Должен быть установлен хотя бы один флажок

# EFPCheckBox_Err_IndeterminateState
source: Check mark may be set or clean
ru: Флажок должен быть установлен, либо снят

# EFPErrorMessageListButton_Msg_Errors
source: Message list contains errors ({0})
ru: Список содержит ошибки ({0})

# EFPErrorMessageListButton_Msg_Warnings
source: Message list contains warnings ({0})
ru: Список содержит предупреждения ({0})
