Repository: a94827/FreeLibSet
Catalog: ExtForms/Res.*.resx
Languages: ru

# Cmd_Menu_View_LastPage
source: Last page
ru: Последняя страница

# Cmd_Menu_View_NextPage
source: Next page
ru: Следующая страница

# Cmd_Menu_View_PrevPage
source: Previous page
ru: Предыдущая страница

# Cmd_Menu_View_ShowGrid
source: Coordinate grid
ru: Координатная сетка

# Cmd_Status_Scale_SetScale
source: Scale {0} %
ru: Масштаб {0} %

# Cmd_ToolTip_Scale_100
source: Real size
ru: Один к одному

# Cmd_ToolTip_Scale_200
source: Double size
ru: Двукратное увеличение

# Cmd_ToolTip_Scale_50
source: Half size
ru: Половинный размер

# Cmd_ToolTip_Scale_500
source: Five time enlarged size
ru: Пятикратное увеличение

# Cmd_ToolTip_Scale_SetScale
source: Image view scale
ru: Масштаб просмотра изображения

# Cmd_ToolTip_View_GotoPage
source: Current viewed page
ru: Отображаемая страница в просмотре

# ExtPrintPreviewControl_Err_NoDoc
source: There is no document
ru: Нет документа

# ExtPrintPreviewControl_Msg_PagePrompt
source: Page number
ru: Введите номер страницы

# ExtPrintPreviewControl_Msg_PercentPrompt
source: Scale in percents
ru: Масштаб в процентах

# Cmd_Menu_File_FAOpenWith
source: Open with
ru: Открыть с помощью

# Cmd_Menu_File_FAOpenWith_Error
source: [ Error ]
ru: [ Ошибка ]

# Cmd_Menu_File_FAOpenWith_None
source: [ No application ]
ru: [ Нет приложения ]

# Cmd_Status_View_GotoPage_None
source: No pages
ru: Нет страниц

# Cmd_Status_View_GotoPage_One
source: Page {0} from {1}
ru: Страница {0} из {1}

# Cmd_Status_View_GotoPage_Range
source: Pages {0}-{1} from {2}
ru: Страницы {0}-{1} из {2}

# Cmd_ToolTip_File_FAOpen
source: Open file with {0} ({1})
ru: Открыть файл с помощью приложения {0} ({1})

# Cmd_ToolTip_File_FAOpen_Error
source: Error occurred when extracting file associations. {0}
ru: Возникла ошибка при получении файловых ассоциаций. {0}

# Cmd_ToolTip_File_FAOpen_None
source: There is no application could open a file with the extension '{0}'
ru: Нет приложения, которое может открывать файлы с расширением '{0}'

# EFPFileAssociationsCommandItemsHandler_Arg_MustStartWithDot
source: File extension must start with a dot character
ru: Расширение должно начинаться с точки

# EFPFileAssociationsCommandItemsHandler_ErrTitle_Init
source: Initialization error of EFPFileAssociationsCommandItemsHandler
ru: Ошибка инициализации EFPFileAssociationsCommandItemsHandler

# EFPFileAssociationsCommandItemsHandler_Err_ForFileExt
source: Error occurred when getting file associations for the extension '{0}'
ru: Не удалось получить файловые ассоциации для расширения '{0}'

# EFPFolderBrowserButton_ToolTip_Default
source: Directory selection via standard operating system dialog
ru: Выбор папки с помощью стандартного блока диалога операционной системы

# EFPPathValidator_Err_NestedValidation
source: Previous validation has not been finished yet
ru: Предыдущая проверка еще не закончена

# EFPFolderBrowserButton_Err_DragDrop
source: Drag&drop error. {0}
ru: Перетаскивание не удалось. {0}

# EFPFolderBrowserButton_Name_FormatFileDrop
source: Directory reference
ru: Ссылка на папку

# Clipboard_Err_NoFileDrop
source: There is no file/directory reference in the clipboard
ru: В буфере обмена нет ссылок на файлы/каталоги

# EFPFileBrowserButton_Err_PasteMulti
source: Only one file can be pasted
ru: Можно вставить только один файл

# EFPFileDialogButton_Err_DragDrop
source: Drag-and-drop failed. {0}
ru: Перетаскивание не удалось. {0}

# EFPFileDialogButton_Err_DragDropMulti
source: Only one file can be dragged-and-dropped
ru: Можно перетащить только один файл

# EFPFileDialogButton_Name_DragDropFormat
source: File reference
ru: Ссылка на файл

# EFPFileDialogButton_ToolTip_Default
source: Select a file with a standard operating system dialog
ru: Выбор файла с помощью стандартного блока диалога операционной системы

# EFPFolderBrowserButton_Err_DragDropMulti
source: Only one directory can be dragged-and-dropped
ru: Можно перетащить только один каталог

# EFPFolderBrowserButton_Err_PasteMulti
source: Only one directory can be pasted
ru: Можно вставить только один каталог

# EFPGridFilterGridView_Err_CannotEditFilters
source: Filters cannot be changed
ru: Изменение установленных фильтров запрещено

# EFPWindowsExplorerButton_Err_PathIsEmpty
source: Name is empty
ru: Имя не задано

# EFPWindowsExplorerButton_ToolTip_Default
source: Open selected folder with {0}
ru: Открытие выбранной папки с помощью {0}

# EFPWindowsExplorerButton_ToolTip_Unsupported
source: Folder browsing is not suppoted by the operating system
ru: Открытие папок на просмотр не поддерживается операционной системой

# EFPGridFilters_ErrTitle_ReadConfig
source: Error when load filter '{0}' state
ru: Ошибка загрузки состояния фильтра '{0}'

# EFPInputDataGridView_Err_RowValidating
source: Error occurred when row validated. {0}
ru: Ошибка при проверке строки. {0}

# EFPInputDataGridView_Msg_InfoText_CanAddRows
source: When text is pasted from the clipboard, the required rows will be added automatically
ru: При вставке из буфера обмена недостающие строки будут добавлены автоматически

# Cmd_Menu_File_ExportFile
source: Export to file ...
ru: Экспорт в файл...

# EFPMenuOutHandler_Phase_ExportFile
source: Export to file {0}
ru: Экспорт в файл {0}

# EFPMenuOutHandler_Phase_SendTo
source: Sending to {0}
ru: Отправка в {0}

# EFPSendToItem_ToolTip_Simple
source: Send to {0}
ru: Отправить в {0}

# EFPSendToItem_ToolTip_WithSubMenu
source: Send {0} to {1}
ru: Отправить {0} в {1}

# MonthDayBox_Arg_IsEmpty
source: MonthDayBox control does not support empy values
ru: Компонент MonthDayBox не поддерживает пустые значения

# Clipboard_Err_NoDataFormat
source: There is no data presented in '{0}' format
ru: Нет данных в формате '{0}'

# Clipboard_Err_NoImage
source: The clipboard does not contain an image
ru: Буфер обмена не содержит изображения

# Cmd_Menu_Edit_AcquareImage
source: Acquare from scanner or camera
ru: Со сканера или камеры

# Cmd_Menu_Edit_ClearImage
source: Clear image
ru: Очистить изображение

# Cmd_Menu_Edit_PasteAuxMenu
source: Paste options
ru: Дополнительные варианты вставки

# Cmd_Menu_Edit_ViewImage
source: View image
ru: Просмотр изображения

# Cmd_Menu_StartEMailApp
source: Start e-mail application
ru: Запустить почтовую программу

# EFPEMailLabel_Err_NoAddress
source: E-mail address not given
ru: Адрес электронной почты не задан

# EFPEMailLabel_Err_Start
source: Error starting e-mail application. {0}. If you send messages via Internet page instead of an installed appication, you should copy the e-mail address to the clipboard and then paste it in the proper input field on the page.
ru: Ошибка отправки почты. {0}. Если Вы отправляете электронную почту не через почтовую программу, а со страницы в Интернете, то скопируйте адрес в буфер обмена и вставьте его в нужное поле ввода на странице.

# EFPPasteFormat_Err_ActionCode
source: Wrong action '{0}'
ru: Неподходящее действие '{0}'

# EFPPasteFormat_Err_BusyPaste
source: Now it's another paste format '{0}' pasting
ru: В данный момент выполняется вставка для формата '{0}'

# EFPPasteFormat_Err_BusyTest
source: Now it's another paste format ('{0}') testing
ru: В данный момент выполняется тестирование другого формата вставки ('{0}')

# EFPPasteFormat_Err_FormatNotAppliable
source: Format is not aplliable
ru: Формат не применим

# EFPPasteFormat_Err_NoPasteFormats
source: There is no paste format handler presented
ru: Не задано ни одного обработчика форматов данных

# EFPPasteFormat_Err_PasteSpecial
source: Нельзя выполнить вставку в формате '{0}'
ru: Cannot perform paste in the format '{0}'

# EFPPasteFormat_Err_TestError
source: Error occured when format appliance was tested. {0}
ru: Ошибка при определении применимости формата. {0}

# EFPPasteFormat_Title_AllFormats
source: {0} (all formats)
ru: {0} (все форматы)

# EFPPasteFormat_Title_Preview
source: {0} - Preview
ru: {0} - предварительный просмотр

# EFPPasteFormat_Title_SpecialPasteFormatGroup
source: Data format in the clipboard
ru: Формат данных в буфере обмена

# EFPPasteTextMatrixFormat_Err_ToMatrix
source: Error converting text to a rectangle block. {0}
ru: Ошибка преобразования текста в прямоугольный блок. {0}

# EFPPasteTextMatrixFormat_Name_Csv
source: Comma-separated text
ru: Текст, разделенный запятыми

# EFPPasteTextMatrixFormat_Name_Text
source: Unformatted text
ru: Неформатированный текст

# EFPRadioButtons_Err_DisabledSelected
source: Disabled item cannot be selected
ru: Заблокированная позиция не может быть выбрана

# EFPThumbnailPictureButton_Err_LoadFile
source: Error occurred when file '{0}' loaded. {1}
ru: Не удалось загрузить файл изображения '{0}'. {1}

# EFPThumbnailPictureButton_FileFilter_AllImages
source: All images
ru: Все изображения

# EFPThumbnailPictureButton_FileFilter_BMP
source: Bitmap pictures (BMP)
ru: Точечные рисунки (BMP)

# EFPThumbnailPictureButton_Msg_NoImage
source: No image
ru: Нет изображения

# EFPThumbnailPictureButton_Name_Default
source: Image
ru: Изображение

# EFPThumbnailPictureButton_Title_View
source: {0} - Image view ({1}x{2})
ru: {0} - Просмотр изображения ({1}x{2})

# EFPThumbnailPictureButton_ToolTip_Edit_Paste
source: Paste image from the clipboard{0}
ru: Вставить изображение из буфера обмена{0}

# EFPThumbnailPictureButton_ToolTip_File_Open
source: Load image from a file{0}
ru: Загрузить изображение из файла{0}

# EFPThumbnailPictureButton_ToolTip_ShrinkAuxText
source: . Image will be shrinked to size {0}x{1} pixels
ru: . Изображение будет уменьшено до размера {0}x{1} пикселей

# Cmd_Menu_Edit_ConvertTextMenu
source: Convert text
ru: Преобразовать текст

# Cmd_Menu_Edit_InsertNewLine
source: Insert New Line
ru: Вставить перевод строки

# Cmd_Menu_Edit_InvertCase
source: &iNVERT cASE
ru: &иЗМЕНИТЬ рЕГИСТР

# Cmd_Menu_Edit_ToLowerCase
source: to &lower case
ru: к &нижнему регистру

# Cmd_Menu_Edit_ToUpperCase
source: TO &UPPER CASE
ru: К &ВЕРХНЕМУ РЕГИСТРУ

# EFPApp_Err_OpenWith
source: Cannot start '{0}'. {1}
ru: Не удалось запустить '{0}'. {1}

# EFPCsvCodesComboBoxBase_ToolTip_ClearButton
source: Clear selected codes
ru: Очистить выбранные коды

# EFPCsvCodesComboBoxBase_ToolTip_PopupButton
source: Select codes from the list
ru: Выбрать коды из списка

# EFPCsvCodesComboBox_Err_UnknownCode
source: The code not found in the list
ru: Кода нет в списке

# EFPCsvCodesTextBox_Err_CodeTwice
source: Code '{0}' presented twice
ru: Код '{0}' задан дважды

# EFPCsvCodesTextBox_Err_EmptyCode
source: Empty code presented
ru: Задан пустой код

# EFPCsvCodesTextBox_Err_WrongCode
source: Wrong code #{0}: '{1}'. {2}
ru: Неправильный код №{0}: '{1}'. {2}

# EFPCsvCodesTextBox_ToolTip_Codes
source: Code count: {0}
ru: Выбрано кодов: {0}

# EFPFileAssociationsCommandItemsHandler_Err_NoData
source: There are no data to send
ru: Нет данных для отправки

# EFPListMultiSelComboBox_Msg_AllSelected
source: [ all ]
ru: [ все ]

# EFPListMultiSelComboBox_Msg_Empty
source: [ none ]
ru: [ нет ]

# EFPSelRCDataGridView_Err_Cell
source: Row {0}, column {1} ('{2}'). {3}
ru: Строка {0}, столбец {1} ('{2}'). {3}

# EFPSelRCDataGridView_Err_ColumnNotFound
source: Column with name '{0}' not found
ru: Не найден столбец с названием '{0}'

# EFPSelRCDataGridView_Err_ColumnTwice
source: Column '{0}' selected twice
ru: Столбец '{0}' выбран дважды

# EFPSelRCDataGridView_Err_InitSelectedColumnsUnchanged
source: No new bindings has been added
ru: Не удалось назначить другие столбцы

# EFPSelRCDataGridView_Err_NoColumns
source: There is no selected column
ru: Не выбрано ни одного столбца

# EFPSelRCDataGridView_Err_NoData
source: There are no data
ru: Нет данных для выбора

# EFPSelRCDataGridView_Err_NoRows
source: There is no selected row
ru: Нет ни одной выбранной строки данных

# EFPSelRCDataGridView_Menu_Edit_ClearSelectedColumns
source: Clear columns binding
ru: Очистить привязку столбцов

# EFPSelRCDataGridView_Menu_Edit_InitSelectedColumns
source: Initialize columns binding
ru: Установить привязку столбцов

# EFPSelRCDataGridView_Msg_CornerCell
source: This cell is not used
ru: Эта ячейка не используется

# EFPSelRCDataGridView_Msg_DataCell
source: Cells with data cannot be edited
ru: Нельзя редактировать значения

# EFPSelRCDataGridView_Msg_None
source: [ None ]
ru: [ Нет ]

# EFPSelRCDataGridView_ToolTip_RowFlag
source: Row used
ru: Использование строки

# EFPSelRCDataGridView_ToolTip_TopLeftCell
source: Total rows: {0}, columns: {1}
ru: Всего строк: {0}, столбцов: {1}

# EFPTabPage_Err_SelectHiddenPage
source: Cannot activate a hidden page
ru: Нельзя активировать скрытую страницу

# EFPTabPage_Name_Default
source: For TabPage '{0}'
ru: Для страницы '{0}'

# EFPTextBox_Err_Empty
source: There is not text
ru: Нет текста

# EFPTextBox_Err_NoSelection
source: There is no selected text
ru: Нет выделенного фрагмента текста

# EFPTextBox_Name_MulilineReadOnly
source: Text view
ru: Просмотр текста

# EFPTextBox_Name_MultiLine
source: Text editor
ru: Текстовый редактор

# EFPTextBox_Name_Password
source: Password input
ru: Поле ввода пароля

# EFPTextBox_Name_PasteFormat
source: Text
ru: Текст

# EFPTextBox_Name_SingleLine
source: Text input
ru: Поле ввода текста

# EFPTextBox_Status_Column
source: Column {0}
ru: Столбец {0}

# EFPTextBox_Status_Row
source: Line {0}
ru: Строка {0}

# EFPTreeViewAdv_Name_Default
source: Tree view
ru: Иерархический просмотр

# EFPUserTextComboBox_ToolTip_ClearButton
source: Clean text
ru: Очистить введенное значение

# EFPXmlViewBox_Arg_FileNameWithPath
source: File name should not have path
ru: Имя файла не должно содержать путь

# EFPXmlViewBox_Err_Empty
source: The view does not conatin XML data
ru: Просмотр не содержит XML-данных

# EFPXmlViewBox_Err_NoDoc
source: No document
ru: Нет документа

# Clipboard_Err_UnextpectedType
source: For the data '{0}' returned object has unexpected type {1}
ru: Для данных '{0}' получен объект неизвестного типа: {1}

# EFPBaseProvider_Err_AttachToItself
source: Cannot attachEFPBaseProvider to itself
ru: Нельзя присоединить EFPBaseProvider к самому себе

# EFPReentranceLocker_Err_PrevInProgress
source: Previous operation has not been finished yet: {0}
ru: Предыдущая операция еще не закончена: {0}

# EFPReentranceLocker_Name_Default
source: Unknown action
ru: Неизвестное действие

# ListControlImagePainter_Arg_nulls
source: Image list or handler must be not null
ru: Список изображений или обработчик должны быть заданы

# XmlEditor_ErrTitle_FromText
source: Error in editor
ru: Ошибка в редакторе

# XmlEditor_Err_FormClosing
source: Error when editor form closing
ru: Ошибка закрытия формы редактора

# XmlEditor_Err_FromText
source: Text on the Edit page contsins errors. It cannot be converted onto XML document
ru: Введенный текст содержит ошибки и не может быть преобразован в XML-документ. {0}

# XmlEditor_Title_Form
source: XML document
ru: Документ XML

# XmlEditor_ToolTip_Edit
source: XML document editing as unformatted text
ru: Редактирование XML-документа в виде неформатированного текста

# XmlEditor_ToolTip_View
source: XML document formatted view
ru: Просмотр форматированного XML-документа

# YearMonthBox_Err_Inverted
source: First month is after th last month
ru: Начальный месяц больше конечного

# YearMonthRangeBox_Arg_DiffYear
source: Range must belongs a single year
ru: Интервал дат должен относиться к одному году

# Cmd_Menu_View_ShowToolTips
source: ToolTips
ru: Всплывающие подсказки

# EFPFormProvider_ErrTitle_FormClosed
source: Error occurred when form closed
ru: Ошибка при закрытии формы

# EFPFormProvider_ErrTitle_OnTick
source: Form update error
ru: Ошибка обновления формы

# EFPFormProvider_ErrTitle_SetFocus
source: Error occurred when focus set
ru: Ошибка установки фокуса ввода

# EFPFormProvider_Err_CannotInitHelpContext
source: Cannot init help context at the first time if the has already been shown
ru: Нельзя первоначально инициализировать контекст справки, когда форма уже выведена

# EFPFormProvider_Err_FormProviderNotFound
source: EFPFormProvider not found for the form {0}
ru: Не найден EFPFormProvider для формы {0}

# EFPFormProvider_Err_HasBeenShown
source: Form '{0}' has already been shown
ru: Форма '{0}' уже была выведена на экран

# EFPFormProvider_Err_NestedClosing
source: Nested form closing
ru: Повторное закрытие формы

# EFPFormProvider_Err_OnTick
source: Form update error. {0}
ru: Ошибка обновления формы. {0}

# EFPFormProvider_Menu_Debug_EFPFormProvider
source: Debug EFPFormProvider object
ru: Просмотр объекта EFPFormProvider

# EFPFormProvider_Menu_Help_ContextHelp
source: Help
ru: Справка

# EFPFormProvider_Phase_FormClosing
source: Form closing
ru: Закрытие формы

# EFPFormProvider_ToolTip_Disabled
source: {0} [Disabled]
ru: {0} [Заблокировано]

# EFPDataViewOrder_Err_NoDefaultValue
source: For the expression '{0}' of sort order '{1}' is impossible to calculate default value to define expression data type
ru: Для выражения '{0}' порядка сортировки '{1}' не удалось вычислить значение по умолчанию, чтобы определить тип данных

# EFPDataView_Err_ToolTip
source: Error occurred when tooltip getting. {0}
ru: Ошибка при получении подсказки. {0}

# EFPGridProducer_Arg_NoNamedConfig
source: Fixed grid config with the name '{0}' has not been defined for the grid producer
ru: Фиксированная настройка табличного просмотра с именем '{0}' не была объявлена в генераторе табличного просмотра

# EFPGridProducer_Err_ErrColInOrder
source: Wrong source column name '{0}', used in sort order '{1}'. {2}
ru: Неправильное имя исходного столбца '{0}', используемого в порядке сортировки '{1}'. {2}

# EFPGridProducer_Err_ErrItemName
source: Wrong column name in item '{0}'. {1}
ru: Неправильное имя столбца в объекте '{0}'. {1}

# EFPGridProducer_Err_ErrSourceColumnName
source: Wrong source column name '{0}' in caculated item '{1}'. {2}
ru: Неправильное имя исходного столбца '{0}' в вычисляемом объекте '{1}'. {2}

# EFPGridProducer_Err_NameBadChar
source: Name contains an invalid char '{0}'
ru: Имя содержит недопустимый символ '{0}'

# EFPGridProducer_Err_NameIsEmpty
source: Name is empty
ru: Имя не задано

# EFPGridProducer_Err_NameStartsEndsDot
source: Name cannot start or end with dot char
ru: Имя не может начинаться или заканичиваться точкой

# EFPGridProducer_Err_NameTwoDots
source: Name cannot contain two doth together
ru: Имя не может содержать 2 точки подряд

# EFPGridProducer_Err_UnknownCalcColumnName
source: Wrong calculated column name '{0}'. This name presents in the source column name list used in another item of EFPGridProducer
ru: Неправильное имя вычисляемого столбца '{0}', так как это имя есть в списке исходных столбцов в других объектах EFPGridProducer

# EFPGridProducer_Err_UnknownCalcToolTipName
source: Wrong calculated tooltip name '{0}'. This name presents in the source column name list used in another item of EFPGridProducer
ru: Неправильное имя вычисляемой всплывающей подсказки '{0}', так как это имя есть в списке исходных столбцов в других объектах EFPGridProducer

# EFPGridProducer_Err_UnknownDefaultConfigName
source: Named configuration '{0}' not found. This name is set for the DefaultConfigName property of data view
ru: Фиксированная настройка табличного просмотра с именем '{0}' не найдена. Это имя задано в свойстве DefaultConfigName провайдера просмотра

# EFPGridProducerEditor_Err_NoColumnSelected
source: No one column selected
ru: Не выбрано ни одного столбца

# EFPGridProducerEditor_Err_NotSizeableColumn
source: Column '{0}' has a prdefined width
ru: Для столбца '{0}' нельзя менять ширину

# EFPGridProducerEditor_Err_WidthForHiddenColumn
source: Cannot set width for a hidden column
ru: Нельзя задавать ширину столбца, который не выводится на экран

# EFPGridProducerEditor_Err_WrongFrozenColumns
source: Wrong number of frozen columns
ru: Недопустимое число замороженных столбцов

# EFPGridProducerEditor_Msg_NoStartColumn
source: [ None ]
ru: [ Нет ]

# EFPGridProducerEditor_Msg_ToolTipsOff
source: Tool tips are turned off
ru: Всплывающие подсказки отключены

# EFPGridProducerEditor_ToolTip_StartColumn
source: If a column selected here, it will be activated every time when data view shown. If '[None]' selected, the last user-selected column will be saved beetween data view appears.
ru: Если указан столбец, то он будет активироваться при каждом открытии табличного просмотра. Если выбран вариант '[ Нет ]', то последний выбранный столбец запоминается между открытиями просмотра

# EFPGridProducer_Arg_EmptySourceColumn
source: SourceColumnNames cannot contain empty items
ru: SourceColumnNames не может содержать пустые элементы

# EFPGridProducer_Arg_NameStartsWithDigit
source: Name cannot start with a digit because it is not possible to save view settings in config section
ru: Имя не может начинаться с цифры, т.к. это несовместимо с сохранением настройки просмотра

# EFPGridProducer_Arg_SourceColumnNameIsName
source: Item in SourceColumnNames is equal to the calculated column/tooltip name '{0}'
ru: Элемент в SourceColumnNames совпадает с именем вычисляемого столбца/подсказки '{0}'

# EFPGridProducer_Arg_SourceColumnNameTwice
source: Item name '{0}' in SourceColumnNames presented twice
ru: Два одинаковых элемента '{0}' в SourceColumnNames

# EFPGridProducer_Arg_SourceColumnWithComma
source: Item in SourceColumnNames cannot have a comma char
ru: Элементы в SourceColumnNames не могут содержать запятые

# EFPGridProducer_ColTitle_RowOrder
source: Nr
ru: № п/п

# EFPGridProducer_ToolTip_WrongValue
source: Wrong value: {0}
ru: Неправильное значение: {0}

# Cmd_Menu_View_CloseAllTabs
source: Close all aux tabs
ru: Закрыть все дополнительные вкладки

# Cmd_Menu_View_CloseAllTabsButThis
source: Close all aux tabs but this
ru: Закрыть все дополнительные вкладки, кроме текущей

# Cmd_Menu_View_CloseTab
source: Close tab
ru: Закрыть вкладку

# EFPReport_Arg_ParentControlHasChildren
source: Parent control contains another children
ru: Родительский элемент уже имеет присоединенные управляющие элементы

# EFPReport_Arg_ParentControlHasNoForm
source: Parent control does not belong to any form
ru: Родительский элемент не присоединен к форме

# EFPReport_ErrTitle_Closing
source: Error occurred when the report is about to be closed
ru: Ошибка при закрытии окна отчета

# EFPReport_ErrTitle_QueryParams
source: Error occurred when the report parameters queried
ru: Ошибка при запросе параметров

# EFPReport_ErrTitle_ReadConfig
source: Parameters reading error
ru: Ошибка загрузки параметров

# EFPReport_ErrTitle_SelectPage
source: Error occurred when report page selected
ru: Ошибка при переключении на страницу отчета

# EFPReport_ErrTitle_WriteConfig
source: Parameters writing error
ru: Ошибка записи параметров

# EFPReport_Err_ConfigSectionNotFound
source: Report '{0}' parameters config section not found
ru: Не удалось найти секцию параметров отчета '{0}'

# EFPReport_Err_CreateParams
source: This report always uses the external-set params
ru: Этот отчет всегда использует задаваемые снаружи параметры

# EFPReport_Err_ReadConfig
source: Error occurred when reading previously stored report parameters. Default values vill be used instead. Error message is: {0}
ru: Возникла ошибка при загрузке ранее сохраненных параметров отчета. Будут использованы значения по умолчанию. Сообщение об ошибке: {0}

# EFPReport_Err_ReentrantBuiild
source: Report building is already in progress
ru: Построение отчета уже начато

# EFPReport_Err_WriteConfig
source: Error occurred when the report parameters was saved. Error message is: {0}
ru: Возникла ошибка при сохранении параметров отчета. Сообщение об ошибке: {0}

# EFPReport_Menu_Edit_Refresh
source: Refresh report with the same parameters
ru: Обновить отчет без изменения параметров

# EFPReport_Msg_CloseAnyway
source: Close window '{0}' regardless the error?
ru: Закрыть окно '{0}' несмотря на возникшую ошибку?

# EFPReport_Phase_Build
source: Report '{0}' creating
ru: Построение отчета '{0}'
